{"title": "Cleaning my depression flat after months of being in a bad place", "selftext": "\n\nHi,\n\nI just wanted to share my before and after of my living room & kitchen.. mostly because I'm proud but also because when I was trying to start this, I couldn't find much on the internet & that made me feel worse. \n\nThis is a build up of being depressed for months, if not years, just scraping by. So please, no judgement. Eventually it got to the point there was just no more space to do anything, couldn't cook or have a space to relax and it made my depression worse.. I took a week off work & this is what I managed. There's still the bedroom, but I'm waiting on my new bed & drawers being delivered. Then next is the second bedroom which is piled high with just junk and rubbish, it's overwhelming, so taking a few days to recoup then I'll start there. Tips welcome!\n", "url": "https://www.reddit.com/gallery/1efs86p", "created_utc": 1722342984.0, "score": 136523, "author": "Consistent-Ad-1099", "num_comments": 5750, "permalink": "/r/CleaningTips/comments/1efs86p/cleaning_my_depression_flat_after_months_of_being/", "html_title": ""}
{"title": "Update on the depression den: progress, not perfection", "selftext": "", "url": "https://www.reddit.com/gallery/1f24s8q", "created_utc": 1724721308.0, "score": 92732, "author": "Odd-Sheepherder4055", "num_comments": 1415, "permalink": "/r/CleaningTips/comments/1f24s8q/update_on_the_depression_den_progress_not/", "html_title": ""}
{"title": "Thanks for helping me work what feels like a miracle!", "selftext": "Thanks so much to everyone who commented on my request for help post. I used Zep foaming bathroom cleaner one user suggested and then the “vinegar wallpaper” someone else recommended. I also used dryer sheets to wipe off what was left after the vinegar and it worked so well! \n\nI’m house sitting for friends and this shower has looked like this since they moved in— they didn’t think it could be cleaned. I wasn’t sure it could either lol, but I love a challenge. \n\nThis community is so awesome, I’ve learned so much here. ", "url": "https://www.reddit.com/gallery/1dx1t24", "created_utc": 1720306033.0, "score": 58201, "author": "auroraborealisbaby", "num_comments": 1088, "permalink": "/r/CleaningTips/comments/1dx1t24/thanks_for_helping_me_work_what_feels_like_a/", "html_title": ""}
{"title": "Finally changed sheets in depression bed, I feel so much better, please clap ", "selftext": "Going through a really scary and severe (and endless) depressive episode. My room is a mess and I haven’t put sheets or blankets on my bed in 2 weeks. I had clean sheets available. I was just too depressed to put them on. I’ve literally been sleeping on my bare mattress with a free floating blanket. It’s been awful, I dread it every night, and I was getting increasingly anxious that I was never gonna do it. But today, I DID IT. My room is still a mess, but after I made my bed, I decided I at least deserved a clear path to my bed (I’d been having to climb in from the bottom because there was a clothes mountain blocking my path), so I shoved everything out of the way (wasn’t up to putting them away, but I haven’t even had the energy to shove them before) so it felt cleaner and less obstructed when I got into bed. And that made me want to straighten my tiny little rug and turn on a lamp. And throw out like 75 Hershey kiss candy wrappers that previously covered my nightstand. \n\nAlmost cried in relief; room is still a mess but my bed feels like a bed again and it’s clean and warm and made and I’m so happy. Small victories, babyyyyyyy. ", "url": "https://www.reddit.com/gallery/1hq38a1", "created_utc": 1735608307.0, "score": 34776, "author": "PepperAnnDowd", "num_comments": 974, "permalink": "/r/CleaningTips/comments/1hq38a1/finally_changed_sheets_in_depression_bed_i_feel/", "html_title": ""}
{"title": "here is the long awaited update.. 10 hours of cleaning and it still feels so overwhelming. at least i can walk around now", "selftext": "", "url": "https://www.reddit.com/gallery/1c1qert", "created_utc": 1712869777.0, "score": 27357, "author": "justpassingbysorry", "num_comments": 2381, "permalink": "/r/CleaningTips/comments/1c1qert/here_is_the_long_awaited_update_10_hours_of/", "html_title": ""}
{"title": "Update to yesterday's post \"struggling with depression...\"", "selftext": "", "url": "https://www.reddit.com/gallery/1b1l4xx", "created_utc": 1709063456.0, "score": 21574, "author": "Acceptable-Sherbet20", "num_comments": 1134, "permalink": "/r/CleaningTips/comments/1b1l4xx/update_to_yesterdays_post_struggling_with/", "html_title": ""}
{"title": "Here's the update y'all have been waiting for", "selftext": "This secret will go with me to my grave or until my bf rats me out. Pic 1 is after I vacuumed it 3 times with my hand vac. Pic 2 is a mystery stain that idk when or where that came from. Pic 3 is the final result and pic 4 is the before. I couldn't find the tag on it but the fabric didn't feel like a specialty fabric so I hand washed it in almost cold water with the best thing you can find in a mexican household, ZOTE. After I hand scrubbed it I threw it in the wash on delicate cycle with cold water and a tiny amount of detergent (I washed both so they'd be clean). Then I put it to dry on the delicate setting with the temp on lowest low. And there's my result. Thanks to everyone who recommended vacuuming it first cause I wouldn't have done that lmao. The reason I was gonna wait til Tuesday was cause I had to go to a party with my MIL today but I wound up just skipping the party to clean this(and wrap secret presents). My kids are watched fairly well but seeing as how my daughter is literally 2 she can and will suddenly cause chaos. Thanks for y'all's tips!! ", "url": "https://www.reddit.com/gallery/1hf6yuo", "created_utc": 1734309833.0, "score": 21323, "author": "Hushiemommie", "num_comments": 434, "permalink": "/r/CleaningTips/comments/1hf6yuo/heres_the_update_yall_have_been_waiting_for/", "html_title": ""}
{"title": "If you missed the Irish Spring 5 in 1. I’m sorry I deleted! Here ya go;)", "selftext": "25 bucks worth of 5-1, 48 hour soak, minimal scrubbing, worked like a champ. Now I’ve hit it with “normal” cleaning products and the tub looks new. Roast away Reddit 😂 ", "url": "https://www.reddit.com/gallery/1htr1kf", "created_utc": 1736031862.0, "score": 20030, "author": "exhibitthis69", "num_comments": 481, "permalink": "/r/CleaningTips/comments/1htr1kf/if_you_missed_the_irish_spring_5_in_1_im_sorry_i/", "html_title": ""}
{"title": "Please help!! Human urine stains and smell on my dream couch ", "selftext": "After 15 years on Reddit my first post is mortifying. So to try to keep this short I went away for my anniversary weekend on Friday and my recovering alcoholic dad house sat to watch our dog. He ended up relapsing and peed on my leather couch and then slept in it for anywhere from 12-24 hours, once I got home early Sunday afternoon I tried to research and clean it. Ive spent the last day and a half trying to clean it through tears. I've gone through a bottle of white vinegar and two pounds of baking soda and this is where I'm at. I know it's almost impossible once dry but l'm hoping for a miracle. \n\n\nIs it too late? Is there anything I can do at all? I'll pay to have it cleaned if it even can be cleaned but I want to try everything I can before I have to give up.\n\n\nThis was my dream couch and was over $3000, I'm just devastated for both the situation and the last 36 hours l've spent covered in urine and baking soda. Thank you in advance.", "url": "https://www.reddit.com/gallery/1fisy67", "created_utc": 1726558437.0, "score": 19132, "author": "Commercial_While_364", "num_comments": 927, "permalink": "/r/CleaningTips/comments/1fisy67/please_help_human_urine_stains_and_smell_on_my/", "html_title": ""}
{"title": "I stripped my bfs hats....I'm horrified", "selftext": "", "url": "https://www.reddit.com/gallery/1b8967d", "created_utc": 1709754319.0, "score": 18953, "author": "taykaybo", "num_comments": 1561, "permalink": "/r/CleaningTips/comments/1b8967d/i_stripped_my_bfs_hatsim_horrified/", "html_title": ""}
{"title": "This sub in the last few weeks", "selftext": "", "url": "https://i.redd.it/t1wmvoz93zee1.jpeg", "created_utc": 1737738007.0, "score": 18394, "author": "_sup_homie_", "num_comments": 113, "permalink": "/r/CleaningTips/comments/1i904n6/this_sub_in_the_last_few_weeks/", "html_title": ""}
{"title": "What do yall think of my Vaccum Patterns", "selftext": "Hey Guys so I own a Cleaning Company located in Georgia & Been working By myself for a few years & Wanted some opinions on my Vacuuming ", "url": "https://www.reddit.com/gallery/1ifq1j3", "created_utc": 1738473519.0, "score": 16595, "author": "Nice_Sprinkles2981", "num_comments": 353, "permalink": "/r/CleaningTips/comments/1ifq1j3/what_do_yall_think_of_my_vaccum_patterns/", "html_title": ""}
{"title": "What is growing in my coffee machine? ", "selftext": "I noticed a lot of mould in my coffee machine drip tray so I opened up the side of the coffee machine And saw this…\n\nIt appears as though there are tiny microscopic bugs moving around but they are too small to tell what they are.\n\nI have no idea how to clean this without taking apart the whole coffee machine! \n\nI’ve never seen mould look like this before, does anyone know what this is or how I can clean it?", "url": "https://i.redd.it/6hd856xgexpd1.jpeg", "created_utc": 1726821359.0, "score": 16250, "author": "yellowcupboard12", "num_comments": 6077, "permalink": "/r/CleaningTips/comments/1fl79aq/what_is_growing_in_my_coffee_machine/", "html_title": ""}
{"title": "Just discovered laundry stripping and oh my god", "selftext": "My husband works maintenance…figured ya’ll would like this 😂", "url": "https://i.redd.it/nt5qwugvvg5b1.jpg", "created_utc": 1686523374.0, "score": 14838, "author": "hotcalvin", "num_comments": 1467, "permalink": "/r/CleaningTips/comments/1477sph/just_discovered_laundry_stripping_and_oh_my_god/", "html_title": ""}
{"title": "Irish Spring 5 in 1 and Mr. Clean Magic Erasers to the rescue ", "selftext": "The bathtub in our rental was left in this condition. I was skeptical, but tried the Irish Spring 5 in 1 another Redditor suggested and as you can see the tub came clean. I will say it did still require a good deal of scrubbing with two Magic Erasers. The first step was letting the shower run hot for about fifteen minutes. Then I slathered a think coat of Irish Spring 5 in 1 all over the entire tub and covered with paper towels to keep it in place. It was about three or four days before I got back to do the cleaning. I removed the paper towels and ran the shower for a bit to moisten everything. Then I scrubbed, and scrubbed, and scrubbed with microfiber cloth and Magic Erasers. Voila! ", "url": "https://www.reddit.com/gallery/1i3e66e", "created_utc": 1737112763.0, "score": 14818, "author": "itstrickyky", "num_comments": 378, "permalink": "/r/CleaningTips/comments/1i3e66e/irish_spring_5_in_1_and_mr_clean_magic_erasers_to/", "html_title": ""}
{"title": "Dryer sheets are THE move ", "selftext": "Filled our dinky trash can cleaning all 3 sides of our shower panels!!! Night and day difference!!! \n\nThanks to everyone who suggested it and posted pics!!!\n\nAlso, the pet shampoo is for our chocolate lab not us lol ", "url": "https://www.reddit.com/gallery/1fx4kcx", "created_utc": 1728175026.0, "score": 14489, "author": "WookieMonsterTV", "num_comments": 318, "permalink": "/r/CleaningTips/comments/1fx4kcx/dryer_sheets_are_the_move/", "html_title": ""}
{"title": "Took 3 hours but I'm thankful to this sub for all the amazing tips and encouragement ", "selftext": "I know now the hard part is maintaining it, but it feels so good to sit in a clean car after so long! Thank you guys !! ", "url": "https://www.reddit.com/gallery/1f6j0sr", "created_utc": 1725209266.0, "score": 12482, "author": "caleafornias", "num_comments": 172, "permalink": "/r/CleaningTips/comments/1f6j0sr/took_3_hours_but_im_thankful_to_this_sub_for_all/", "html_title": ""}
{"title": "UPDATE: Deteriorating Scrub Daddy was a fake! ", "selftext": "If you saw my last post about the barely used scrub daddy deteriorating at a rapid pace, here’s the update! I got in contact with scrub daddy, but they also reached out to me over Reddit. I bought the product off Amazon, and it looked very real, complete with heaps of 5 star reviews. However, Scrub Daddy themselves have confirmed that it was a fake, and kindly sent me some *real* replacements. Looking forward to testing these out 🧽\n\nThanks to everyone who told me that fakes were rampant, and for the advice! Above is a comparison - brand new, the fake looked identical. The only difference is maybe it was slightly less rigid out of packet? ", "url": "https://i.redd.it/7u3akin2aitd1.jpeg", "created_utc": 1728381667.0, "score": 11654, "author": "General_Ignoranse", "num_comments": 368, "permalink": "/r/CleaningTips/comments/1fyw5ab/update_deteriorating_scrub_daddy_was_a_fake/", "html_title": ""}
{"title": "UPDATE!!: I got my period on BF's $10k mattress and I'm mortified 😣 please help!", "selftext": "TYSM!! \nI can't believe the solution honestly. \n\nI tried cold water - NO DICE \nI tried peroxide - BUBKIS\nI tried stain removers - NADA \nI tried telling my bf he spent too much on his mattress - JK 😜 \n\nSPIT. WORKED. IMMACULATELY. 🤯\n\nHE WILL BE INVESTING IN A MATTRESS COVER.\n\nXOXO", "url": "https://www.reddit.com/gallery/18mww29", "created_utc": 1703085260.0, "score": 11579, "author": "Substantial_Tip_3227", "num_comments": 1643, "permalink": "/r/CleaningTips/comments/18mww29/update_i_got_my_period_on_bfs_10k_mattress_and_im/", "html_title": ""}
{"title": "Irish spring 5 in 1 shower before and after!", "selftext": "Could never get this soap scum off, and yes it’s been neglected as a new mom of 2 😅 but here’s the before and after! Soaked only about 2 hours, wiped off easily with a scrub daddy. Thankful for the tip from this sub!!!", "url": "https://www.reddit.com/gallery/1ic7nrn", "created_utc": 1738087039.0, "score": 11262, "author": "chocolate-loverr", "num_comments": 299, "permalink": "/r/CleaningTips/comments/1ic7nrn/irish_spring_5_in_1_shower_before_and_after/", "html_title": ""}
{"title": "Shower door just exploded wtf do I do/who do I call", "selftext": "Also i am in the ER. The door fell on me like something out of final destination but I managed to dodge the worst of it.", "url": "https://i.redd.it/1pb0307ow9ke1.jpeg", "created_utc": 1740048204.0, "score": 11221, "author": "r0ckyboats", "num_comments": 951, "permalink": "/r/CleaningTips/comments/1itvp71/shower_door_just_exploded_wtf_do_i_dowho_do_i_call/", "html_title": ""}
{"title": "i cleaned my year-long depression room", "selftext": "just wanted to share my win of the day :))", "url": "https://www.reddit.com/gallery/17b4het", "created_utc": 1697671295.0, "score": 11074, "author": "dumbassbltch", "num_comments": 371, "permalink": "/r/CleaningTips/comments/17b4het/i_cleaned_my_yearlong_depression_room/", "html_title": ""}
{"title": "17f cleaning my filthy home: KITCHEN PROGRESS", "selftext": "I included the photos from my original post— THANK YOU for all the help and support. There’s still a long way to go but progress is progress. This is after about 4 hours of scrubbing on the oven.", "url": "https://www.reddit.com/gallery/16svx41", "created_utc": 1695753205.0, "score": 11082, "author": "Quirky-Fox-2312", "num_comments": 622, "permalink": "/r/CleaningTips/comments/16svx41/17f_cleaning_my_filthy_home_kitchen_progress/", "html_title": ""}
{"title": "17F slowly cleaning my filthy home. deleted my original post because the amount of attention was making me kind of uncomfortable. PROGRESS!", "selftext": "3 hours of scrubbing later… thank you to everyone who helped me get cleaning supplies for the bathroom!!!", "url": "https://www.reddit.com/gallery/16pi3k2", "created_utc": 1695408520.0, "score": 10793, "author": "Quirky-Fox-2312", "num_comments": 715, "permalink": "/r/CleaningTips/comments/16pi3k2/17f_slowly_cleaning_my_filthy_home_deleted_my/", "html_title": ""}
{"title": "What you should expect from a professional carpet cleaner", "selftext": "TL;DR \nit hurts my heart seeing before and after pictures of carpet cleaning by “pros” who suck and give me a bad name. Below is what goes through my mind and is discussed when I’m doing what I do for a living.\nTL;DR\n\nYesterday I saw a post someone had issues with “pros” cleaning their carpets with some awesome before, after and 24 hours later pics. I commented that nothing about the performance would seem them as professional in my opinion. Lo and behold I walk into my first stop today and it looks like a similar issue. I figured I could post my process here so you all don’t keep getting taken by these garbage companies.\n\n1st pic - my client had work done and the worker tracked grease onto her carpet (new since covid). She tried to remove it with OTC spot cleaner. Half of that crap can bleach out your carpet (unlikely in this case because the fiber is polyester) most of it will leave a soapy residue. She said spots came back and she only used “clean water”. \n\nI tested the spots with clean water from the sink. Take a few drops, put it in the center of the spot and rub it with a gloved finger. If it cleans up, or soaps up, it’s a residue issue. Bonus points if you smell it and it smells like flowers r citrus. Sure enough it did “clean up” with just water.\n\nI informed the client of her options.\n\nOption 1 - I could treat the spots with a topical powdered defoamer and then treat the whole room and clean it as normal for my normal price but if any of the soap has gotten into the pad she may see some of the spots return in a few months. I could come back and do a deeper the of those at that time (which is more time consuming and more expensive)\n\nOption 2 - I could just do the expensive treatment on every spot and then I would happily guarantee the full removal of the spots and that should they return, I would come back for free and hit them again\n\nI recommended the first option, let’s see if we even need to spend all this time and her money on this. I’m going to try my best to fix it the first way without costing her too much money. I want happy clients that call me back, not ones I only clean for once.\n\nPic 2 - I applied the powdered defoamer to each spot, worked it in.\n\nPic 3 - I treated all the areas with my cleaning product. It’s called {redacted possibly breaks rule 1}. I don’t sell it but you can find it on Amazon. It’s green, odorless, residue free and works great. After I applied that I work the carpet with a matching commonly called a Counter Rotating Brush Machine, more specifically it’s called a {redacted possibly breaks rule 1}.\n\nPic 4 - is the final pic after I cleaned the carpet using a truck mounted cleaning machine. I stretch in tubes and hoses not a rolling machine you can rent from the local hardware place. My rig is less than a year old and set me back $125,000. Notice the nice “V” pattern under the table? I brushed the carpet after I was done. This restores the fiber pile allowing it to dry evenly. So many goobers out there skip this simple step and leave these hard lines in the carpet.\n\nHopefully this is not seen as self promotion, I just hated seeing what someone accepted as a good job when, to a trained eye, it was sub standard work at best. You all deserve better. \n\nAnd no, I’m not perfect, but I will be calling this client tomorrow to make sure those spots stayed gone and dried up nicely. If not, I will be back out there fixing the problem, not making excuses to not come back.\n", "url": "https://www.reddit.com/gallery/1g6189a", "created_utc": 1729198623.0, "score": 10751, "author": "programedtobelieve", "num_comments": 104, "permalink": "/r/CleaningTips/comments/1g6189a/what_you_should_expect_from_a_professional_carpet/", "html_title": ""}
{"title": "I'd say my new steam cleaner works.", "selftext": "Each grout line is taking about a minute to clean.  I scrub in light circles, letting the steam do the work. Wipe up the dirty water with a cloth and wring out.\n\nI've never been able to get this floor this clean. ", "url": "https://i.redd.it/orw5h9gzdwoe1.jpeg", "created_utc": 1742063771.0, "score": 10691, "author": "SewSewBlue", "num_comments": 159, "permalink": "/r/CleaningTips/comments/1jc1ueu/id_say_my_new_steam_cleaner_works/", "html_title": ""}
{"title": "One of the best cleaning tips I’ve learned for depression and ADHD", "selftext": "I suffer from pretty severe executive dysfunction caused by ADHD and depression. This causes me to have a constant mental block when it comes to cleaning: I.e., I KNOW I need to do the thing, I know that I’ll feel better once it’s done, but I can’t get myself to do it. Why? Because I feel ashamed.\n\nI was talking with a friend who’s a professional cleaner, and asked her “why is it that I can never clean my house the way that professionals do” and she said one of the most profound (and probably obvious) things I’ve heard.\n\nProfessional cleaners do such a thorough job cleaning because they have absolutely no emotional attachment to your house. When they see a mess on the counters, dishes piled up, dust all over the furniture, dirt on the baseboards, they don’t think “god, I am such a disgusting slob for letting it go this far. How do I live like this?” instead, they simply acknowledge there is a mess and then clean the mess. \nThe reason why it’s so hard for me, and for so many others, is because a lot of us feel an enormous amount of shame surrounding our home. Every time I cleaned, I would beat myself up over it. Which then, gave me no motivation to clean because I didn’t like the way I felt. There was no dopamine rush when I feel an emotional attachment to it. \n\nNow when I clean, I literally try and pretend I’m a professional maid in someone else’s house helping them clean. I see a mess, acknowledge that it’s a mess, then clean it. Basically just gaslighting myself until the timer goes off and I’ve conquered at least some of the mess. It’s been a work in progress, and it has not happened over night but this has seriously improved my attitude around cleaning in general. I feel a lot less shame and sadness around it.\n\nI know this probably sounds dumb or obvious, but hoping this can help another neurodivergent redditor with bad executive dysfunction.", "url": "https://www.reddit.com/r/CleaningTips/comments/1f26t45/one_of_the_best_cleaning_tips_ive_learned_for/", "created_utc": 1724727340.0, "score": 9990, "author": "actuallychill", "num_comments": 410, "permalink": "/r/CleaningTips/comments/1f26t45/one_of_the_best_cleaning_tips_ive_learned_for/", "html_title": ""}
{"title": "PLEASE HELP ME NOT GET KICKED OUT", "selftext": "I am so dumb and irresponsible. I poured my turmeric drink in the sink without rinsing it and I came back to it this morning and our sink is stained yellow. (I know, I know.. I’m sorry and I promise to never do it again!!!)\n\nI have tried Clorox toilet bowl cleaner with bleaching gel, Bar Keepers Friend, and baking soda and vinegar.\n\nI live with the owner of the home and she is in Italy for the next 10 days. How can I fix this before she comes back? I’m desperate and considering a ceramic sink painting kit from Lowe’s. \n\nPlease help!!!!\n", "url": "https://i.redd.it/aa4ym6p6i4qc1.jpeg", "created_utc": 1711216825.0, "score": 9795, "author": "Fit_Ad_6066", "num_comments": 3279, "permalink": "/r/CleaningTips/comments/1blygc2/please_help_me_not_get_kicked_out/", "html_title": ""}
{"title": "Help! Irish Spring 5 in 1 did this to me and I have an interview tomorrow! How do I fix this?!", "selftext": "Luckily the interview is over Zoom. ", "url": "https://i.redd.it/v4syqvoct8be1.jpeg", "created_utc": 1736112345.0, "score": 9329, "author": "EspressoStoker", "num_comments": 75, "permalink": "/r/CleaningTips/comments/1huhrwp/help_irish_spring_5_in_1_did_this_to_me_and_i/", "html_title": ""}
{"title": "Visiting my grandparents (Update!!) ", "selftext": "I just left my grandparents today and wanted to show an update on my progress. Regrettably it’s not as perfect as I wanted, the caulk is irreversibly damaged, as well as the shower doors remain streaky (although mold free now).  But I wanted to provide side by side pictures as promised.\n\nRegarding the grandparents, I’ve spoken with my parents and they’ve agreed to hire a biweekly aid to help with cleaning. Hopefully, this won’t be an issue ever again. ", "url": "https://www.reddit.com/gallery/1hwrozl", "created_utc": 1736362252.0, "score": 9051, "author": "alrightsoi", "num_comments": 126, "permalink": "/r/CleaningTips/comments/1hwrozl/visiting_my_grandparents_update/", "html_title": ""}
{"title": "Welp I finally figured out where the lint trap is ", "selftext": "In my apartment of 3 years. Thought I didn't have a lint trap I have to clean because I couldn't find it. ", "url": "https://www.reddit.com/gallery/1hipl7m", "created_utc": 1734717505.0, "score": 8572, "author": "sunburntlily", "num_comments": 428, "permalink": "/r/CleaningTips/comments/1hipl7m/welp_i_finally_figured_out_where_the_lint_trap_is/", "html_title": ""}
{"title": "Post-it note got wet and left this on our stone bathroom countertop. Help!!!", "selftext": "We’ve tried hydrogen peroxide and baking soda mixed together. We’re renting so we’re freaking out!! Not sure what kind of stone it is.. ", "url": "https://i.redd.it/jwayxubajuee1.jpeg", "created_utc": 1737682857.0, "score": 8528, "author": "aussiemamaa", "num_comments": 1381, "permalink": "/r/CleaningTips/comments/1i8k49e/postit_note_got_wet_and_left_this_on_our_stone/", "html_title": ""}
{"title": "Laundry stripping has changed my life", "selftext": "I’ve been stripping towels, sheets, undergarments, everything! Thank you to this sub for sharing how to laundry strip! This has completely saved my bath towels and they look brand new! \n\nThe photo is 2 king bed sheets being stripped with laundry detergent, borax and washing soda. It’s going on 4 hours. So gross but so satisfying! Hopefully this restores my white one to almost new. ✨", "url": "https://i.redd.it/579hslwv834b1.jpg", "created_utc": 1685922403.0, "score": 8459, "author": "Steel_City835", "num_comments": 1055, "permalink": "/r/CleaningTips/comments/140uzha/laundry_stripping_has_changed_my_life/", "html_title": ""}
{"title": "The wonders (and horrors) of laundry stripping", "selftext": "For the last two years, I’ve been living in a place with awful water, a grimy old machine, and roommates that used *way* too much detergent. I washed my sheets weekly, sometimes more, and they just became more and more disgusting. I was seriously considering throwing them out because the pillowcases had the consistency of waxed fabric and I could not get the smell out of them. Well, I am now living in a place with a tub and excellent water, so as a last ditch effort, I tried stripping them. I knew these were gross, I knew there was a lot of buildup, I knew they were going to look and feel different, but I was not aware of the extent of those. I did about six hours in the tub, doing a thorough hand wash every hour, wrung ‘em, washed ‘em, dried ‘em, and I’m glad they’re clean but I’m also absolutely disgusted by it. I have slept on these nasty sheets for two years. They look and feel brand new. I’m glad that I don’t have to spend a bunch on new sheets, but I am always going to think of how they were. I am also now very aware of the grime on the rest of the bedding. I’m gonna be doing that a couple more times.\n\nFirst tub pic is actually after an hour. The water was pure white at first. I started referring to it as laundry soup when it started getting bad.", "url": "https://www.reddit.com/gallery/1hd4tuh", "created_utc": 1734065779.0, "score": 8447, "author": "mishyfishy135", "num_comments": 514, "permalink": "/r/CleaningTips/comments/1hd4tuh/the_wonders_and_horrors_of_laundry_stripping/", "html_title": ""}
{"title": "Irish spring 5 in one cleaned purple dye!", "selftext": "I forgot to take before pics, but I’ve had dark purple dye *haunting* my tub since summer. My bathtub is an old glazed one, so it can be harder to clean and is a pain in ta. I’d tried everything to get the dye out to no avail, saw the Irish spring posts and decided to give it a go. While the smell reminded me of my early 20’s in a bad way (can I bleach my brain??) it actually *worked!* \nI didn’t scrub, just squirt a hefty amount on the stains and let sit for about 20 hours. It’s almost completely gone! I’ll go for a round two the next time my nose is stuffed up lol. What is in this stuff??", "url": "https://i.redd.it/j1mw620s25ee1.jpeg", "created_utc": 1737374634.0, "score": 8358, "author": "Equivalent_Hat_7220", "num_comments": 176, "permalink": "/r/CleaningTips/comments/1i5oozg/irish_spring_5_in_one_cleaned_purple_dye/", "html_title": ""}
{"title": "Move over Irish Spring...", "selftext": "We noticed it's cleaning effect when there was a leak.\nFirst photo before treatment\nPhoto 2 - let sit on stains for about 3 hours, rinsed \nPhoto 3 - repeated 3 hours, rinsed \n\nThe photos have bad lighting...it looks almost brand new! \n\nSuave Citrus Rush 3 in 1", "url": "https://www.reddit.com/gallery/1ik6oh7", "created_utc": 1738964831.0, "score": 8335, "author": "kcm1984", "num_comments": 321, "permalink": "/r/CleaningTips/comments/1ik6oh7/move_over_irish_spring/", "html_title": ""}
{"title": "My ex threw dye on my vintage hoodie", "selftext": "My grandma gave me a goosebumps hoodie that she had had for YEARS. She knew I loved horror and gave me it from her garage. Does anyone know how to get the stains out? My ex once drew sharpie on it and somehow I got it out, but I can’t get this out. Should I just tie dye it? Idk. I hate that this happened, but I wanna wear this hoodie again. TIA.", "url": "https://www.reddit.com/gallery/1j97prh", "created_utc": 1741743274.0, "score": 8328, "author": "Flat-List-8040", "num_comments": 1649, "permalink": "/r/CleaningTips/comments/1j97prh/my_ex_threw_dye_on_my_vintage_hoodie/", "html_title": ""}
{"title": "Huge hair dye accident.. how can I get it out?", "selftext": "Used a hair dye im very familiar with (pravana) and have even used this color before… I very quickly tried to get the rest out of my hair upon realization but now my entire body, shower, and sink… are blue.  I picked up Comet powder cleaner and some of the pink stuff spray and a scrub daddy.. but I wanted to make sure those are the right things before I went and started testing chemicals on it", "url": "https://www.reddit.com/gallery/1bqukt7", "created_utc": 1711732391.0, "score": 8042, "author": "sourMilkpickles", "num_comments": 2455, "permalink": "/r/CleaningTips/comments/1bqukt7/huge_hair_dye_accident_how_can_i_get_it_out/", "html_title": ""}
{"title": "I just want to show off my oven.", "selftext": "I turned a blind eye to it for ages. Now I randomly look inside just to admire it. ", "url": "https://www.reddit.com/gallery/1j0o6e0", "created_utc": 1740793240.0, "score": 7836, "author": "None", "num_comments": 156, "permalink": "/r/CleaningTips/comments/1j0o6e0/i_just_want_to_show_off_my_oven/", "html_title": ""}
{"title": "So apparently the railing was not just worn out and it was actually 20+ years of child hand dirt", "selftext": "I live with my in laws who live in an old farmhouse. They have seven kids, all of whom lived here for many many years. This railing was installed shortly after they moved in 25ish years ago. I’ve been visiting here for seven years, and truly thought that the railing was just worn out. \n\nWell, I’m sick, so I decided to wipe everything down so I don’t turn around and get sick again. That’s how I discovered that all the “wear and tear” on the railing was actually just decades of dirt. I showed my husband, and he was equally horrified. I’ve been meaning to do a deep clean but I was ***not*** planning on doing it yesterday. I don’t even want to touch the other railing now. That will be dealt with later. ", "url": "https://www.reddit.com/gallery/1i6qi6l", "created_utc": 1737486676.0, "score": 7754, "author": "mishyfishy135", "num_comments": 197, "permalink": "/r/CleaningTips/comments/1i6qi6l/so_apparently_the_railing_was_not_just_worn_out/", "html_title": ""}
{"title": "What is this in my bfs shower?", "selftext": "I’m moving in soon to my bfs house. The bathroom has been severely neglected as only boys have lived here. What is this in his shower and how can I clean it? ", "url": "https://www.reddit.com/gallery/1jw49n3", "created_utc": 1744307851.0, "score": 7749, "author": "tempaccount2897", "num_comments": 2279, "permalink": "/r/CleaningTips/comments/1jw49n3/what_is_this_in_my_bfs_shower/", "html_title": ""}
{"title": "Just used my new carpet cleaner and am low key horrified", "selftext": "I didn’t even finish the whole living room (and it’s not a very big room)", "url": "https://i.redd.it/t3big80gvigb1.jpg", "created_utc": 1691341772.0, "score": 7631, "author": "bunhilda", "num_comments": 843, "permalink": "/r/CleaningTips/comments/15juscv/just_used_my_new_carpet_cleaner_and_am_low_key/", "html_title": ""}
{"title": "My best cleaning tip", "selftext": "", "url": "https://i.redd.it/7w1z1lajd8fa1.jpg", "created_utc": 1675088299.0, "score": 7238, "author": "dont_disturb_the_cat", "num_comments": 131, "permalink": "/r/CleaningTips/comments/10p3nw0/my_best_cleaning_tip/", "html_title": ""}
{"title": "Bought new scrub daddies a couple months ago. This is what’s left in the sink today after washing about 5 mugs - what’s going on? ", "selftext": "I can’t believe how quickly this is disintegrating. The blue one is the same. I’m having to pick pieces out of the sink every time I wash up. My old scrub daddy lasted literally years! Has anyone else noticed the new ones being significantly worse quality?? ", "url": "https://i.redd.it/6hk3lbnclyrd1.jpeg", "created_utc": 1727707477.0, "score": 7178, "author": "General_Ignoranse", "num_comments": 795, "permalink": "/r/CleaningTips/comments/1fsx95o/bought_new_scrub_daddies_a_couple_months_ago_this/", "html_title": ""}
{"title": "So I tried the Irish Spring 5in1", "selftext": "After seeing people's posts, I figured I'd give it a try.\n\n1: pre applying the 5in1\n\n2: after putting the paper towels down\n\n3: after pulling the towels off after sitting overnight \n\n4: about 5mins with a scrubbing pad and some water", "url": "https://www.reddit.com/gallery/1ili4x5", "created_utc": 1739117477.0, "score": 7147, "author": "CloseQtrsWombat", "num_comments": 222, "permalink": "/r/CleaningTips/comments/1ili4x5/so_i_tried_the_irish_spring_5in1/", "html_title": ""}
{"title": "Need help! My husband, who insists on doing his own laundry, left a pen that then exploded and I've got 6 more loads to do today.", "selftext": "As I said, my husband insists on doing his own laundry even though laundry day is Friday, he wants it done Thursday and I work Thursday, so I start my normal Friday 7 loads and open the dryer to this.  I've used rubbing alcohol which is turning the paper towel blue at least but the stains remain on the dryer plus I have doubts of running this thing with all that alcohol on there it'll explode.  I need help!  I attempted a small bit of oven cleaner that did nothing, also goo gone did nothing.  I guess I'll be going to a laundromat until then.", "url": "https://i.redd.it/d4541tztjnac1.jpeg", "created_utc": 1704473843.0, "score": 6943, "author": "Glopez1223", "num_comments": 2979, "permalink": "/r/CleaningTips/comments/18zbkx8/need_help_my_husband_who_insists_on_doing_his_own/", "html_title": ""}
{"title": "My roommate keeps boiling chicken & letting the water overflow on the stove. Then leaves this behind & it’s not scrubbing off. Suggestions? ", "selftext": "", "url": "https://i.redd.it/e3r9vws0pojd1.jpeg", "created_utc": 1724100860.0, "score": 6848, "author": "bootthebooter400", "num_comments": 2570, "permalink": "/r/CleaningTips/comments/1ewcvt7/my_roommate_keeps_boiling_chicken_letting_the/", "html_title": ""}
{"title": "I’m severely depressed and trying to clean my room finally. Any advice?", "selftext": "Everything in my room reminds me of getting assaulted in here. It’s so hard to clean because I just end up getting reminded. I’m going to try really hard to clean it though and I’ll update y’all.", "url": "https://www.reddit.com/gallery/14aeesx", "created_utc": 1686865488.0, "score": 6796, "author": "Former_Risk_2_self", "num_comments": 2882, "permalink": "/r/CleaningTips/comments/14aeesx/im_severely_depressed_and_trying_to_clean_my_room/", "html_title": ""}
{"title": "I went down a rabbit hole on cleaning chemistry and this blew my mind", "selftext": "Soap is wild when you think about it. You lather it on, and somehow dirt, oil, even bacteria just vanish?\n\nAt least, that’s what I thought. Until I learned what’s actually happening.\n\nThey *slide away*.\n\nThere’s this thing in all good cleaners called a surfactant (short for “surface active agent”), and it’s the reason that happens. One end grabs onto water, the other end grabs onto grease or grime. When they float around together, they trap all that mess in little bubbles (called micelles), and then water just rinses it away.\n\nNo scrubbing magic. No “poof.” It’s gone. Just chemistry making the surface slippery enough that the gunk lets go.\n\nNot all cleaners work like this, though. Some are made to kill germs (like disinfectants), or dissolve minerals (like acidic descalers). But surfactants? They’re not killing or dissolving anything. They’re just making it all slippery, so the mess lets go, and water does the rest.\n\nAlso: not all surfactants are the same. The stuff in your dish soap isn’t the same as what’s in your glass cleaner. I started reading labels and realized how many products I use because of these little chemical slip-agents, helping grease and grime lose their grip.\n\nAnyway, I’m fascinated. **Anyone else weirdly into this stuff? Or have a favorite surfactant that works way better than it should?**\n\nEdit to add: A few folks pointed out that surfactants can kill some bacteria and viruses, not only just make things slippery. \n\nI looked it up and yep, soap disrupts the lipid layer around certain viruses (like Covid), basically breaking them open, killing them, and then water rinses them away.\n\nMy husband reminded me that Alton Brown talked about this during early Covid and I’d completely forgotten. Appreciate the extra learning here!\n\nEdit to add: \nWe hit a *million* views.\n\nWhat started with simple surfactants turned into a sage lesson in lye, water becoming better at being water, and a full-on Magic School Bus revival.\n\nJust because we “learned it already” doesn’t mean we geeked out properly the first time around. Sometimes we just need the right chemistry for things to really stick.\n\nWhen Reddit said “cleaning tips,” you gave proof that even in a thread about soap, people are still hungry to think, connect, and marvel.\n\nThanks for showing that curiosity still has a seat at the table.", "url": "https://www.reddit.com/r/CleaningTips/comments/1kdp2jv/i_went_down_a_rabbit_hole_on_cleaning_chemistry/", "created_utc": 1746264834.0, "score": 6782, "author": "asleep-under-eiffel", "num_comments": 545, "permalink": "/r/CleaningTips/comments/1kdp2jv/i_went_down_a_rabbit_hole_on_cleaning_chemistry/", "html_title": ""}
{"title": "Update on the wine-soaked Hokas", "selftext": "First of all, huge thanks to everyone who offered advice, support, and jokes!! \n\nUpdate: so I know the general consensus is that the wine looked cooler than the white, and I hear you. But seeing as it was their literal first outing, I really to try & salvage them if possible.\n\nBetween my mom’s advice and everything here, I was feeling overwhelmed. The dry cleaners had closed, I’m in the UK & can’t get everything that was suggested, and I don’t have many of the more basic cleaners on hand (you can bet I won’t be caught unawares again!).\n\nI elected to rinse with cold water first. The wine had been sitting for hours, but I tried to rinse whatever I could. Then I followed the directions for the one stain remover I could get at the corner shop—Dr Beckmann Stain Devil Fruit & Drinks. It has red wine pictured & listed on the front of the bottle.\n\nIt said to dilute the contents in warm water, and then soak items for several hours. I soaked the most soiled one for about two hours, as well as the damaged laces and my socks. I could hardly believe it when I checked on them about an hour and a half later.\n\nFor good measure & the sake of balance, I put everything including the spared shoe in for a little bit longer. If anything yellowed or whatnot, it would at least be shared, right? What do I know—I bought white shoes in the first place, so I don’t think I should be trusted.\n\nThe lighting in the flat isn’t great, but I think they look….bland and back to normal? For the most part? I agree, not nearly as fun as that nice pink, but I can always get that tie dye back, if I change my mind.\n\nMay do another soak once I’ve seen them in the light of day. Thanks all for the jokes and the suggestions—much appreciated levity & insight! I’m glad to have found my red wine spillers. Cheers!!! 🍷", "url": "https://www.reddit.com/gallery/1h65t7k", "created_utc": 1733280519.0, "score": 6737, "author": "lady_brett_assley", "num_comments": 162, "permalink": "/r/CleaningTips/comments/1h65t7k/update_on_the_winesoaked_hokas/", "html_title": ""}
{"title": "How do I get the buildup off this shower head?", "selftext": "", "url": "https://i.redd.it/3mk1euc4wieb1.jpg", "created_utc": 1690470319.0, "score": 6717, "author": "kolibri22", "num_comments": 1366, "permalink": "/r/CleaningTips/comments/15b4al9/how_do_i_get_the_buildup_off_this_shower_head/", "html_title": ""}
{"title": "Pls help before I get murdered by my MIL", "selftext": "My daughter got into my make up and well she had a field day on the grey couch the my MIL absolutely adores. I have a Bissell little green machine and carpet cleaning solution for a big machine but I'm scared to mess it up. It's purely eyeshadow but clearly a lot of dark and a lot of glitter. Pls give me tips I'd like to not let her find out this happened ", "url": "https://i.redd.it/09ymvlb1lx6e1.png", "created_utc": 1734232981.0, "score": 6645, "author": "Hushiemommie", "num_comments": 1275, "permalink": "/r/CleaningTips/comments/1hejt3i/pls_help_before_i_get_murdered_by_my_mil/", "html_title": ""}
{"title": "[update] everything in my house is turning green ", "selftext": "hi! so i don’t know if this is allowed but i wanted to post an update to my original post because many many people asked for one! i honestly don’t know how to work reddit all that well on mobile and couldn’t figure out how to edit my original post. heck i don’t even know how to link my original post properly. but here’s the update:\n\ni had my water and AC checked and both were fine. the technician said my water hardness was a bit hard but he didn’t think that would affect the green stains i’ve been seeing. i also got rid of the red bed sheets i had in the pic and put back on my boring corporate beige ones the day i posted the original post. then i waited. it’s funny because i was trying to determine if the green stains were going away based on if my cat was turning green. any time i saw she was becoming greener, i determined that whatever i changed wasn’t the cause. \n\nwell, i got my water softened and with my new bedsheets, my cat was still turning green but a lot slower, so maybe it was just from the residual green that was now stained on my couch and velvet bed frame. then we had another person inspect for mold which was also a negative. some other commenters had mentioned they had bought the same bedsheets on amazon and had a similar problem so i think it is that. \n\non another note, someone also commented asking if my husband was cheating on me with someone who wears old navy jeans. i won’t lie, when that comment came up, i nervously laughed. i quickly checked our joint bank account for any old navy purchases. while there weren’t any, i couldn’t shake this strange feelings. although the commenter did not know me or my husband, coincidentally, i’ve already had suspicions on a possible affair from the multiple last minute overtime shifts and just overall changes in behavior. also, my husband has cheated before so i’ve always been a bit anxious.. so when i saw the comment joking abt if my husbands affair partner wears old navy jeans, i spiraled. and then i admit i did the bad thing and looked thru my husbands phone and there it was. some sexy instagram DMs from a woman who wears jeans (cannot confirm if they’re old navy). so anyway i’ve spent the last week at my parents with my cat.\n\ntdlr - i can’t confirm that the cause of the staining was because of the bedsheets although my cat did turn green much more slowly when i changed them out + other people complained of the same staining issue that purchased the same sheets as me. found out my husband was cheating on me with a woman in jeans", "url": "https://www.reddit.com/r/CleaningTips/s/0KxtoZjl9R", "created_utc": 1737004934.0, "score": 6647, "author": "mioraa", "num_comments": 201, "permalink": "/r/CleaningTips/comments/1i2htjj/update_everything_in_my_house_is_turning_green/", "html_title": ""}
{"title": "Noticed this on side of stove when cleaning and have no idea what it is. Anyone know?", "selftext": "", "url": "https://i.redd.it/18hwn6ltaw1b1.jpg", "created_utc": 1684966609.0, "score": 6466, "author": "SharpSandwich988", "num_comments": 1759, "permalink": "/r/CleaningTips/comments/13qzm7r/noticed_this_on_side_of_stove_when_cleaning_and/", "html_title": ""}
{"title": "I just vacuum and mopped for the 3rd day in a row and there is still grey stuff on my socks when I walk. Socks were completely white! Why?", "selftext": "As the title says, I just finished vacuuming and mopping for the third day in a row. However, about after an hour of walking around in my socks, there is all this gray stuff on the bottom of them. I’ve been trying to figure out what the cause is, but I am completely stumped and it’s starting to drive me insane! Has anyone ever experienced this before? I’ve attached a picture of the floor and my socks so you guys can see what I am talking about. These socks were completely white when I put them on an hour ago and now there is gray stuff on them. Why??\n\nI mopped with a swiffer wet jet the past two days and just tried mopping with an actual mop with water and Pine-Sol today\n\nPs: I am walking about the gray spot underneath the “Hanes” logo In case that wasn’t obvious lol", "url": "https://www.reddit.com/gallery/1izktv8", "created_utc": 1740676219.0, "score": 6421, "author": "AbleUniversity8592", "num_comments": 1451, "permalink": "/r/CleaningTips/comments/1izktv8/i_just_vacuum_and_mopped_for_the_3rd_day_in_a_row/", "html_title": ""}
{"title": "Clothes iron fell on carpet - where do I even start", "selftext": "I was ironing my shirt and left the iron on the carpet as I always do, upright, and it tipped over and burnt the carpet .. I realised a few seconds later", "url": "https://i.redd.it/htyobu0b8z5b1.jpg", "created_utc": 1686745479.0, "score": 6405, "author": "dopplerinspect", "num_comments": 1208, "permalink": "/r/CleaningTips/comments/1496jey/clothes_iron_fell_on_carpet_where_do_i_even_start/", "html_title": ""}
{"title": "How Do Some People Always Have a Clean House? What’s the Secret?", "selftext": "I swear, no matter when I visit certain people’s homes, they’re always immaculate. No clutter, no dishes in the sink, no dust—just clean all the time. Meanwhile, I feel like I spend hours cleaning, and within a day or two, my place is messy again.\n\nWhat are the daily habits or routines that actually keep a house clean all the time? Do you do a little every day? Is there a magic cleaning schedule I’m missing? Or are these “always clean” people just secretly deep-cleaning 24/7?\n\nI’d love to hear from people who actually maintain a consistently clean home—how do you do it without feeling like you’re cleaning nonstop?", "url": "https://www.reddit.com/r/CleaningTips/comments/1jct6ry/how_do_some_people_always_have_a_clean_house/", "created_utc": 1742152481.0, "score": 6365, "author": "Impossible-Ninja-232", "num_comments": 2314, "permalink": "/r/CleaningTips/comments/1jct6ry/how_do_some_people_always_have_a_clean_house/", "html_title": ""}
{"title": "Bf just peed in my oven- how to clean????? (I wish I was joking, it’s 3am now)", "selftext": "😭Bleach? Special disinfectant products? How does HE clean up urine in an oven?! I am a loss, this is so horrible and I am disgusted. \nStory time: It’s 2am (a mere hour ago). I stayed in for the night and my boyfriend went out with friends. He came back at 12:45am, went to sleep. I wake up to my boyfriend getting out of bed (I’m a light sleeper, thank god), he walks into the kitchen and is rattling in the oven oddly, and start to hear a stream of what I thought was water from the sink- it wasn’t water. I jumped out of bed and ran to the kitchen to see him PEEING IN MY OVEN AND ON MY FLOOR. Oven door open, pissing all inside and on the inside of the oven door. He was sleep walking. He didn’t even snap back into reality for a good 5 minutes or realize what he had done. Mind you, I just deep cleaned the entire apartment earlier that day around 8pm.  \n\nTarget opens in 3 hours at 7am. Please, all of your advice (and comedic relief) is needed.", "url": "https://www.reddit.com/r/CleaningTips/comments/15iq5uf/bf_just_peed_in_my_oven_how_to_clean_i_wish_i_was/", "created_utc": 1691224370.0, "score": 6330, "author": "Local_Supermarket", "num_comments": 1414, "permalink": "/r/CleaningTips/comments/15iq5uf/bf_just_peed_in_my_oven_how_to_clean_i_wish_i_was/", "html_title": ""}
{"title": "I ruined my brothers counter, so embarrassed, please help.", "selftext": "Is there any possible way to clean these marks? We are not 100% sure how this happened but we believe it is maybe lemons that were left overnight face down on the counter? My brother is extremely mad I did this to his counter and said I didn’t take care of his things.   I feel horrible :(", "url": "https://www.reddit.com/gallery/1at1ksz", "created_utc": 1708175276.0, "score": 6299, "author": "orlando_ooh", "num_comments": 2183, "permalink": "/r/CleaningTips/comments/1at1ksz/i_ruined_my_brothers_counter_so_embarrassed/", "html_title": ""}
{"title": "Irish spring 5 in 1…you absolute maniac", "selftext": "Left in on over night, barely scrubbed. Thank you for your miracle discovery ", "url": "https://www.reddit.com/gallery/1j1e8c5", "created_utc": 1740875578.0, "score": 6234, "author": "2GirlsInATrenchCoat", "num_comments": 247, "permalink": "/r/CleaningTips/comments/1j1e8c5/irish_spring_5_in_1you_absolute_maniac/", "html_title": ""}
{"title": "I soaked the top pillow in oxyclean for an hour, then dried it. The bottom pillow is unwashed. They used to be the same colour 🤢", "selftext": "It's not perfect of course, but I wonder if soaking the pillow for longer would have a better result.", "url": "https://i.redd.it/l3wh5jk0iubb1.jpg", "created_utc": 1689303298.0, "score": 6230, "author": "None", "num_comments": 564, "permalink": "/r/CleaningTips/comments/14z4dv7/i_soaked_the_top_pillow_in_oxyclean_for_an_hour/", "html_title": ""}
{"title": "My DIY specialized tool tip: Plastic pill box I reused to thread over the vacuum nozzle so I can vacuum dust out of kids toy storage boxes", "selftext": "This is a very simple way to maintain the kids toy storage boxes dust free and reduce the amount of deep cleanings you have to do! This way, I rarely ever have to dump everything out and clean the bottom of the boxes. As the kids dig around in there, most of the dust naturally settles at the bottom anyway, so all you need to do is swivel the vacuum around the bottom a bit, and the boxes feel so much nicer to dig around in again.", "url": "https://www.reddit.com/gallery/12igi6w", "created_utc": 1681211818.0, "score": 6049, "author": "decadecency", "num_comments": 155, "permalink": "/r/CleaningTips/comments/12igi6w/my_diy_specialized_tool_tip_plastic_pill_box_i/", "html_title": ""}
{"title": "before and after spilling dark soy sauce all over my couch and floor the day before i move out", "selftext": "", "url": "https://www.reddit.com/gallery/1j8humh", "created_utc": 1741664361.0, "score": 5922, "author": "None", "num_comments": 83, "permalink": "/r/CleaningTips/comments/1j8humh/before_and_after_spilling_dark_soy_sauce_all_over/", "html_title": ""}
{"title": "Y'all were right. ", "selftext": "I've been a chronic drowner of clothes in laundry detergent for as long as I can remember. I just couldn't not overpour; the 2 tablespoons rule felt like a lie.\n\nI've been lurking here for months  and yesterday finally tried using much less detergent (more than 2 TBSP, but baby steps okay?) than I typically do, with all the usual cycles--I presoak, delicate wash and do an extra rinse or two.\n\nZero lingering smells. ZERO. I didn't have to toss anything back in the washer and run it through again. Everything felt nice and light and clean after the dryer. I'm a believer now; I'm sorry I ever doubted 😭", "url": "https://www.reddit.com/r/CleaningTips/comments/1eo1qus/yall_were_right/", "created_utc": 1723215215.0, "score": 5892, "author": "GlutenMeBanana", "num_comments": 307, "permalink": "/r/CleaningTips/comments/1eo1qus/yall_were_right/", "html_title": ""}
{"title": "Just showing off my white Le Creuset Dutch oven I’ve had for about 7 years - proving you can keep them as clean as when you bought them.", "selftext": "", "url": "https://www.reddit.com/gallery/1gh0kr8", "created_utc": 1730449221.0, "score": 5882, "author": "pinkguy90", "num_comments": 199, "permalink": "/r/CleaningTips/comments/1gh0kr8/just_showing_off_my_white_le_creuset_dutch_oven/", "html_title": ""}
{"title": "How can I get the cup stains out of this table?", "selftext": "", "url": "https://i.redd.it/vms8s6e7qvoe1.jpeg", "created_utc": 1742055773.0, "score": 5795, "author": "Unusual_Sink_4520", "num_comments": 1166, "permalink": "/r/CleaningTips/comments/1jbyt3o/how_can_i_get_the_cup_stains_out_of_this_table/", "html_title": ""}
{"title": "Chef for 20yrs, now I blast restaurant equipment", "selftext": "I use a mobile dry ice blasting set-up for cleaning restaurant equipment. \n\nEquipment:\n- Blaster\n- Mobile diesel compressor\n- Air Coolers/Dryers\n\nMedia:\n- Food/Medical Grade Dry Ice Rice (3mm)\n\nHow it works for grease & carbon removal:\n- Kinetic energy\n- Temperature Variance between surface and ice\n- Solid expansion to gas 800 times solid volume on impact\n\nPros:\n- USDA Approved in food production \n- Safe on sensitive electronics\n- Aggressive but not abrasive to substrate\n- No Secondary debris\n\nHappy to answer questions directly related to Dry Blasting pros and cons for cleaning needs.\n\nWant to create awareness around a chemical free cleaning method that extends equipment longevity.\n\n\n", "url": "https://v.redd.it/gxex4l100dqe1", "created_utc": 1742700734.0, "score": 5668, "author": "TORR_Ice_Blasting", "num_comments": 288, "permalink": "/r/CleaningTips/comments/1jhqbky/chef_for_20yrs_now_i_blast_restaurant_equipment/", "html_title": ""}
{"title": "Please stop acting shocked and disturbed when you see extremely dirty rooms in a cleaning tips subreddit", "selftext": "So, inevitably, when a post gets a lot of upvotes on this subreddit the typical comments flow in. \n\n\"Burn it down.\"\n\n\"Buy a new house.\"\n\n\"I could never let it get this dirty\"\n\n\"Jesus, how does this happen?\"\n\nEtc. Etc. Etc.\n\nThe entire point of a tips reddit is to come for advice, help and expertise regarding the topic of the reddit. You will not see people posting in here things like \"How do I wipe my sink down when I pour coffee down the drain?\" \"How do I dust this small particle of dust that accumulated over 3 days on my bookshelf\"\n\nYou are going to see difficult and/or extreme cases of dirt, grime, mould, gunk and ick. That is why they've come to ask for help because the task is a lot larger or more involved than soap and water. \n\nUsually these cleaning jobs result from some challenges the person, their family or their friends are facing that have led them to that level of dirt. If you are able to wave a magic wand and give the person with the dirty space a perfectly healthy body, mind, health care, endless money, supportive relationships, time outside of work and all the little privileges that people take for granted - then you can make unhelpful comments. \n\nThe difference I think no one usually considers when leaving a judgemental, unhelpful comment on a cleaning post is this : this person is asking for your help. They understand there is a problem and they have come to you to ask for your help in remedying it. \n\nThey are not saying \"Omg look how yummy this black mould is! I'm so PROUD that I have a dog urine stain in my carpet. Look at how delicious and gross this space is, isn't it amazing!\" \n\nNo. They are saying, directly or indirectly, \"I have a problem I'd like help fixing, please.\"\n\nThey don't need to justify that help with \"My mother is severely mentally disabled and did not have the ability to clean this bathroom\" or \"I am too poor to replace this kitchen counter, I need a best case solution if that's possible or I won't have electricity this month.\"\n\nHave fun. Have a laugh. Everyone can have a good sense of humor and a chuckle online. But comments that are not supportive but are judgemental and irreverent are just mean. There are SO many spaces on Reddit and the internet to poke fun at others without them seeing it - take that energy there. \n\nLet's just aim to be a little kinder this year than we were last year. And remember, there's a person on the other side of that text wall and you are in a unique position to make them smile or frown. Which would you rather have someone do to you?", "url": "https://www.reddit.com/r/CleaningTips/comments/10bcauv/please_stop_acting_shocked_and_disturbed_when_you/", "created_utc": 1673661385.0, "score": 5629, "author": "pinkguy90", "num_comments": 168, "permalink": "/r/CleaningTips/comments/10bcauv/please_stop_acting_shocked_and_disturbed_when_you/", "html_title": ""}
{"title": "Before and after! Cleaning my depression den and fixing my life!", "selftext": "", "url": "https://www.reddit.com/gallery/yysonl", "created_utc": 1668800528.0, "score": 5454, "author": "None", "num_comments": 237, "permalink": "/r/CleaningTips/comments/yysonl/before_and_after_cleaning_my_depression_den_and/", "html_title": ""}
{"title": "[UPDATE] SOS nasty body odor in guest room won’t leave no matter what we do!", "selftext": "Hi all- we have tried everything you all suggested. Literally everything and the room still smells like nasty musky body odor- but we noticed one thing actually finally make a difference today. I will go down the list. \n\n1) air filter running high 24/7 - so far for 5 days, didn’t notice a difference\n2) UVC light running one hour each day a so far for 2 days- noticed a slight difference \n3) baking soda each room - so far for 5 days - no difference \n4) bowl of vinegar - so far for 7 days - no difference \n5) dehumidifier running 24/7 - so far for 4 days - no difference, but if there is bacteria from the friend didn’t want moisture to feed it \n6) professional bed and mattress cleaner, didn’t notice a difference at all \n7) cleaning lady wiped down floor and walls - made no difference \n8) spray Lysol and Clorox wipe - did this on day 3 but just made the room smell like nasty chemicals plus the body odor, now the Lysol and Clorox smell left and it’s just the body odor\n9) took a ladder up to smell the vents in the room- no bad smells there\n10) box fan pushing air from inside to outside - for 2 days so far and THIS IS STARTING TO WORK!! I have finally noticed this made the smell in the bedroom go from 100% to 70% strong. A slight difference but a huge win considering how much money and labor we have put in so far! \n\nAlso yes we inspected everything. Lifted every furniture piece. Emptied the drawers. No dead animals found. We even texted the friend to ask if the room smelled before he went in (which it didn’t when we set the room up for him) and he said no smells and asked why -_-\n\nWe are going to keep pushing out the air and then get another box fan! I hope if we can push it all out then that might solve it- that the smell is literally just existing in the air in the room. We will do this for another 5-7 days straight and let you know if it works. If the smell just keeps coming back- then I will probably break down and cry lol \n", "url": "https://www.reddit.com/gallery/1i0ww2a", "created_utc": 1736825236.0, "score": 5379, "author": "pimpin_pippin", "num_comments": 1422, "permalink": "/r/CleaningTips/comments/1i0ww2a/update_sos_nasty_body_odor_in_guest_room_wont/", "html_title": ""}
{"title": "Before and after of 10+ year old pit stained t-shirt", "selftext": "", "url": "https://www.reddit.com/gallery/1iduqof", "created_utc": 1738264163.0, "score": 5362, "author": "divingproblems", "num_comments": 116, "permalink": "/r/CleaningTips/comments/1iduqof/before_and_after_of_10_year_old_pit_stained_tshirt/", "html_title": ""}
{"title": "Slime out of carpet", "selftext": "Hello!\n\nAs the picture says (I took a screenshot for a friend and am asking for her). Any tips for getting slime out of carpet?", "url": "https://i.redd.it/87nyytrp11td1.jpeg", "created_utc": 1728173038.0, "score": 5301, "author": "AliThePepRally", "num_comments": 309, "permalink": "/r/CleaningTips/comments/1fx3y2r/slime_out_of_carpet/", "html_title": ""}
{"title": "Clutch my pearls, it worked", "selftext": "The shower was totally disgusting. It got this bad because every time I’ve tried to clean it, nothing has worked! Seriously, I’ve tried like 10 different cleaning products. Who knew a $7 bottle of soap was the answer to my problems. I did let it sit for 24 hours. I then sprayed with vinegar and left it for an hour or two. I used a hard bristle brush to scrub. \n\n\n Hoping to not have to do this ever again because I have asthma and my husband is sensitive to smells and this wrecked us. It’s so strong!! ", "url": "https://www.reddit.com/gallery/1iic2pj", "created_utc": 1738768062.0, "score": 5251, "author": "Due-Baby5349", "num_comments": 141, "permalink": "/r/CleaningTips/comments/1iic2pj/clutch_my_pearls_it_worked/", "html_title": ""}
{"title": "I'm back, and I have results! (Irish Spring 5in1 vs Vinegar vs Zep) vs. Shower Floor and Grout", "selftext": "", "url": "https://www.reddit.com/gallery/1ia8gmq", "created_utc": 1737875846.0, "score": 5129, "author": "reeetl", "num_comments": 111, "permalink": "/r/CleaningTips/comments/1ia8gmq/im_back_and_i_have_results_irish_spring_5in1_vs/", "html_title": ""}
{"title": "Today's work... cleaning 17 windows and tracks in a home", "selftext": "My process: using a medium bristle brush and a firm bristle brush, I loosened as much crud and particles as I could with one hand while following the brush around with a narrow nozzle hose attachment on my shop vac. I used a small paintbrush (like for watercolors) to hit the hard to reach corners and crevices.\n\nI then sprayed the crud with a little Dawn Powerwash (man I love that stuff) and it wiped right up. I had to keep going over the frame and crevices a bunch until every last crumb of debris was gone. I used a hand pump water sprayer to wash out the tight corners (used a microfiber cloth to catch all the water and crud).\n\nMy client was so happy to see the transformation when she got home!", "url": "https://www.reddit.com/gallery/1hdrxgu", "created_utc": 1734140195.0, "score": 5085, "author": "okefenokeeguide", "num_comments": 99, "permalink": "/r/CleaningTips/comments/1hdrxgu/todays_work_cleaning_17_windows_and_tracks_in_a/", "html_title": ""}
{"title": "Help!!!! Egg smell", "selftext": "Ok, I know I screwed up don’t talk about that. So 4 days ago I was moving stuff for work to another location because power outage and someone put unsecured bucket of cracked eggs in my car. I get to the location and opened my trunk and I would guess 100-250 eggs were everywhere. So that day we got all the eggs out and scrubbed and then I vacuumed crevices but made the mistake of closing my windows. I didn’t clean it again at all until 1 day ago and so now we can’t get the smell out. Any recommendations?", "url": "https://i.redd.it/2nn4z34xra7b1.jpg", "created_utc": 1687321098.0, "score": 4990, "author": "Trashbear3", "num_comments": 621, "permalink": "/r/CleaningTips/comments/14ex5sx/help_egg_smell/", "html_title": ""}
{"title": "I DID IT! How to clean brunt/polymerized oil off ceramic coated frying pan (comments)", "selftext": "", "url": "https://www.reddit.com/gallery/1hra88r", "created_utc": 1735759400.0, "score": 4982, "author": "tunecha", "num_comments": 164, "permalink": "/r/CleaningTips/comments/1hra88r/i_did_it_how_to_clean_bruntpolymerized_oil_off/", "html_title": ""}
{"title": "Irish Spring 5 in 1 Out at My Location", "selftext": "I really wanted to give it a try tonight, but this specific bottle is out at my store. Damn, internet.", "url": "https://i.redd.it/04p0fxyavzee1.jpeg", "created_utc": 1737747432.0, "score": 4977, "author": "3Left_Feet", "num_comments": 91, "permalink": "/r/CleaningTips/comments/1i93xji/irish_spring_5_in_1_out_at_my_location/", "html_title": ""}
{"title": "I have no idea what this is & I’m not sure where else to turn, please help!", "selftext": "This peculiar portion of the paint in my hallway started sagging out of nowhere\ntonight.  I’ve never seen anything like it before; it’s pliable and a bit squishy to the touch, but I’m hesitant to poke it much because as it seems potentially hazardous.\n\nI’m sure this has something to do with the Feliway I had plugged into the outlet directly below. However, the Feliway had been there for a while and this happened suddenly…\n\nDoes anyone know why this happened/how to fix it? I’m a renter and don’t want to involve my landlord. I was thinking I could smooth it back down with a wallpaper tool and then sand off any leftover wrinkles/touch up paint… Idk i’m frankly at a loss and open to just about any solution", "url": "https://www.reddit.com/gallery/18l36rb", "created_utc": 1702885104.0, "score": 4973, "author": "macchiatobxtch", "num_comments": 1680, "permalink": "/r/CleaningTips/comments/18l36rb/i_have_no_idea_what_this_is_im_not_sure_where/", "html_title": ""}
{"title": "No tips needed, I just wanted to show off my shiny doorknobs after I polished them with Brasso. ", "selftext": "Just moved into a new house and while it's rented, I'm determined to make it as nice as possible and do as much work to it as possible. All the doorknobs, including on the cupboards, are brass and HEAVILY tarnished. Not the biggest issue in the world, some people might even prefer the look of aged and tarnished metal, but I've set myself the task of polishing all of them. One pair of cupboard knobs are done! Just 3 more, then 3 proper doorknobs left. \n\nThey're not perfect, maybe I could get the last little bits of tarnish out but I think it could be permanent, and they're a little scratched. But I'm happy to see them shiny and give the house some tlc after what seems like a very long time. ", "url": "https://www.reddit.com/gallery/1hp74t1", "created_utc": 1735509745.0, "score": 4924, "author": "Additional_Lion_1670", "num_comments": 60, "permalink": "/r/CleaningTips/comments/1hp74t1/no_tips_needed_i_just_wanted_to_show_off_my_shiny/", "html_title": ""}
{"title": "I took your most suggested tip and soaked lovey overnight in Oxyclean. I'm shocked at how amazingly clean she looks again! Thanks y'all.", "selftext": "", "url": "https://i.redd.it/rv9hcuiqgxqa1.jpg", "created_utc": 1680204712.0, "score": 4834, "author": "ShesGotSauce", "num_comments": 113, "permalink": "/r/CleaningTips/comments/126wv01/i_took_your_most_suggested_tip_and_soaked_lovey/", "html_title": ""}
{"title": "After scrubbing years worth of algae, it turns out grandma's deck was striped. Who knew?", "selftext": "", "url": "https://i.redd.it/2kh5l6lf1hse1.jpeg", "created_utc": 1743621542.0, "score": 4809, "author": "ballofnerves205", "num_comments": 70, "permalink": "/r/CleaningTips/comments/1jpx7oz/after_scrubbing_years_worth_of_algae_it_turns_out/", "html_title": ""}
{"title": "I made a mistake and desperately need advice before my landlord sees it.", "selftext": "So the only excuse I have for using this is.. I didn’t have any other cleaner. I bought this when I first moved out and had a bit more money in my pocket but now I’m incredibly broke and can’t afford to buy anything so I thought that maybe this would work well for my sink too because I have a tendency to leave dishes in there for a few days at a time and didn’t think soap would cut it in cleaning it well. \n\nAnd well, you guys can see the damage and I desperately need an answer to fixing this. I don’t know how my landlord will react to it and I’m worried, is there any way to get rid of the markings??", "url": "https://www.reddit.com/gallery/18fm6bo", "created_utc": 1702268695.0, "score": 4792, "author": "Rubitee", "num_comments": 1777, "permalink": "/r/CleaningTips/comments/18fm6bo/i_made_a_mistake_and_desperately_need_advice/", "html_title": ""}
{"title": "At 25 years old I learned you are supposed to clean carpets", "selftext": "", "url": "https://i.redd.it/krqlt89ib3rd1.jpeg", "created_utc": 1727328849.0, "score": 4761, "author": "Drummingdungarees", "num_comments": 199, "permalink": "/r/CleaningTips/comments/1fpp1x3/at_25_years_old_i_learned_you_are_supposed_to/", "html_title": ""}
{"title": "Discolored Stainless Steel Cutlery after soaking with vinegar", "selftext": "I read that I should soak my utensils in white vinegar for 3 hours to get rid of rust stains, so this was soaked for around 3 hours and washed with dishwashing soap and water after. It came out very discolored. \n\nThe knife on the left is the after and the one on the right is one that wasn’t soaked in vinegar. \n\nIs there a way to save these? They are fairly new but since I live by the beach, everything sort of rusts more easily. ", "url": "https://i.redd.it/w76pyv5j2vvd1.jpeg", "created_utc": 1729408216.0, "score": 4766, "author": "mdalliv", "num_comments": 207, "permalink": "/r/CleaningTips/comments/1g7t3xa/discolored_stainless_steel_cutlery_after_soaking/", "html_title": ""}
{"title": "You can use a walnut to get paint marks off of hardwood floors", "selftext": "", "url": "https://www.reddit.com/gallery/1iorbsr", "created_utc": 1739475040.0, "score": 4727, "author": "DuffManSzALotAThings", "num_comments": 80, "permalink": "/r/CleaningTips/comments/1iorbsr/you_can_use_a_walnut_to_get_paint_marks_off_of/", "html_title": ""}
{"title": "Teen Son Bedroom Smells", "selftext": "His room is clean. I’ve vacuumed and scrubbed carpet. I washed all bedding and even covered mattress with baking soda, let sit for a day then vacuumed bed. The room still has that “teenage boy smell.” Going to put house on the market soon. But I have to do something about his room first. \nWhat else can I do?", "url": "https://i.redd.it/x7xxd372kwpe1.jpeg", "created_utc": 1742501659.0, "score": 4692, "author": "Overall-Fine", "num_comments": 2163, "permalink": "/r/CleaningTips/comments/1jfye4c/teen_son_bedroom_smells/", "html_title": ""}
{"title": "Thank you to whoever said ironing can get out these white stains on wood!", "selftext": "They’re caused by moisture under the wood finish. I ironed on cotton setting and put a tea towel down to protect the table ", "url": "https://www.reddit.com/gallery/1i9x95u", "created_utc": 1737839721.0, "score": 4674, "author": "bluearandano", "num_comments": 52, "permalink": "/r/CleaningTips/comments/1i9x95u/thank_you_to_whoever_said_ironing_can_get_out/", "html_title": ""}
{"title": "Thanks to this Community I discovered Barkeeper's Friend.", "selftext": "", "url": "https://www.reddit.com/gallery/188tz2u", "created_utc": 1701486023.0, "score": 4659, "author": "AdditionalSeries814", "num_comments": 189, "permalink": "/r/CleaningTips/comments/188tz2u/thanks_to_this_community_i_discovered_barkeepers/", "html_title": ""}
{"title": "How do I remove these stains?", "selftext": "I tried baking soda and dawn soap but only a small bit came off. Any tips would be great!", "url": "https://i.redd.it/yw2v1d5yb3ac1.jpeg", "created_utc": 1704229052.0, "score": 4650, "author": "Gullible-Sherbet-428", "num_comments": 2201, "permalink": "/r/CleaningTips/comments/18x04i2/how_do_i_remove_these_stains/", "html_title": ""}
{"title": "Help after 1 use and a wash in the dishwasher it look like this", "selftext": "I use the dishwasher and this happened", "url": "https://i.redd.it/mypmz5tcbbkb1.jpg", "created_utc": 1692993658.0, "score": 4627, "author": "wTx4", "num_comments": 1425, "permalink": "/r/CleaningTips/comments/1619i8s/help_after_1_use_and_a_wash_in_the_dishwasher_it/", "html_title": ""}
{"title": "R.I.P scrub daddy", "selftext": "Had this bad boy for 7 months, he served his time and a memorial will be held in his name ", "url": "https://i.redd.it/lmlxtzbij05d1.jpeg", "created_utc": 1717706564.0, "score": 4624, "author": "WinnerUnable1722", "num_comments": 268, "permalink": "/r/CleaningTips/comments/1d9sjxy/rip_scrub_daddy/", "html_title": ""}
{"title": "Roommate ran dishwasher with dish liquid (meant for washing by hand). What do I do about all these bubbles? ", "selftext": "I noticed bubbles overflowing from the machine and spilling out on the floor. I stopped the cycle and put down a towel, but I’m not sure what to do about the excess of bubbles. Thanks!! ", "url": "https://i.redd.it/x9fx2x9i2jcd1.jpeg", "created_utc": 1720981812.0, "score": 4625, "author": "dramagalrl", "num_comments": 533, "permalink": "/r/CleaningTips/comments/1e39dbl/roommate_ran_dishwasher_with_dish_liquid_meant/", "html_title": ""}
{"title": "How does it not scratch", "selftext": "", "url": "https://v.redd.it/628z95qp40we1", "created_utc": 1746375203.0, "score": 4577, "author": "coffeequeen0523", "num_comments": 195, "permalink": "/r/CleaningTips/comments/1kenjdp/how_does_it_not_scratch/", "html_title": ""}
{"title": "First time I’ve cleaned my oven - Pink Stuff + razor blade 👌🏼", "selftext": "Today I had a weird obsessive urge to figure out how to clean our oven. I searched here. Got myself some pink stuff, a razor blade, and a scrub daddy, watched a YouTube video about how to take the door apart to clean inside (easy!) and I’m amazed! 🤗 ", "url": "https://www.reddit.com/gallery/1g976xr", "created_utc": 1729562576.0, "score": 4562, "author": "Ithrowthings2", "num_comments": 91, "permalink": "/r/CleaningTips/comments/1g976xr/first_time_ive_cleaned_my_oven_pink_stuff_razor/", "html_title": ""}
{"title": "So apparently your not supposed to put egg shells in the garbage disposal...", "selftext": "", "url": "https://i.redd.it/lx1crce578vd1.jpeg", "created_utc": 1729131313.0, "score": 4530, "author": "Eastern_Theme2442", "num_comments": 795, "permalink": "/r/CleaningTips/comments/1g5ge9v/so_apparently_your_not_supposed_to_put_egg_shells/", "html_title": ""}
{"title": "For the person who asked about how to wipe stuff up better! ", "selftext": "", "url": "https://v.redd.it/291staysqjjd1", "created_utc": 1724113594.0, "score": 4500, "author": "ShilohConlan", "num_comments": 114, "permalink": "/r/CleaningTips/comments/1ewht72/for_the_person_who_asked_about_how_to_wipe_stuff/", "html_title": ""}
{"title": "Before and after using Iron Out powder and 6 scotch brite pads!", "selftext": "", "url": "https://www.reddit.com/gallery/1i7qzm2", "created_utc": 1737593099.0, "score": 4488, "author": "waddup_gnomie", "num_comments": 117, "permalink": "/r/CleaningTips/comments/1i7qzm2/before_and_after_using_iron_out_powder_and_6/", "html_title": ""}
{"title": "Unpopular opinion: I hate cleaning with vinegar. I hate when people suggest it! Is everyone in on a joke?😭", "selftext": "It stinks, I don’t think it does a good job, it doesn’t leave anything feeling “fresh” \n\nChemicals almost always work better and much quicker than vinegar “hacks” + smell so good\n\nIt’s so unsatisfying and also feels so inefficient. I saw this sub suggest vinegar for hard water stains and it was infinitely more work than other chemical products I tried\n\nEnd of rant lol\n\nEdit: dawn dish soap is another one I’d like us to discuss one day but I’m not ready for the backlash right now ", "url": "https://www.reddit.com/r/CleaningTips/comments/1hjr6a8/unpopular_opinion_i_hate_cleaning_with_vinegar_i/", "created_utc": 1734841691.0, "score": 4463, "author": "Bubbly_Picture_9876", "num_comments": 803, "permalink": "/r/CleaningTips/comments/1hjr6a8/unpopular_opinion_i_hate_cleaning_with_vinegar_i/", "html_title": ""}
{"title": "I used scrub daddy to clean a grill. How do I clean scrub daddy?", "selftext": "", "url": "https://i.redd.it/di09dvfxey2d1.jpeg", "created_utc": 1716809113.0, "score": 4447, "author": "unique74739282614273", "num_comments": 544, "permalink": "/r/CleaningTips/comments/1d1pb9f/i_used_scrub_daddy_to_clean_a_grill_how_do_i/", "html_title": ""}
{"title": "really struggling with cleaning my depression room this go around. could really use some motivation :/", "selftext": "", "url": "https://www.reddit.com/gallery/1c0z5hd", "created_utc": 1712789502.0, "score": 4439, "author": "justpassingbysorry", "num_comments": 2262, "permalink": "/r/CleaningTips/comments/1c0z5hd/really_struggling_with_cleaning_my_depression/", "html_title": ""}
{"title": "I shaved my fabric couch!", "selftext": "Yes, you read that right. 😅 I have a fabric couch and a big dog, so my couch gets covered in lint and dog hair pretty quickly. After trying everything from lint rollers to vacuuming (with little success), I decided to try something unconventional: I used my husband’s electric razor.\n\nThe result? The couch looks almost brand new! It removed all the lint and dog hair effortlessly. I know this probably isn’t great for the fabric if done regularly, but it definitely gave my old couch a refreshed look.\n\nIf you decide to give it a try, be cautious and test it on a small, hidden area first. For a quick fix, though, I can highly recommend it!\n\nDoes anyone else have any “unconventional” cleaning hacks like this?\n\n(Hint: I used the help from ChatGPT to create this post because of language barriers.) \n", "url": "https://www.reddit.com/gallery/1gmfxzz", "created_utc": 1731063557.0, "score": 4441, "author": "Upstairs-Algae-7931", "num_comments": 97, "permalink": "/r/CleaningTips/comments/1gmfxzz/i_shaved_my_fabric_couch/", "html_title": ""}
{"title": "I, 34m, have been cleaning my dishes with HAND SOAP for the last 10 years I’ve lived alone.", "selftext": "The title pretty much sums it all up. I, 34m, have been cleaning with hand soap all this time. I feel like this is something that should’ve never occurred if I never left my s.o.b ex wife for letting the dogs poop in the neighbors yard. Anyways, I think this eye opening moment makes me want to take my cleaning habits very seriously. Any tips on products I should be using now to clean all areas of my house, especially kitchen?", "url": "https://i.redd.it/bylf3r2qsmce1.jpeg", "created_utc": 1736717479.0, "score": 4385, "author": "OrlandoDave477", "num_comments": 255, "permalink": "/r/CleaningTips/comments/1hzxka0/i_34m_have_been_cleaning_my_dishes_with_hand_soap/", "html_title": ""}
{"title": "Please help me clean this hand towel, I’m besides myself ", "selftext": "Future FIL decided to clean his car with my Makenzie Childs hand towel (without asking) and this is the outcome. I’m beyond angry and upset because the towels were a gift from my mom when I moved into my first apartment. Can someone please give me tips to clean this, I’m literally going to cry 😭", "url": "https://i.redd.it/8lrx7i2my0ud1.jpeg", "created_utc": 1728607845.0, "score": 4336, "author": "grillers-sinclair", "num_comments": 486, "permalink": "/r/CleaningTips/comments/1g0xuj4/please_help_me_clean_this_hand_towel_im_besides/", "html_title": ""}
{"title": "Saw a comment about cleaning the oven with pumice stone recently. Well over 10 years of crap finally being cleaned off!", "selftext": "", "url": "https://www.reddit.com/gallery/1h7fv48", "created_utc": 1733422861.0, "score": 4306, "author": "Seraitsukara", "num_comments": 141, "permalink": "/r/CleaningTips/comments/1h7fv48/saw_a_comment_about_cleaning_the_oven_with_pumice/", "html_title": ""}
{"title": "Found at a thrift store today and polished for my girl who is coming home tomorrow. ", "selftext": "", "url": "https://www.reddit.com/gallery/1hw5ule", "created_utc": 1736293878.0, "score": 4238, "author": "None", "num_comments": 68, "permalink": "/r/CleaningTips/comments/1hw5ule/found_at_a_thrift_store_today_and_polished_for_my/", "html_title": ""}
{"title": "Ancestral grime update", "selftext": "UPDATE!\n\nHello to you all sexually-confused-by-Imhotep, Brendan-Fraser-loving, ancestral-grime-aficionados! (This is what I now call everyone who helped in my first post)\n\nI thought I would make a new post to say I come bearing good news. I have finally gotten rid of the deep crust of dirt that started covering my kitchen cabinets since the election of Margaret Thatcher.\n\nThe removal of this grime has not unleashed the Seven Plagues of Egypt, but rather my inner cleaning maniac. I’m already thinking about cleaning my wooden doors…\n\nBut I disgress. I listened to your excellent advice and viewed this project not only as a deep clean, but almost a wood restauration work. We ended up using Murphy’s soap and a some #00 steel wool we had at home. We poured a bit of soap on the grime, let it work its magic, and used the steel wool.\n\nWe had to be careful not to go too harshly, but it did wonders. We finished it off with some lemon oil and also cleaned up the brass handles as best as we could.\n\nIf this was my house, I would have completely taken out the doors and properly sanded and treated them. Or just redone the kitchen, because it’s OLD. (Not 3000 years old and guarded by the Medjai, but still.)\n\nThanks to you all for the laughs and 90s thirst traps. Also, if any of you end up starting a band named Ancestral Grime, please let me know!", "url": "https://www.reddit.com/gallery/1gpsi6l", "created_utc": 1731438224.0, "score": 4248, "author": "Arileine", "num_comments": 86, "permalink": "/r/CleaningTips/comments/1gpsi6l/ancestral_grime_update/", "html_title": "Reddit - The heart of the internet"}
{"title": "been down for a couple weeks and finally made a dent into my sad girl bedroom!", "selftext": "after and before :) bonus points if you can find the cat in both photos ", "url": "https://www.reddit.com/gallery/1gbqcqa", "created_utc": 1729849112.0, "score": 4231, "author": "EcoFriendlyHat", "num_comments": 71, "permalink": "/r/CleaningTips/comments/1gbqcqa/been_down_for_a_couple_weeks_and_finally_made_a/", "html_title": "Reddit - The heart of the internet"}
{"title": "Laundry detergent residue on floor. ", "selftext": "So, this was my night last night. It’s cleaned up but what is the best way to get rid of the laundry soap residue from the detergent? It was mopped several times but I’m not sure what the key is here. Thank you! ", "url": "https://i.redd.it/n5sqz91ebjqd1.jpeg", "created_utc": 1727086673.0, "score": 4141, "author": "sempresongbird", "num_comments": 464, "permalink": "/r/CleaningTips/comments/1fnh1z1/laundry_detergent_residue_on_floor/", "html_title": ""}
{"title": "everything in my house is turning green", "selftext": "everything in my house is turning green… at first it was just my cat, and then it became my bedsheets, my feet (which then stained my shoes and socks), my couch, my phone charger, and now my wall. idk what it is. i have no idea where to post this but im wondering if anyone knows how to get rid of it or what it is?? at first i thought mold but now im thinking maybe my laundry detergent pods which are green. but i did a test wash and dry and it didn’t stain my clothes until i wore them for a few hours around the house before it turned green\n", "url": "https://www.reddit.com/gallery/1hp8ezp", "created_utc": 1735513212.0, "score": 4112, "author": "mioraa", "num_comments": 605, "permalink": "/r/CleaningTips/comments/1hp8ezp/everything_in_my_house_is_turning_green/", "html_title": "Reddit - The heart of the internet"}
{"title": "The pink stuff vs. my very very dirty pan.", "selftext": "Now onto the other half…", "url": "https://i.redd.it/ksdtpb49f4xa1.jpg", "created_utc": 1682885716.0, "score": 3995, "author": "dncecat", "num_comments": 305, "permalink": "/r/CleaningTips/comments/1341sha/the_pink_stuff_vs_my_very_very_dirty_pan/", "html_title": ""}
{"title": "i vacuum weekly but periodically go at a snails pace to really get in the carpet. always disgusted by how much more comes up!", "selftext": "just two adults and two cats and we’re really not dirty people! every few vacuums i go reallyyy slow so the beater bar has a chance to work the carpet more. i’m always amazed by the results. i emptied the container before vacuuming. how tf is there so much crap in my carpet?? granted the house is over 20 years old but still!", "url": "https://i.redd.it/dyxf5xf4qrge1.jpeg", "created_utc": 1738520532.0, "score": 3988, "author": "cakeanddiamond", "num_comments": 123, "permalink": "/r/CleaningTips/comments/1ig3pxw/i_vacuum_weekly_but_periodically_go_at_a_snails/", "html_title": ""}
{"title": "Forgot to post an update but i’m pretty proud 😎", "selftext": "", "url": "https://www.reddit.com/gallery/10f71vd", "created_utc": 1674047450.0, "score": 3967, "author": "Birberinooo", "num_comments": 176, "permalink": "/r/CleaningTips/comments/10f71vd/forgot_to_post_an_update_but_im_pretty_proud/", "html_title": "Reddit - The heart of the internet"}
{"title": "my kitchen counter is made of an unusual material. help identifying and how to best clean it?", "selftext": "i love my kitchen. it’s really quirky and has lots of beautiful cabinet space. however, one quirk that i have never really come to understand are my kitchen counters. they are made of what feels like an unfinished stone (really hard, heavy, and jagged in texture). i like how unique they look, but boy are they impractical to clean.\n\nbecause of the texture, you can never get a smooth wipe on them. paper towels get caught and ripped up into shreds. when the surface gets wet, the counter turns a lighter grey where water hits it so i’m not sure the porosity of this material. the biggest thing is i’ve noticed wearing off (2nd photo) on high traffic areas like near the stove. this happened today when i tried to get a light scrub on the counter with a sponge. the residue coming off is kinda rubbery and slightly sticky. \n\nunderneath where appliances sit, the counter is in much better shape because it hasn’t been affected by anything. i don’t know anyone with experience with this kind of material so any feedback would be appreciated!", "url": "https://www.reddit.com/gallery/16mtwb3", "created_utc": 1695136914.0, "score": 3949, "author": "ltgrey", "num_comments": 1284, "permalink": "/r/CleaningTips/comments/16mtwb3/my_kitchen_counter_is_made_of_an_unusual_material/", "html_title": "Reddit - The heart of the internet"}
{"title": "Tonight is the Scrubdaddy's funeral. He is no longer with us.", "selftext": "", "url": "https://i.redd.it/2jyfbnhqs3la1.jpg", "created_utc": 1677647968.0, "score": 3898, "author": "Impossible_Aerie2606", "num_comments": 110, "permalink": "/r/CleaningTips/comments/11ev5tb/tonight_is_the_scrubdaddys_funeral_he_is_no/", "html_title": ""}
{"title": "Cleaned my depression room after months 🥵", "selftext": "", "url": "https://i.redd.it/jc4lsmlg91r51.jpg", "created_utc": 1601797709.0, "score": 3875, "author": "BeesEverywhere1", "num_comments": 127, "permalink": "/r/CleaningTips/comments/j4v795/cleaned_my_depression_room_after_months/", "html_title": ""}
{"title": "Bought bath rugs for Christmas and they stained my floors", "selftext": "Does anyone have any ideas for how to get this stain out of my linoleum floors? I've used Clorox, Lysol with stain remover, Dawn Power Wash, and Pink Stuff nothing has seemed to work. Thanks you!", "url": "https://www.reddit.com/gallery/18tvz22", "created_utc": 1703880134.0, "score": 3868, "author": "scottgf99", "num_comments": 608, "permalink": "/r/CleaningTips/comments/18tvz22/bought_bath_rugs_for_christmas_and_they_stained/", "html_title": "Reddit - The heart of the internet"}
{"title": "I finally tackled my depression room… AND SO CAN YOU! ❤️", "selftext": "I struggle with caring for myself & my space, especially when school / work picks up and all I want to do is rot after a busy day. I also HATE cleaning, I never find it fulfilling or cathartic and it’s so overwhelming. \n\nIf you feel similarly, here’s how I did it:\n\n1. Do NOT expect to do it all in one day! Accept & get comfortable with the idea it could take you a few days of chipping away. \n\n2. Get the floor clear first. Throw trash away, put clothes in a laundry basket (or 3), anything you need to find a home for put in a bin or on your bed temporarily. \n\n3. If you find yourself losing steam, do NOT give in immediately. Take care of one more large task (ie. Put folded clothes away, take out the trash, organize your desk) and THEN put a pin it. \n\n4. Anytime you leave the room, start a task and leave it half done. That way, when you return, you have no choice but to finish it. \n\n5. There is NO one definition of ‘clean’ - what’s clean to me is certainly not clean to my mother. Get to a point where you feel comfortable & cozy existing in your space… if you don’t look around and feel overwhelmed / shameful / need to take immediate action, then it’s done!\n\n6. MOST IMPORTANTLY - DO NOT LET GUILT / SHAME DETER YOU! Ignoring the problem only contributes further to it. It’s ok if you don’t know where to start. Start with the smallest task, take care of it, and keep going with the momentum. It’s ok if you need a break. It’s ok if you leave a load of laundry in over night and take care of it tomorrow. The important thing is it GETS DONE! ", "url": "https://www.reddit.com/gallery/1gycop9", "created_utc": 1732403682.0, "score": 3838, "author": "rubabyy", "num_comments": 44, "permalink": "/r/CleaningTips/comments/1gycop9/i_finally_tackled_my_depression_room_and_so_can/", "html_title": "Reddit - The heart of the internet"}
{"title": "The stocking my mom cross-stitched for me is now red", "selftext": "My mom spent many, many hours cross-stitching this stocking for me many years ago. She's been doing cross-stitch her entire life and still says this was one of the hardest, longest projects she's ever done. It means the world to me.\n\nWhen I unpacked it this season, it was red! It was stored in a Rubbermaid tote in my attic. \n\nMy attic gets up to over 100 degrees in the summer. I noticed there was a candle on its side in the tote on top of where the stocking was. The wax is red, and it's obvious it melted a bit at some point. Also, it's a scented candle, and the stocking now has the same scent, but maybe that's just because it was in the same tote as the candle.\n\nCould melted was stain something like this? I don't see or feel any obvious wax on the stocking.\n\nAny suggestions for removing the red color? If it's ruined, I will still obviously keep it and continue to treasure it, but it was so gorgeous before. It breaks my heart.", "url": "https://i.redd.it/tv6kflaq3m2c1.jpg", "created_utc": 1700969536.0, "score": 3839, "author": "PayEmmy", "num_comments": 146, "permalink": "/r/CleaningTips/comments/1841iqc/the_stocking_my_mom_crossstitched_for_me_is_now/", "html_title": ""}
{"title": "What is this? We clean the sink and it comes back in a week", "selftext": "", "url": "https://i.redd.it/6gf14hgqfjrd1.jpeg", "created_utc": 1727523981.0, "score": 3806, "author": "Cat_Psychology", "num_comments": 400, "permalink": "/r/CleaningTips/comments/1frchia/what_is_this_we_clean_the_sink_and_it_comes_back/", "html_title": ""}
{"title": "I need haaallppp. My teenager right f*%ked my bathtub with hairdye. Any tips? I'm a renter 😢 ", "selftext": "", "url": "https://www.reddit.com/gallery/1hvk41m", "created_utc": 1736226648.0, "score": 3743, "author": "Psychological_Box805", "num_comments": 826, "permalink": "/r/CleaningTips/comments/1hvk41m/i_need_haaallppp_my_teenager_right_fked_my/", "html_title": "Reddit - The heart of the internet"}
{"title": "Wanted to share a secret I just learned. ", "selftext": "Kind of got a secret from a cleaning company in my town. If you have a streaked, water stained stainless steel dishwasher or fridge. Take a microfiber cloth and either barkeepers or the pink stuff. I was told barkeepers. But I used pink stuff because that’s what I had on hand. This is what she told me : You can use a little barkeepers dry powder on a wet, nonabrasive sponge or micro fiber towel. Move with the grain and it should take out some of those spots. Once it’s cleaned you can use Windex or stainless steel cleaner and go across it like normal and it should clean up really nice. \n\nHere are two separate cleans I did. It’s like night and day to be honest and I can’t be more happy. They look almost brand new. ", "url": "https://www.reddit.com/gallery/1g2gsm5", "created_utc": 1728789900.0, "score": 3739, "author": "PotsMomma84", "num_comments": 331, "permalink": "/r/CleaningTips/comments/1g2gsm5/wanted_to_share_a_secret_i_just_learned/", "html_title": "Reddit - The heart of the internet"}
{"title": "Update! “I made a mistake and desperately need advice before my landlord sees it.”", "selftext": "Thank you everyone so much for all of your wonderful suggestions in cleaning the mistake I made with the sink, It’s crazy how many people helped me and I seriously can’t thank all of you enough. \n\nOut of all the suggestions one product kept coming up repeatedly: Barkeepers Friend. So so so many people recommended this so I decided to give it a try and well.. IT WORKED!! \n\nIt took a lot of scrubbing (I started at around 8:25pm and finished around 9:07pm) my arms feel like jello but I am so happy with the results. There’s a few spots I gotta do again but I’m hungry so that’ll be for tomorrow ..\n\nThank you thank you thank you!!\n\n\nOriginal post:\nhttps://www.reddit.com/r/CleaningTips/s/HY2LcMalCy", "url": "https://www.reddit.com/gallery/18gej12", "created_utc": 1702358629.0, "score": 3691, "author": "Rubitee", "num_comments": 120, "permalink": "/r/CleaningTips/comments/18gej12/update_i_made_a_mistake_and_desperately_need/", "html_title": "Reddit - The heart of the internet"}
{"title": "Appreciation for the Bissell Clean Machine", "selftext": "I’ve had the little clean machine for years and have always loved it. But my appreciation has grown leaps and bounds when one of my home care patients let me use her spare room. As I was changing the sheets I saw how dirty the actual mattress was. \n\nI’ll let the pics speak for themselves.", "url": "https://www.reddit.com/gallery/18sjamw", "created_utc": 1703732483.0, "score": 3695, "author": "ProfessionSea7908", "num_comments": 251, "permalink": "/r/CleaningTips/comments/18sjamw/appreciation_for_the_bissell_clean_machine/", "html_title": "Reddit - The heart of the internet"}
{"title": "Hack to keep products from creating mold in the shower", "selftext": "My grandma taught me this trick to use shelf risers to let the bottoms of shampoo bottles etc from getting moldy on the tile or niche.. it works!", "url": "https://i.redd.it/a2agrbpek0ab1.jpg", "created_utc": 1688505046.0, "score": 3660, "author": "La-La-Lu-Lu", "num_comments": 147, "permalink": "/r/CleaningTips/comments/14qr3fx/hack_to_keep_products_from_creating_mold_in_the/", "html_title": ""}
{"title": "30mg of Adderall and a Redbull.", "selftext": "", "url": "https://www.reddit.com/gallery/zogkbv", "created_utc": 1671312009.0, "score": 3656, "author": "Easy-Cream-104", "num_comments": 422, "permalink": "/r/CleaningTips/comments/zogkbv/30mg_of_adderall_and_a_redbull/", "html_title": "Reddit - The heart of the internet"}
{"title": "Years from now your kids won’t remember how clean the house was", "selftext": "Well yeah that’s kinda the point, no? A clean house should be the norm. \nI used to live in absolute filth as a child. My clothes smelled like cigarettes all the time. Couches and rugs full of stains, dirty dishes, windows mopped maybe once a year. I never brought friends home. Ever. I loathed that place, and any place my parents lived in after that. I never had a home. \n\nNow as a parent myself I try my hardest to keep my house clean and decluttered (as much as possible with a baby). I want her to have a home she will always want to come back to.\n\nSo when people say “nobody will remember how clean your home was” I see that as a compliment", "url": "https://www.reddit.com/r/CleaningTips/comments/16rlelb/years_from_now_your_kids_wont_remember_how_clean/", "created_utc": 1695626818.0, "score": 3625, "author": "AlexHammouri", "num_comments": 413, "permalink": "/r/CleaningTips/comments/16rlelb/years_from_now_your_kids_wont_remember_how_clean/", "html_title": "Reddit - The heart of the internet"}
{"title": "Yes, this is Another Irish Spring 5-in-1 Post", "selftext": "", "url": "https://www.reddit.com/gallery/1igenj8", "created_utc": 1738549769.0, "score": 3619, "author": "Quiet_Spirit_4176", "num_comments": 64, "permalink": "/r/CleaningTips/comments/1igenj8/yes_this_is_another_irish_spring_5in1_post/", "html_title": "Reddit - The heart of the internet"}
{"title": "One of the smartest things I did all year - get all Pyrex/Anchor glass containers.", "selftext": "I had known for awhile that plastic containers were no good, but it took me joining this sub and reading comments on how bad they were  that I finally threw out all my rubbermaids and other plastic containers. I got a full Pyrex set from Macys for like $45, then a few months later saw a set of 5 Anchor bowls for like $20. Thank goodness all the lids are interchangeable. \n\nNowadays, we use these as serving dishes for dinner every night. Then whatever doesn’t get used gets a lid and put in the fridge. We’ve really cut down on washing dishes, especially on Taco Tuesdays.  I have 8 of the same containers and never have to worry about finding the right lid. It’s also made storing them all much easier. \n\nWhat are your best tips that you got from this Reddit group?", "url": "https://i.redd.it/fdv3lb85a9dc1.jpeg", "created_utc": 1705608630.0, "score": 3602, "author": "PaulieatesomeWalnuts", "num_comments": 242, "permalink": "/r/CleaningTips/comments/199zgyi/one_of_the_smartest_things_i_did_all_year_get_all/", "html_title": ""}
{"title": "My brothers son has done this😭 help!", "selftext": "", "url": "https://i.redd.it/pbbjf2ds11pe1.jpeg", "created_utc": 1742120200.0, "score": 3580, "author": "AlmondBen", "num_comments": 826, "permalink": "/r/CleaningTips/comments/1jcies1/my_brothers_son_has_done_this_help/", "html_title": ""}
{"title": "ScrubMommy seen at dinner with new \"friend\". He listens and is supportive.", "selftext": "", "url": "https://i.redd.it/y8al28yqxola1.jpg", "created_utc": 1677903899.0, "score": 3562, "author": "Impossible_Aerie2606", "num_comments": 100, "permalink": "/r/CleaningTips/comments/11hpcsj/scrubmommy_seen_at_dinner_with_new_friend_he/", "html_title": ""}
{"title": "Cleaned my parents front door ", "selftext": "Feels like a brand new door. ", "url": "https://www.reddit.com/gallery/1ewmeeh", "created_utc": 1724127094.0, "score": 3553, "author": "_ravioli_buster_", "num_comments": 37, "permalink": "/r/CleaningTips/comments/1ewmeeh/cleaned_my_parents_front_door/", "html_title": "Reddit - The heart of the internet"}
{"title": "Just lost a blueberry down the “main wash” chute of my washing machine (clothes). I am open to ideas as to how to proceed??", "selftext": "Attached is a picture of my breakfast staging station in my apartment. I spilled some blueberries and one rolled off the counter and into the compartment on the left side", "url": "https://i.redd.it/qpbpqabpxs3b1.jpg", "created_utc": 1685797574.0, "score": 3512, "author": "FutureQuail6759", "num_comments": 704, "permalink": "/r/CleaningTips/comments/13zccbn/just_lost_a_blueberry_down_the_main_wash_chute_of/", "html_title": ""}
{"title": "Used the overnight vinegar hack to clean a decade’s worth of scaling on the shower chain", "selftext": "I saw this vinegar hack on Instagram and thought I’d give it a try. You basically pour distilled white vinegar into a small ziplock, submerge the affected area and tie it with a rubber band overnight. Then I used a scrub daddy and wiped off excess stuff in the morning and voila, nearly brand new shower head chain woah! I used it on faucets around the house too, beautiful results. Only warning: the vinegar can eat through cheaper steel..", "url": "https://i.redd.it/zh4qhlja3kzb1.jpg", "created_utc": 1699637629.0, "score": 3479, "author": "blue-lilacs", "num_comments": 84, "permalink": "/r/CleaningTips/comments/17s96pr/used_the_overnight_vinegar_hack_to_clean_a/", "html_title": ""}
