{"title": "Hey guys I'm 14 and made beef Wellington with conac carimilized carrots and a potato au gratin for my dad's birthday. What do think.", "selftext": "", "url": "https://i.redd.it/yoby1cwrowv31.jpg", "created_utc": 1572540521.0, "score": 4117, "author": "meme-master-_-247", "num_comments": 203, "permalink": "/r/cookingforbeginners/comments/dpq9tj/hey_guys_im_14_and_made_beef_wellington_with/", "html_title": ""}
{"title": "Rate my grandma's cakes", "selftext": "", "url": "https://i.redd.it/5sginj2mssh31.jpg", "created_utc": 1566391495.0, "score": 3133, "author": "DodgyDingo1337", "num_comments": 64, "permalink": "/r/cookingforbeginners/comments/ctgc7e/rate_my_grandmas_cakes/", "html_title": ""}
{"title": "Helpful guide for onions!", "selftext": "", "url": "https://i.redd.it/z952ar6t8su31.jpg", "created_utc": 1572050861.0, "score": 3126, "author": "rabbitoncrack", "num_comments": 52, "permalink": "/r/cookingforbeginners/comments/dn6o6j/helpful_guide_for_onions/", "html_title": ""}
{"title": "A Super Morbid Reason To Cook", "selftext": "When I was a little kid, my grandma would come for dinner on Sunday and bring apple pie. She would proceed to critique all the reasons her pastry \"didn't turn out\" as the whole family gorged on her objectively delicious apple pie.  Sunday after Sunday, it was not enough flour, or too much shortening or too hot in the oven.  When I think of my grandmother who passed away decades ago I think of that apple pie and her pursuit of this venerable pie in the sky.\n\nCooking meals for people creates memories.  People are far more likely to remember the night you made that lasagna in a snow storm and everyone danced on the table to a well placed Al Green song and third bottle of wine.  You'll eat out thousands of times, trust me, it's the dinners in that stick. \n\nI once heard of a grandparent who knew they were dying and filled three deep freezes full of meals that their family ate for years.  Everyone eating a warming bowl of ham and split pea soup long after your gone is a pretty damn awesome legacy if you ask me.\n\nSo why should you learn to cook? Many reasons but near the top is so you can cook for other people.  So that if you are lucky to get old and crotchety you can complain about your pastry as your family appreciates every last bite.\n\nLove you Granny T,\n\n\\-R\n\nPS: What a great food memory you have? Please share, I would love to hear them.\n\n&#x200B;", "url": "https://www.reddit.com/r/cookingforbeginners/comments/192pswb/a_super_morbid_reason_to_cook/", "created_utc": 1704834796.0, "score": 3063, "author": "ReggieMilligan", "num_comments": 398, "permalink": "/r/cookingforbeginners/comments/192pswb/a_super_morbid_reason_to_cook/", "html_title": "Reddit - The heart of the internet"}
{"title": "My first attempt at a stir fried meal i am 14 yo", "selftext": "", "url": "https://i.redd.it/jghi566sc3x31.jpg", "created_utc": 1573057069.0, "score": 2782, "author": "DutchBlaster", "num_comments": 107, "permalink": "/r/cookingforbeginners/comments/dsij90/my_first_attempt_at_a_stir_fried_meal_i_am_14_yo/", "html_title": ""}
{"title": "Embarrassed. I’m a 41 year old male who never learned to cook.", "selftext": "It’s true, other than some extremely basic skills like grilling some burgers or a steak, or whipping together pancakes from a box of mix I have basically no cooking knowledge.\n\nMy mom is an excellent cook and I left home to move directly in with my girlfriend who then became my wife who also loved to cook. Now at 41, soon to be divorced (not entirely because I don’t cook) I’m realizing that I need to gain some skills to provide my daughters with good healthy food options.\n\nI don’t even know where to start. Just this week I burned grilled cheese because I didn’t know how hot to get the pan first.\n\nI’m so ashamed and embarrassed, but can anyone recommend a truly beginners guide for me? One that actually says “heat the pan really hot first” or “make sure you use butter/cooking spray”\n\nI’m not necessarily worried about quick recipes, but easy, healthy and something kids will enjoy trying.\n\nThank you in advance.\n\nUPDATE: Holy cow I didn’t think this would blow up like it did! I took the kids skiing today and my phone was blowing up the entire time. Thank you to everyone who took the time to write a response. This doesn’t seem like it’s going to be as hard as I thought and I’m actually looking forward to trying some new things this week.\n\nAll of this isn’t to say I haven’t “tried” many times. In college I could rock a chicken breast on a George Foreman and pop some broccoli in the microwave. This is going to be a great new adventure for me and the kids. Off to YouTube now, Thanks again!\n\nUPDATE 2: I put a pork roast in the oven tonight and so far my house hasn’t burned down. Maybe my “I don’t know how to cook” is more like “I’ve never even made an effort to cook”", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1aioowx/embarrassed_im_a_41_year_old_male_who_never/", "created_utc": 1707055748.0, "score": 2600, "author": "theheffbomb", "num_comments": 1184, "permalink": "/r/cookingforbeginners/comments/1aioowx/embarrassed_im_a_41_year_old_male_who_never/", "html_title": "Reddit - The heart of the internet"}
{"title": "Grilling is super easy with minimal cleanup. My wings took 10 min prep, 30 min on the grill, and most of the time was spent on reddit.", "selftext": "", "url": "https://imgur.com/2F4TM8r.jpg", "created_utc": 1562526545.0, "score": 2528, "author": "cyberchief", "num_comments": 105, "permalink": "/r/cookingforbeginners/comments/caal5j/grilling_is_super_easy_with_minimal_cleanup_my/", "html_title": ""}
{"title": "tonight i made parmesan chicken, buttery garlic noodles, and salad with a lemon and olive oil vinaigrette 🍋🌿🍴", "selftext": "", "url": "https://i.redd.it/ratq2dxnwss31.jpg", "created_utc": 1571187198.0, "score": 2292, "author": "makeupyourworld", "num_comments": 56, "permalink": "/r/cookingforbeginners/comments/dihj13/tonight_i_made_parmesan_chicken_buttery_garlic/", "html_title": ""}
{"title": "My first ever real attempt at making something myself (16 y/o)", "selftext": "", "url": "https://i.redd.it/co0e2n1x68j31.jpg", "created_utc": 1567013759.0, "score": 2255, "author": "ohhhhhhyesssss", "num_comments": 82, "permalink": "/r/cookingforbeginners/comments/cwo1wo/my_first_ever_real_attempt_at_making_something/", "html_title": ""}
{"title": "Just wanted to share my first step into cooking. One pan Chicken Alfredo.", "selftext": "", "url": "https://i.redd.it/dkx9dcxn0xj31.jpg", "created_utc": 1567314331.0, "score": 2162, "author": "_TheLongCon_", "num_comments": 47, "permalink": "/r/cookingforbeginners/comments/cy5yze/just_wanted_to_share_my_first_step_into_cooking/", "html_title": ""}
{"title": "Dead chicken with old milk", "selftext": "", "url": "https://i.imgur.com/O9UDXeD.gifv", "created_utc": 1547934293.0, "score": 2121, "author": "morbidxtc6", "num_comments": 42, "permalink": "/r/cookingforbeginners/comments/ahqn9w/dead_chicken_with_old_milk/", "html_title": ""}
{"title": "Rate My Pizza", "selftext": "", "url": "https://i.redd.it/1j980q5yv0h31.jpg", "created_utc": 1566054005.0, "score": 2092, "author": "PlainBlackT", "num_comments": 96, "permalink": "/r/cookingforbeginners/comments/crn64n/rate_my_pizza/", "html_title": ""}
{"title": "I'm autistic and have a lot of sensory issues that are a problem in the kitchen, so I never really learnt to cook properly, BUT - I've been practicing a lot, andlast night I baked potatoes for the first time and they were amazing!!!! W/ spicy taco-y mince, bean mix, avo, spring onion & coriander 😊", "selftext": "", "url": "https://i.redd.it/5unv1co10cz31.jpg", "created_utc": 1574033446.0, "score": 1928, "author": "issatingok", "num_comments": 59, "permalink": "/r/cookingforbeginners/comments/dxuksh/im_autistic_and_have_a_lot_of_sensory_issues_that/", "html_title": ""}
{"title": "Is it safe to eat rice that hasn't been boiled in water?", "selftext": "Basically I've just cooked a load of rice in a saucepan and forgot to add water to it. It seems cooked, but is it safe?\n\nEdit: nevermind there was water in it, it just evaporated\n\nEdit: holy macaroni wasn't expecting all this attention. 😝 I cant stop laughing now! Anyway first time for everything I suppose . Cheers guys 🙏😅", "url": "https://www.reddit.com/r/cookingforbeginners/comments/rgde1w/is_it_safe_to_eat_rice_that_hasnt_been_boiled_in/", "created_utc": 1639505331.0, "score": 1898, "author": "JumpFew6622", "num_comments": 120, "permalink": "/r/cookingforbeginners/comments/rgde1w/is_it_safe_to_eat_rice_that_hasnt_been_boiled_in/", "html_title": "Reddit - The heart of the internet"}
{"title": "I mean shit... he onto something", "selftext": "", "url": "https://v.redd.it/pv48o06wm9w31", "created_utc": 1572753588.0, "score": 1879, "author": "Orunmilaa", "num_comments": 62, "permalink": "/r/cookingforbeginners/comments/dqvia1/i_mean_shit_he_onto_something/", "html_title": "Reddit - The heart of the internet"}
{"title": "This little guy showing me up!", "selftext": "", "url": "https://gfycat.com/narrowgoldenalbacoretuna", "created_utc": 1568816737.0, "score": 1872, "author": "yungl3af", "num_comments": 73, "permalink": "/r/cookingforbeginners/comments/d5yjmf/this_little_guy_showing_me_up/", "html_title": ""}
{"title": "If I click on your recipe online and I have to scroll through a long boring story full of adds before I get to the actual recipe, I hate you.", "selftext": "Is there a good website that is just, hey, here is how you make this, the end", "url": "https://www.reddit.com/r/cookingforbeginners/comments/nqy46f/if_i_click_on_your_recipe_online_and_i_have_to/", "created_utc": 1622672671.0, "score": 1870, "author": "CheesusHCracker", "num_comments": 109, "permalink": "/r/cookingforbeginners/comments/nqy46f/if_i_click_on_your_recipe_online_and_i_have_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "I made a spreadsheet with all kitchen essentials, including links to recommended products at three price tiers", "selftext": "This new 110-character title limit is a challenge...\n\n[Here is the spreadsheet](https://docs.google.com/spreadsheets/d/1nKkPjKHh9D9jBHzBDXbXRO54vdX41jdDCbr8L7j_omU/edit?usp=sharing)\n\n**There are no referral or affiliate links here**, I am not benefiting in any way from this. I just enjoy helping others. \n\nLet me explain my intentions a bit more\n\nI was bored one ~~day~~ week, and I decided to write up a list of all essential items that any kitchen should have. This was meant to help beginners who don't have much or any kitchen hardware, or for those who are looking to upgrade their existing hardware. I decided to also include an \"expanded\" and \"expert\" level of hardware that you will eventually need as well (see the separate tabs on the bottom of the spreadsheet). \n\nI hand-compiled 95 items, and used product recommendations from America's Test Kitchen and Serious Eats to come up with three different options for each item, at three different price points. So there are currently 279 individual items with prices and links to purchase. \n\nI feel pretty good with the range of items, I'd say it's about 95% inclusive. If you spot anything I have missed, feel free to let me know and I will add it.\n\nEdit: Just wanted to highlight this great suggestion from /u/BrooklynNewsie\n\n>If someone here is planning to move out of their own, it’s worth printing out a list like this and posting it on the wall of your new kitchen, add a check mark every time you want to use something from the list you don’t have yet. Highlight it if there is no available substitute to get the job done without that tool. (Obviously make sure you have the absolute basics [pan, spatula, knife, cutting board, grater, fire extinguisher]) When you hit 3 check marks, add it to your shopping list.\n\nEdit 2: Wow! So much great feedback, thank you all so much!\n\nI have made a few updates to the spreadsheet; I added a mandatory column, per many of your requests, which is just what is sounds like, things that are absolutely mandatory and you can't live without. \n\nI added some little pictures as well, because why not. \n\nNext I will be adding some descriptions as to why each item is considered essential, or basically why I think it deserves a spot in your kitchen. I will try to keep my bias out of this. \n\nI will also be creating a list of baking essentials as well. Look for that in a new post within the next week or so. \n\nLastly, if any of you still reading this have any software programming experience, I am looking for some assistance setting up a Python script or Visual Basic code, or whatever, that will auto-update the prices from Amazon. I know Java and some C++, but that's it. Please DM me if you would be willing to help!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/hr4855/i_made_a_spreadsheet_with_all_kitchen_essentials/", "created_utc": 1594742658.0, "score": 1796, "author": "96dpi", "num_comments": 132, "permalink": "/r/cookingforbeginners/comments/hr4855/i_made_a_spreadsheet_with_all_kitchen_essentials/", "html_title": "Reddit - The heart of the internet"}
{"title": "I think this is the best Spaghetti Bolognese I’ve ever made, feeling proud.", "selftext": "", "url": "https://i.imgur.com/hN8MlEJ.jpg", "created_utc": 1571914213.0, "score": 1793, "author": "missholiday__", "num_comments": 48, "permalink": "/r/cookingforbeginners/comments/dmenp3/i_think_this_is_the_best_spaghetti_bolognese_ive/", "html_title": ""}
{"title": "I'm 27 and this is the first omlette I've made that I haven't had to turn into scramby eggs. Complemented by a side of home fries.", "selftext": "", "url": "https://imgur.com/95sds7w", "created_utc": 1574271991.0, "score": 1647, "author": "DeMAn466", "num_comments": 52, "permalink": "/r/cookingforbeginners/comments/dz5h9q/im_27_and_this_is_the_first_omlette_ive_made_that/", "html_title": ""}
{"title": "College sophomore with no experience in the kitchen. As of today I can now make 2 dishes: grilled cheese and spaghetti!", "selftext": "", "url": "https://i.redd.it/azkx7tfndsp31.jpg", "created_utc": 1569873248.0, "score": 1628, "author": "cakevaljean", "num_comments": 119, "permalink": "/r/cookingforbeginners/comments/dbh7pr/college_sophomore_with_no_experience_in_the/", "html_title": ""}
{"title": "I am a recent college graduate, so I’m still learning a lot, and I definitely don’t have the money for all the cooking utensils I ultimately want. Here’s my first roast chicken... in a pie dish haha.", "selftext": "", "url": "https://i.redd.it/n75wqurdgzx31.jpg", "created_utc": 1573445706.0, "score": 1537, "author": "plum-tree-august", "num_comments": 62, "permalink": "/r/cookingforbeginners/comments/dun0vi/i_am_a_recent_college_graduate_so_im_still/", "html_title": ""}
{"title": "Stop eating instant ramen! Real ramen isn't too hard to make, and I'm here to teach you!", "selftext": "[https://docs.google.com/document/d/1mzsfREteDXpeHjRZgk1I\\_1geagmup4EU58sCsbiLtZY/edit?usp=sharing](https://docs.google.com/document/d/1mzsfREteDXpeHjRZgk1I_1geagmup4EU58sCsbiLtZY/edit?usp=sharing)\n\n&#x200B;\n\nI have just sacrificed my calc grade in order to digitize all my experience and knowledge with Ramen. It's 30 pages and 3000 words long, but there's an easy to use table of contents and it's written with absolute beginners in mind.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/ji7nv3/stop_eating_instant_ramen_real_ramen_isnt_too/", "created_utc": 1603684091.0, "score": 1502, "author": "ACowsepFollower", "num_comments": 164, "permalink": "/r/cookingforbeginners/comments/ji7nv3/stop_eating_instant_ramen_real_ramen_isnt_too/", "html_title": "Reddit - The heart of the internet"}
{"title": "Been getting into making cast iron pizza lately, slid right on out.", "selftext": "", "url": "https://i.redd.it/kot6o1eowcv31.jpg", "created_utc": 1572301026.0, "score": 1476, "author": "frasermtn", "num_comments": 35, "permalink": "/r/cookingforbeginners/comments/dogff8/been_getting_into_making_cast_iron_pizza_lately/", "html_title": ""}
{"title": "a few days ago i posted a photo of a wildly unsuccessful omelette... you guys gave me some tips. this morning i tried again. sautéed onion, spinach, turkey, and mozzarella with two eggs. yum how'd i do this time around? :)", "selftext": "", "url": "https://i.redd.it/ohvccbh01jq31.jpg", "created_utc": 1570195884.0, "score": 1438, "author": "makeupyourworld", "num_comments": 42, "permalink": "/r/cookingforbeginners/comments/dd7ekv/a_few_days_ago_i_posted_a_photo_of_a_wildly/", "html_title": ""}
{"title": "First time making steak!", "selftext": "", "url": "https://i.redd.it/jksnma0aqlt31.jpg", "created_utc": 1571536140.0, "score": 1430, "author": "itxb3n", "num_comments": 53, "permalink": "/r/cookingforbeginners/comments/dkd788/first_time_making_steak/", "html_title": ""}
{"title": "Why does white rice from an Indian restaurant taste better than the rice I make at home?", "selftext": "When I inevitably run out of leftover rice before leftover curry, I'll make my own by throwing some basmati rice into a rice cooker... but it's just never as good. I get the zafarani brand from Costco. \n\n\nGoogle tells me it's just unseasoned basmati rice, so what gives? ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1auabsw/why_does_white_rice_from_an_indian_restaurant/", "created_utc": 1708304170.0, "score": 1429, "author": "Chaosbuggy", "num_comments": 308, "permalink": "/r/cookingforbeginners/comments/1auabsw/why_does_white_rice_from_an_indian_restaurant/", "html_title": "Reddit - The heart of the internet"}
{"title": "I tried my hand at some Thanksgiving classics as a dry run through. I used chicken drumsticks instead of turkey because it’s what I had on hand. Please excuse the cheap dinnerware, as I’m a poor college student:)", "selftext": "", "url": "https://i.redd.it/q5vxi1j9c4041.jpg", "created_utc": 1574376547.0, "score": 1422, "author": "unicornweedfairy", "num_comments": 85, "permalink": "/r/cookingforbeginners/comments/dzria5/i_tried_my_hand_at_some_thanksgiving_classics_as/", "html_title": ""}
{"title": "Hello everyone !! I work in restaurants and want to share some tips to help any cooks that need them .", "selftext": "1.]  Use a wet cloth under your cutting board to keep the board from slipping on your table or counter . \n\n2.] Use sharp knives and a proper grip !. This can't be stated enough . Sharp knives save fingers and a dull knife can and will glance off the edge of most produce and won't do very much to cut meats . Meaning you will use WAY more force than you need to cut something and potentially cut yourself, also cuts from dull knives hurt worse .\n\nTo grip  the knife properly it does take practice.  The most common way to hold the knife is to pinch the blade where it meets the handle . This like choking up on a baseball bat , it will give you better control over the blade . It may feel a little funny at first though and depending on the knife / your hand size and physical abilities could take some adjustment, either way though it's a good place to start . \n\nNow i know we have all seen the way chefs grip things when they are cutting . Its lovingly known as    \" The Clawww\"  and it too saves precious fingertips from amputation. Not only does the claw give adequate control it also keeps your fingers tips in while cutting . \n\n*** Too make the claw lay your hand out flat.\n\n*** Now bend  your fingers at the middle knuckle and bring your fingertips towards your palm .\n\n*** This completes the claw look . \n\n*** Now when you go to hold produce or meat you want to try and hide your fingernails on whatever  you are cutting.  This will almost create a little wall with your middle and index knuckles. \n\n***. Now comes time to conquer some fear , place the side of the knife against the wall you have made now  you can cut down where you need to make the size you want or you can slice or chop the same way by using your knuckle wall as a guide while keeping your fingertips safe .It takes time to get used to it and you may end up knicking yourself but its way better than the possible alternatives \n\n*** KEEP practicing!! .Knife skills and proper grip are skills that take time ,but they will help save injury no matter where you are cooking \n\n3.] Get yourself a kitchen thermometer and a chart on safe cooking temperatures . Bacteria and food born illness thrive  in whats called the temperature  danger zone . Luckily refrigeration and cooking kill most of it the unsafe pathogens so as long as we are mindful of how we treat our food we can stay healthy. The FDA has great charts and info on this i suggest reading over some or all of it . \n\nThe second reason too use the thermometer is to control when your food is done or is ready for another step depending on the recipe ; instead of just guessing. \n\n4.] Do not use shakers to salt things . Keep a little bowl of salt by your stove . Remember all salt is not created equal so you may need to play with different types . I almost always use kosher salt except for baking but thats just me . Any how salt shakers don't let you control the salt so it is easier to over indulge instead of just a pinch at at a time \n\n5.] Same goes for pepper . Unless you have a  pepper mill or grinder you already trust then this is also a safe bet . Some folks just make a blend and leave it at that and use it for just about everything . If i do that then i like to do about 75% kosher salt to about 25% black pepper . \n\n6.] Keep dry cotton hand towels handy . One draped over a shoulder or in an apron string . You never know when a mess or spill wil happen or when you may need to pull out a pan from the oven or move the hot one you forgot you sat there oven .They also are great for keeping your knife clean or giving your hand a quick dry for dealing with life stuff.\n\n7.] Do not be afraid to try your mistakes.  Messing up is part of cooking . Sometimes weird things work ..sometimes they make you question everything  you hold sacred. Either way trying them helps develop your pallete over time and will help you to understand what works together and what does not \n\n8.] If you have read this far then then the last thing i will share is HAVE FUN ! Cooking is more than just a way to fuel yourself . It can be a release and a chance to create and share so have fun with it and relax with it when you can . \n\nI hope these tips help and feel free to ask any questions!\n\nEDIT: Holy cow ! Ididnt expect all this love . Thank you all for the awards you are too kind ❤", "url": "https://www.reddit.com/r/cookingforbeginners/comments/l2punh/hello_everyone_i_work_in_restaurants_and_want_to/", "created_utc": 1611328967.0, "score": 1415, "author": "None", "num_comments": 82, "permalink": "/r/cookingforbeginners/comments/l2punh/hello_everyone_i_work_in_restaurants_and_want_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "My first burger from scratch :)", "selftext": "", "url": "https://i.redd.it/0e3d3idd5f041.jpg", "created_utc": 1574507404.0, "score": 1391, "author": "rlev", "num_comments": 52, "permalink": "/r/cookingforbeginners/comments/e0gky7/my_first_burger_from_scratch/", "html_title": ""}
{"title": "First time making chicken nuggets from scratch. They’re breaded in Hot Cheetos.", "selftext": "", "url": "https://i.redd.it/772pbz5s01u31.png", "created_utc": 1571721290.0, "score": 1383, "author": "ChandlerForrestal", "num_comments": 416, "permalink": "/r/cookingforbeginners/comments/dld4t9/first_time_making_chicken_nuggets_from_scratch/", "html_title": ""}
{"title": "First time making sushi", "selftext": "", "url": "https://i.redd.it/urxp6r5itql31.jpg", "created_utc": 1568111141.0, "score": 1373, "author": "nath39", "num_comments": 45, "permalink": "/r/cookingforbeginners/comments/d25mn4/first_time_making_sushi/", "html_title": ""}
{"title": "Margarita tortilla pizza. I grew the onion, herbs & tomatoes. So tasty!", "selftext": "", "url": "https://i.redd.it/irzbui3bsqf31.jpg", "created_utc": 1565495484.0, "score": 1348, "author": "444izme", "num_comments": 23, "permalink": "/r/cookingforbeginners/comments/cos2nr/margarita_tortilla_pizza_i_grew_the_onion_herbs/", "html_title": ""}
{"title": "First day of healthy diet, I never cook.", "selftext": "", "url": "https://i.redd.it/4iokwzk4cxe31.jpg", "created_utc": 1565138945.0, "score": 1313, "author": "DogsDogsDogs91", "num_comments": 58, "permalink": "/r/cookingforbeginners/comments/cmyvkx/first_day_of_healthy_diet_i_never_cook/", "html_title": ""}
{"title": "I’ve been trying to be better about eating more than just Frosted Flakes for breakfast lately.", "selftext": "", "url": "https://i.redd.it/evzlzcfqv8041.jpg", "created_utc": 1574431522.0, "score": 1304, "author": "AtlanticRambler", "num_comments": 36, "permalink": "/r/cookingforbeginners/comments/e01eoq/ive_been_trying_to_be_better_about_eating_more/", "html_title": ""}
{"title": "What’s your “lazy but amazing” go-to meal?", "selftext": "I’m talking about those meals that take almost no effort but still taste like you put in serious work. The kind of thing you make when you're tired, hungry, and just want comfort food fast.\n\nWhat’s your favorite lazy meal that never disappoints? Bonus points if it only needs a few ingredients!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1jl8f35/whats_your_lazy_but_amazing_goto_meal/", "created_utc": 1743093917.0, "score": 1310, "author": "mrgrassydassy", "num_comments": 1689, "permalink": "/r/cookingforbeginners/comments/1jl8f35/whats_your_lazy_but_amazing_goto_meal/", "html_title": "Reddit - The heart of the internet"}
{"title": "Quick little ripeness guide for avocados!", "selftext": "", "url": "https://i.redd.it/mnecvvqq0yw31.jpg", "created_utc": 1572992503.0, "score": 1302, "author": "rabbitoncrack", "num_comments": 43, "permalink": "/r/cookingforbeginners/comments/ds6m5p/quick_little_ripeness_guide_for_avocados/", "html_title": ""}
{"title": "garlic-parmesan chicken thighs with buttery garlic spaghetti.", "selftext": "", "url": "https://i.redd.it/74yczpdb52o31.jpg", "created_utc": 1569119818.0, "score": 1274, "author": "makeupyourworld", "num_comments": 31, "permalink": "/r/cookingforbeginners/comments/d7kl7r/garlicparmesan_chicken_thighs_with_buttery_garlic/", "html_title": ""}
{"title": "First time using my dutch oven. Homemade mac n' cheese", "selftext": "", "url": "https://i.redd.it/jex8zoz7mv041.jpg", "created_utc": 1574706788.0, "score": 1231, "author": "None", "num_comments": 50, "permalink": "/r/cookingforbeginners/comments/e1kcan/first_time_using_my_dutch_oven_homemade_mac_n/", "html_title": ""}
{"title": "I tried making pork belly ramen. Turned out pretty good", "selftext": "", "url": "https://i.redd.it/ywvei0ndewf31.jpg", "created_utc": 1565563450.0, "score": 1220, "author": "None", "num_comments": 38, "permalink": "/r/cookingforbeginners/comments/cp3m2e/i_tried_making_pork_belly_ramen_turned_out_pretty/", "html_title": ""}
{"title": "NEW SUBREDDIT RULE: No AI", "selftext": "AI tools are not suitable for beginners. AI results are not reliable, results should be fact-checked and this requires experience that a beginner does not have.\n\n  \nAI can give you a recipe that can be legitimately dangerous from a food safety perspective. An advanced cook may recognise these flaws, a beginner cook may follow dangerous instructions without realising why they are dangerous.\n\nPlease feel free to discuss how you feel about AI as a tool for beginners in the comments below.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1eqyvbn/new_subreddit_rule_no_ai/", "created_utc": 1723523003.0, "score": 1222, "author": "Bangersss", "num_comments": 80, "permalink": "/r/cookingforbeginners/comments/1eqyvbn/new_subreddit_rule_no_ai/", "html_title": "Reddit - The heart of the internet"}
{"title": "First attempt at a homemade pizza. any thoughts?", "selftext": "", "url": "https://i.redd.it/ji68x96ugqw31.jpg", "created_utc": 1572901053.0, "score": 1211, "author": "KiddingAce2471", "num_comments": 111, "permalink": "/r/cookingforbeginners/comments/dro1xm/first_attempt_at_a_homemade_pizza_any_thoughts/", "html_title": ""}
{"title": "After 3 years of working 40-60 hour weeks I'm cooking again. Roasted & Stuffed pumpkin", "selftext": "", "url": "https://i.redd.it/rv0r6cxnxbu31.jpg", "created_utc": 1571853404.0, "score": 1216, "author": "MalfunctioningIce", "num_comments": 70, "permalink": "/r/cookingforbeginners/comments/dm2zn8/after_3_years_of_working_4060_hour_weeks_im/", "html_title": ""}
{"title": "First Ever Loaf of Bread", "selftext": "", "url": "https://i.redd.it/my8s0odf6zm31.jpg", "created_utc": 1568648078.0, "score": 1207, "author": "chinpopocortez", "num_comments": 48, "permalink": "/r/cookingforbeginners/comments/d52bmx/first_ever_loaf_of_bread/", "html_title": ""}
{"title": "Steak is expensive, manners are free.", "selftext": "Somebody worked up the nerve to ask the question \n\n>Why is my steak still pink in the middle when the thermometer exceeded 160 degrees?\n\nI have worked in restaurants, I have cooked in a steakhouse, and I've met and waited on people. Through all of it, the most important thing that you learn is that everyone has different tastes and taste buds.  You don't cook it for you, you cook it for them.  And as long as they're not wanting to do something that can cause a foodborne illness, you do it the way they want it, the way it tastes best to them.\n\nAnd while I would happily go hungry before eating anything above a medium rare steak, and I won't even mention steak sauce, that is based on my taste buds.  Mine.\n\nThe OP didn't ask what was the best way to eat their steak, or how everybody likes their steak.   \nInstead they asked how to achieve their cooking goal.  \n\nThe amount of people telling the OP (and anyone else who seems to like their steak cooked the same way) how wrong they are for choosing to cook their steak to the level of doneness that they prefer, is wrong IMO.  Worse yet, some people have gotten pretty rude and condescending because their tastes aren't aligned.   \n\nIt's not politics, it's not religion, it's beef for God's sake.\n\nIf you don't like your steak the same way, who cares?  If somebody asked me how to drive a Chevy, I'm not going to tell them that they can only drive a Buick.  And I'm sure as heck not going to get rude about it with them.\n\nThis group is for beginners to be able to ask questions of people who know how to cook and have been cooking longer.  If someone asks a question and is treated badly for it, then what's the point of this group?\n\nManners are free, let's use them, please and thank you.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/10wobvy/steak_is_expensive_manners_are_free/", "created_utc": 1675833862.0, "score": 1189, "author": "MaggieRV", "num_comments": 123, "permalink": "/r/cookingforbeginners/comments/10wobvy/steak_is_expensive_manners_are_free/", "html_title": "Reddit - The heart of the internet"}
{"title": "First time making Chicken Tikka Masala! Never diced an onion before, but otherwise this was pretty simple to make!", "selftext": "", "url": "https://i.redd.it/90jfzuwj2zs31.jpg", "created_utc": 1571261809.0, "score": 1186, "author": "lobotomyandtights", "num_comments": 60, "permalink": "/r/cookingforbeginners/comments/diw8qs/first_time_making_chicken_tikka_masala_never/", "html_title": ""}
{"title": "The smell from the marinade was amazing but the chicken was still bland. What did I do wrong?", "selftext": "Overall, the chicken was still bland. However, both myself and my roommate could smell the spices and the flavor in the kitchen. It smelled amazing. You would think that when you bite into it, it’ll be like a flavor bomb but nope. \n\nFor the marinade, I use the some nonfat Greek yogurt, some lime juice, some Frank’s red buffalo sauce, tiny bit of Dijon mustard, Mrs Dash seasoning, smoked paprika, and a ranch seasoning packet. I first made the marinade and then poured some of the dry seasonings on the chicken and then combined the marinade on top.\n\nI let that marinate into chicken thighs with the skin on in a Ziploc bag in the refrigerator for about two hours before I air fried it. \n\nThe chicken came out moist and good, it was just that the taste did not match the smell at all. The smell was flavortown, but after it cooked, the taste was like almost no seasoning. \n\nWhat’s going on here?", "url": "https://www.reddit.com/r/cookingforbeginners/comments/18jv4ug/the_smell_from_the_marinade_was_amazing_but_the/", "created_utc": 1702745161.0, "score": 1173, "author": "half_filed_cup", "num_comments": 331, "permalink": "/r/cookingforbeginners/comments/18jv4ug/the_smell_from_the_marinade_was_amazing_but_the/", "html_title": "Reddit - The heart of the internet"}
{"title": "I burn everything in a microwave. It was nice to make something simple successfully: Mi Goreng spicy noodles and a fried egg.", "selftext": "", "url": "https://imgur.com/8lfSu98", "created_utc": 1557880791.0, "score": 1155, "author": "TheRealShamu", "num_comments": 61, "permalink": "/r/cookingforbeginners/comments/boqyz0/i_burn_everything_in_a_microwave_it_was_nice_to/", "html_title": ""}
{"title": "Mac (not really Mac) and cheese with garlic butter croutons", "selftext": "", "url": "https://i.redd.it/jgelypnadpr31.jpg", "created_utc": 1570708506.0, "score": 1140, "author": "None", "num_comments": 38, "permalink": "/r/cookingforbeginners/comments/dfwwrz/mac_not_really_mac_and_cheese_with_garlic_butter/", "html_title": ""}
{"title": "My first omelette was way easier to make than I was expecting! It’s filled with spinach, tomatoes, and mushrooms.", "selftext": "", "url": "https://i.redd.it/8kiao54zryo31.jpg", "created_utc": 1569514867.0, "score": 1136, "author": "gill0896", "num_comments": 58, "permalink": "/r/cookingforbeginners/comments/d9lws9/my_first_omelette_was_way_easier_to_make_than_i/", "html_title": ""}
{"title": "Wikipedia has a COOKBOOK!", "selftext": "Full of recipes from around the world. Has tips and instructions on techniques, measurements, and more! \n\n\nhttps://en.m.wikibooks.org/wiki/Cookbook:Table_of_Contents", "url": "https://www.reddit.com/r/cookingforbeginners/comments/ezvoko/wikipedia_has_a_cookbook/", "created_utc": 1581010226.0, "score": 1126, "author": "agreensandcastle", "num_comments": 30, "permalink": "/r/cookingforbeginners/comments/ezvoko/wikipedia_has_a_cookbook/", "html_title": "Reddit - The heart of the internet"}
{"title": "Sausage Carbonara what y’all think?", "selftext": "", "url": "https://i.redd.it/ef3fuy0pkft31.jpg", "created_utc": 1571461620.0, "score": 1121, "author": "NotBradPit184", "num_comments": 78, "permalink": "/r/cookingforbeginners/comments/djzb2r/sausage_carbonara_what_yall_think/", "html_title": ""}
{"title": "Attempted to make Thai curry for the fam.", "selftext": "", "url": "https://i.redd.it/r561j1lmotk31.jpg", "created_utc": 1567709806.0, "score": 1110, "author": "EatChoFruitz", "num_comments": 41, "permalink": "/r/cookingforbeginners/comments/d053fb/attempted_to_make_thai_curry_for_the_fam/", "html_title": ""}
{"title": "Fresh ground pepper is pretentious ", "selftext": "My whole life I thought fresh cracked peppercorns was just a pretentious thing. How different could it be from the pre-ground stuff?....now after finally buying a mill and using it in/on sauces, salads, sammiches...I'm blown away and wondering what other stupid spice and flavor enhancing tips I've foolishly been not listening to because of:\n\n-pretentious/hipster vibes\n-calories\n-expense\n\nWhat flavors something 100% regardless of any downsides", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1fnb90k/fresh_ground_pepper_is_pretentious/", "created_utc": 1727061901.0, "score": 1107, "author": "__BIFF__", "num_comments": 1055, "permalink": "/r/cookingforbeginners/comments/1fnb90k/fresh_ground_pepper_is_pretentious/", "html_title": "Reddit - The heart of the internet"}
{"title": "I never seem to taste my spices — am I not adding enough? It’s getting a bit absurd.", "selftext": "As the title says, it seems like I NEVER taste my spices outside salt and coarse black pepper. Onion/garlic powder are strong enough that I taste them. But paprika? Nothing. I added SO MUCH paprika to my eggs. Everyone says it’s amazing. Nothing, except they got a bit crunchier. Basil or oregano? Nope. Thyme? It’s visually pleasing, I guess. Cilantro makes my mouth itchy and smells awful, but I can actually taste that one (it’s bad to me). \n\nThings like butter, citrus, vinegar, that’s all fine. Red pepper flakes or cayenne have the same taste of “burn” (which I like, but apparently spicy things have a “flavor”? Spicy things have always just been Hot Flavor to me). Soy sauce has a taste but I think it’s just vinegar to be honest. \n\nAt first I thought I just wasn’t adding *enough*, but when I tell you I’ve been drowning things in spices…. And it’s not even just sprinkling it on at the end— I pan fry things in spices, I follow recipes and put them on meat before cooking, mix them with my bread crumbs, add them to sauces, all sorts of things. But all I get is the salt, pepper, and general Acidy or Spicy. \n\nAnd I CAN taste things. I can taste fish and love seafood, I can enjoy different fruits and vegetables (love brussel sprouts), it’s not like I am completely unable to taste things. And I can SMELL the spices and tell the difference with my nose, just not my tongue usually. I don’t drink soda or anything with my meals so that isn’t overpowering my mouth either. \n\nKind of wanting to go back to butter noodles with salt and vinegar. It feels the same. \n\nAm I supposed to, like, bake these spices before using them? They come in the little bottles already so I’ve assumed it is fine to use them straight from there. \n\nSorry if this is a ridiculous question but I always hear “just add more than you think you need!” and I am really questioning how much that is now. My egg salad is paprika red. It does not taste red. It tastes like egg.\n\nEdit: thank you all for the wonderful replies! To answer questions\n\n1. No, it was not COVID (thankfully)\n\n2. I do not smoke\n\n3. I PROMISE I am not skimping on the salt\n\n4. **Today I learned that spices expire, and oh BOY are these bad boys expired**. Oof. \n\n5. I showed my friend (the paprika fanatic) about this post and she laughed her ass off! She said she was talking about some other fancy paprika and not the regular kind in stores!!! Girl how was I supposed to know that!! But she promised to make me something with it so I can “get what the fuss is about”. Based on the replies, I expect to be underwhelmed. Or perhaps ascend to the Hungarian heavens. We’ll see ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/199eish/i_never_seem_to_taste_my_spices_am_i_not_adding/", "created_utc": 1705543142.0, "score": 1105, "author": "MemerDreamerMan", "num_comments": 260, "permalink": "/r/cookingforbeginners/comments/199eish/i_never_seem_to_taste_my_spices_am_i_not_adding/", "html_title": "Reddit - The heart of the internet"}
{"title": "homemade pancakes, bacon, and eggs 🍳", "selftext": "", "url": "https://i.redd.it/4stea3161px31.jpg", "created_utc": 1573319541.0, "score": 1098, "author": "makeupyourworld", "num_comments": 36, "permalink": "/r/cookingforbeginners/comments/dtypav/homemade_pancakes_bacon_and_eggs/", "html_title": ""}
{"title": "This is Slop - also known by some as goulash. It is \"great shit\". Super cheap and it goes a long way. You can use beef or turkey as the meat", "selftext": "", "url": "https://imgur.com/9JEM00w", "created_utc": 1562352794.0, "score": 1096, "author": "Chtorrr", "num_comments": 67, "permalink": "/r/cookingforbeginners/comments/c9joex/this_is_slop_also_known_by_some_as_goulash_it_is/", "html_title": ""}
{"title": "Bacon & Fried Egg sandwich, first time cooking at 13.", "selftext": "", "url": "https://i.redd.it/qr1wcjxjgxy31.jpg", "created_utc": 1573857394.0, "score": 1073, "author": "TadeToto", "num_comments": 91, "permalink": "/r/cookingforbeginners/comments/dwy4nw/bacon_fried_egg_sandwich_first_time_cooking_at_13/", "html_title": ""}
{"title": "Egg Drop Soup is comforting and insanely simple to make.", "selftext": "Seriously. It's basically just make liquid hot, add egg, stir. The way you doctor it up is completely up to you, but here's a very foundational recipe. This makes a single serving but can be scaled 1:1.\n\n*Egg Drop Soup*\n\n**Ingredients**\n\n1 cup chicken broth (or broth of your choice)\n\n1/4 to 1/3 teaspoon soy sauce, or to taste\n\nA few drops of sesame oil\n\n1 teaspoon cornstarch\n\n2 teaspoons cold water\n\nPinch of salt if desired\n\nWhite pepper to taste (I don't always have this on hand and black pepper also works fine)\n\n**Method**\n\nMix together liquid ingredients in a small pot\n\nMake a slurry using the cornstarch and just a bit of cold water. To do this, whisk the cornstarch and cold water in a small bowl briskly until it combines into a thick, almost batter-like, liquid. Doing this will prevent the cornstarch from clumping up in the soup.\n\nAdd slurry to the hot broth while stirring to thicken. Now is a good time to carefully take a taste and see how much salt and pepper it needs. I like my soups salty, but having already added broth and soy sauce, this one is often salty enough already.\n\nTHE FUN PART! Beat an egg and drop that bad boy in the pot once the water comes to a low boil. Immediately turn off the heat while stirring (in one direction) as the egg will continue to cook in the residual heat. You can let it boil while stirring for a moment if you like a firmer egg, but I enjoy them whispy.\n\nEnjoy while hot! \n\n**Notes**\n\nStir either clockwise or counterclockwise, but not both. Stirring in one direction gives the eggs that whispy but fluffy texture.\n\nThe color will probably look a bit bland compared to what you are used to from takeout places. I assume they either add some coloring or maybe use a white soy sauce? I dunno, but this one is just as good.\n\nI go easy on sesame oil because I find it can easily get overpowering, but feel free to add more if you love the stuff.\n\nKeep it casual when making this. The base of it is broth, soy sauce, and egg, beyond that is your playground. This recipe is meant to be a jumping off point. I'll include some variations in the comments.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/jc8uod/egg_drop_soup_is_comforting_and_insanely_simple/", "created_utc": 1602851098.0, "score": 1071, "author": "southerngentleman90", "num_comments": 88, "permalink": "/r/cookingforbeginners/comments/jc8uod/egg_drop_soup_is_comforting_and_insanely_simple/", "html_title": "Reddit - The heart of the internet"}
{"title": "To whomever posted a week ago and taught me to cook my bacon low and slow until crispy, thank you.", "selftext": " you have changed my life! I am now head breakfast chef for the house. It took about 25 to 30 mins at low medium heat. But it's so crispy and melt in your mouth perfect. ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1jyan8z/to_whomever_posted_a_week_ago_and_taught_me_to/", "created_utc": 1744559210.0, "score": 1066, "author": "Proper_Ad_843", "num_comments": 79, "permalink": "/r/cookingforbeginners/comments/1jyan8z/to_whomever_posted_a_week_ago_and_taught_me_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "First shot at proper chicken fried rice.", "selftext": "", "url": "https://i.redd.it/twn7jup8jov31.jpg", "created_utc": 1572441793.0, "score": 1046, "author": "None", "num_comments": 51, "permalink": "/r/cookingforbeginners/comments/dp6ohf/first_shot_at_proper_chicken_fried_rice/", "html_title": ""}
{"title": "I just burned the shit out of my pork chop! Fuck!", "selftext": "", "url": "https://i.imgur.com/f1YpCo1.jpg", "created_utc": 1560292068.0, "score": 1046, "author": "None", "num_comments": 139, "permalink": "/r/cookingforbeginners/comments/bzj42l/i_just_burned_the_shit_out_of_my_pork_chop_fuck/", "html_title": ""}
{"title": "Followed Binging with Babish deep dish pizza video! Used store bought dough though", "selftext": "", "url": "https://i.redd.it/oym1jieplir31.jpg", "created_utc": 1570626584.0, "score": 1040, "author": "atvlouis", "num_comments": 31, "permalink": "/r/cookingforbeginners/comments/dfgtai/followed_binging_with_babish_deep_dish_pizza/", "html_title": ""}
{"title": "First steak (and baked potato) I’ve cooked in my life, over charcoal.", "selftext": "", "url": "https://i.redd.it/t2hmjbbgumh31.jpg", "created_utc": 1566319479.0, "score": 1037, "author": "Stoney-McBoney", "num_comments": 45, "permalink": "/r/cookingforbeginners/comments/ct1xux/first_steak_and_baked_potato_ive_cooked_in_my/", "html_title": ""}
{"title": "I made a website that removes all the clutter from recipe sites, saves your recipes and allows you to share them. Please tell me what you think!", "selftext": "I made a website for easily saving and organizing recipes found online. While you are browsing for a recipe simply put [cooked.wiki/](https://cooked.wiki/) before the url and it gives you just the ingredients and the instructions. \n\nAfter that you can edit it and save it.\n\nYou can share your saved recipes with anyone and everyone can also can browse all your recipes. Feel free to try it.\n\nExample:\n\nOriginal recipe: [https://www.alphafoodie.com/simple-homemade-rice-milk-2-ingredients/](https://www.alphafoodie.com/simple-homemade-rice-milk-2-ingredients/)\n\nUsing cooked.wiki: [cooked.wiki/https://www.alphafoodie.com/simple-homemade-rice-milk-2-ingredients/](https://cooked.wiki/https://www.alphafoodie.com/simple-homemade-rice-milk-2-ingredients/)\n\nAny feedback is appreciated!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/11m88a6/i_made_a_website_that_removes_all_the_clutter/", "created_utc": 1678309734.0, "score": 1022, "author": "No-Coconut4265", "num_comments": 156, "permalink": "/r/cookingforbeginners/comments/11m88a6/i_made_a_website_that_removes_all_the_clutter/", "html_title": "Reddit - The heart of the internet"}
{"title": "Anyone else frustrated when recipes leave out \"unwritten rules\" or \"obvious\" steps?", "selftext": "More often than not it feels like recipes are written for people who already cook regularly, and the directions are more of a basic guideline instead of an actual step by step of what you're supposed to be doing. Most of the recipes I make that turn out badly are because I didn't do something I realized I should have done ahead of time. Which is a great lesson, but as a learner it's so frustrating that in every recipe there's always some minor unknown step that you have to keep in the back on your mind.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/nlc3k6/anyone_else_frustrated_when_recipes_leave_out/", "created_utc": 1622018583.0, "score": 1012, "author": "Inovox", "num_comments": 109, "permalink": "/r/cookingforbeginners/comments/nlc3k6/anyone_else_frustrated_when_recipes_leave_out/", "html_title": "Reddit - The heart of the internet"}
{"title": "NY Strip Steak with Russet Baked Potato and Seasoned Corn", "selftext": "", "url": "https://i.redd.it/mf91zv9bs4r31.jpg", "created_utc": 1570459322.0, "score": 1000, "author": "deker0", "num_comments": 34, "permalink": "/r/cookingforbeginners/comments/dekd4y/ny_strip_steak_with_russet_baked_potato_and/", "html_title": ""}
{"title": "Need to practice not breaking the yolk", "selftext": "", "url": "https://i.redd.it/mnl6dsn80mk31.jpg", "created_utc": 1567616863.0, "score": 998, "author": "Ammanpkt", "num_comments": 94, "permalink": "/r/cookingforbeginners/comments/cznp1t/need_to_practice_not_breaking_the_yolk/", "html_title": ""}
{"title": "First time I made Corn Bread, came out delicious.", "selftext": "", "url": "https://i.redd.it/6xnuuoz0cpe31.jpg", "created_utc": 1565042083.0, "score": 990, "author": "Jpriest09", "num_comments": 34, "permalink": "/r/cookingforbeginners/comments/cmhmcf/first_time_i_made_corn_bread_came_out_delicious/", "html_title": ""}
{"title": "Don't Tell Your Life Story, Just Give Us the Recipe: A PSA for Recipe Websites", "selftext": "Attention fellow foodies and recipe enthusiasts: when visiting a recipe website, we know that you're here for one thing and one thing only - the recipe! So please, let's skip the lengthy introductions and life stories at the start of a recipe. We're all busy people with hungry stomachs, and we just want to get straight to the good stuff - the ingredients, the instructions, and most importantly, the end result of a delicious meal. So let's not waste any more time, and get cooking!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/zi82m8/dont_tell_your_life_story_just_give_us_the_recipe/", "created_utc": 1670717364.0, "score": 983, "author": "o_t_i_s_", "num_comments": 134, "permalink": "/r/cookingforbeginners/comments/zi82m8/dont_tell_your_life_story_just_give_us_the_recipe/", "html_title": "Reddit - The heart of the internet"}
{"title": "See you in 8 hours...", "selftext": "", "url": "https://i.redd.it/ato7uxg82wx31.jpg", "created_utc": 1573404628.0, "score": 987, "author": "kanuvpayne", "num_comments": 68, "permalink": "/r/cookingforbeginners/comments/dudugh/see_you_in_8_hours/", "html_title": ""}
{"title": "First time making roasted pork belly", "selftext": "", "url": "https://v.redd.it/4u9uz9oq53w31", "created_utc": 1572618865.0, "score": 981, "author": "churndabutta", "num_comments": 54, "permalink": "/r/cookingforbeginners/comments/dq51px/first_time_making_roasted_pork_belly/", "html_title": "Reddit - The heart of the internet"}
{"title": "Twix cake i made for my brother's birthday", "selftext": "", "url": "https://i.redd.it/ttsfytyiytr31.jpg", "created_utc": 1570764074.0, "score": 978, "author": "None", "num_comments": 29, "permalink": "/r/cookingforbeginners/comments/dg99fz/twix_cake_i_made_for_my_brothers_birthday/", "html_title": ""}
{"title": "First try at hollandaise sauce turned out really well.", "selftext": "", "url": "https://i.redd.it/27ycr7ery6m31.jpg", "created_utc": 1568306453.0, "score": 977, "author": "Ammanpkt", "num_comments": 36, "permalink": "/r/cookingforbeginners/comments/d3al01/first_try_at_hollandaise_sauce_turned_out_really/", "html_title": ""}
{"title": "I've been playing this video everytime I need to cut an onion.", "selftext": "", "url": "https://www.youtube.com/watch?v=CwRttSfnfcc", "created_utc": 1545512635.0, "score": 967, "author": "BizJoe", "num_comments": 47, "permalink": "/r/cookingforbeginners/comments/a8ogih/ive_been_playing_this_video_everytime_i_need_to/", "html_title": "Dicing an Onion by Chef Jean Pierre - YouTube"}
{"title": "Is there an app like Duolingo to help with cooking?", "selftext": "Starts you off making really simple food while you level up to make more complex meals. Possibly something that helps you learn about cooking and what makes something good rather than just the recipes. I haven’t found anything like this but this is definitely something that would get me into cooking.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/hh1vdj/is_there_an_app_like_duolingo_to_help_with_cooking/", "created_utc": 1593293202.0, "score": 962, "author": "None", "num_comments": 211, "permalink": "/r/cookingforbeginners/comments/hh1vdj/is_there_an_app_like_duolingo_to_help_with_cooking/", "html_title": "Reddit - The heart of the internet"}
{"title": "Complete amateur baking I know but it's my little sisters 16th birthday so I made her these. I just love to bake!", "selftext": "", "url": "https://i.redd.it/qcewfdfqrng31.jpg", "created_utc": 1565894821.0, "score": 951, "author": "loveislandfan11", "num_comments": 37, "permalink": "/r/cookingforbeginners/comments/cqu3j8/complete_amateur_baking_i_know_but_its_my_little/", "html_title": ""}
{"title": "First cheese cake I've made. did I do good? sorry for bad lighting", "selftext": "", "url": "https://i.redd.it/mw0n9ltc0av31.jpg", "created_utc": 1572265990.0, "score": 930, "author": "KiddingAce2471", "num_comments": 50, "permalink": "/r/cookingforbeginners/comments/do875t/first_cheese_cake_ive_made_did_i_do_good_sorry/", "html_title": ""}
{"title": "Omelettes have made me in to a morning person. :) how did i I do? This one stayed together, but was softer. I actually missed some of the crisp exterior, so I'm gonna turn my heat up next time!", "selftext": "", "url": "https://i.redd.it/qt0wtt2mjxq31.jpg", "created_utc": 1570371636.0, "score": 926, "author": "makeupyourworld", "num_comments": 49, "permalink": "/r/cookingforbeginners/comments/de3ug0/omelettes_have_made_me_in_to_a_morning_person_how/", "html_title": ""}
{"title": "PSA: The ingredients you use don't dictate if you're a \"good\" or \"bad\" cook. What shortcuts do you use?", "selftext": "I saw a tweet the other day, that got a fair bit of traction, that argued that using food shortcuts - like minced garlic in a jar, shakeable parmesan cheese, and lemon juice in a container - means that you're not a good cook. After quite a bit of pushback, the tweet was deleted.\n\nIf you saw this tweet and felt self-conscious or you've ever been made to feel a pang of shame about your ingredient choices, remember that you are making the best choices for you.\n\nThere are tons of reasons to use alternative versions of ingredients: they have longer shelf lives, they're quicker and easier to handle, they simplify a step in a more complicated recipe, they have a different taste that you might prefer.\n\nIf you have to defend the use of an ingredient to someone, they're not trying to support you in nourishing yourself. They're just trying to gatekeep cooking.\n\nWhat are some shortcuts that you like to use? I love having ginger-garlic paste in my fridge because it saves so much time.\n\nEdit: Thank you for the awards - they're my first! Everyone who is making food for themselves right now - no matter where you are in your culinary journey - I'm really proud of you.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/l4s7tg/psa_the_ingredients_you_use_dont_dictate_if_youre/", "created_utc": 1611594481.0, "score": 923, "author": "great-expectations77", "num_comments": 281, "permalink": "/r/cookingforbeginners/comments/l4s7tg/psa_the_ingredients_you_use_dont_dictate_if_youre/", "html_title": "Reddit - The heart of the internet"}
{"title": "I cooked pasta for the first time in my life yesterday!", "selftext": "I'm completely new to cooking and was suggested to this subreddit from a post I made a while ago...\n\nI looked at this one recipe for pasta (I don't have the link to it unfortunately, and neither can find it again) and tried making it yesterday\n\nIt was the first time I've ever tried cooking on my own, and it went quite well! I didn't make a mess, the food was better than I expected it to be, and I didn't hurt myself while chopping up the vegetables/cooking the cheese sauce and boiling the pasta...\n\nI feel very accomplished and happy and just wanted to share this!!!\n\nThank you reddit stranger for the pasta recipe... \n\nI wanna try cooking more stuff now, so any suggestions for some easy dishes? Thanks for the help!!!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/k5v14w/i_cooked_pasta_for_the_first_time_in_my_life/", "created_utc": 1606992510.0, "score": 918, "author": "cryptic_slays", "num_comments": 89, "permalink": "/r/cookingforbeginners/comments/k5v14w/i_cooked_pasta_for_the_first_time_in_my_life/", "html_title": "Reddit - The heart of the internet"}
{"title": "Chicken Tostadas and homemade Salsa", "selftext": "", "url": "https://i.redd.it/z8vxsu4jt4t31.jpg", "created_utc": 1571331419.0, "score": 921, "author": "Dro5-9", "num_comments": 21, "permalink": "/r/cookingforbeginners/comments/dj97tc/chicken_tostadas_and_homemade_salsa/", "html_title": ""}
{"title": "is there a website out there with recipes that don't include a life story?", "selftext": "99% of the time when I'm looking for help making something, it's paragraph after paragraph of useless filler. There has to be a site out there that is legit, just recipes.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/11lfhny/is_there_a_website_out_there_with_recipes_that/", "created_utc": 1678232335.0, "score": 911, "author": "None", "num_comments": 269, "permalink": "/r/cookingforbeginners/comments/11lfhny/is_there_a_website_out_there_with_recipes_that/", "html_title": "Reddit - The heart of the internet"}
{"title": "I made fried chicken by myself for the first time!", "selftext": "", "url": "https://i.imgur.com/Fr1tbcy.jpg", "created_utc": 1569971284.0, "score": 909, "author": "ireallylikechikin", "num_comments": 45, "permalink": "/r/cookingforbeginners/comments/dc1k8d/i_made_fried_chicken_by_myself_for_the_first_time/", "html_title": ""}
{"title": "Making french fries at home", "selftext": "", "url": "http://i.imgur.com/cMEGqNr.gifv", "created_utc": 1501559312.0, "score": 905, "author": "Polkdaddy84", "num_comments": 43, "permalink": "/r/cookingforbeginners/comments/6qtqt7/making_french_fries_at_home/", "html_title": ""}
{"title": "It is incredible how simply adding an egg to your rice dish adds so much flavour and aestheticism. Highly recommended!", "selftext": "", "url": "https://i.redd.it/ve51qh8t81l31.jpg", "created_utc": 1567801354.0, "score": 902, "author": "AtlanticRambler", "num_comments": 33, "permalink": "/r/cookingforbeginners/comments/d0m1aq/it_is_incredible_how_simply_adding_an_egg_to_your/", "html_title": ""}
{"title": "make people jealous with homemade white mocha and banana bread", "selftext": "", "url": "https://i.redd.it/myl9q1lvmcp31.jpg", "created_utc": 1569682659.0, "score": 901, "author": "makeupyourworld", "num_comments": 20, "permalink": "/r/cookingforbeginners/comments/dah1eq/make_people_jealous_with_homemade_white_mocha_and/", "html_title": ""}
{"title": "6 hours and $25 later I went to bed hungry. How did you learn this????", "selftext": "How did you learn to cook?  I can not emotionally deal with cooking failures. I have absolutely no natural ability, but I am college-educated.  Why can I not do this!!!  I am 50 and only alive because my husband can cook.  I really want to take the strain off of him.\n\nEdit: For everyone asking. I was attempting to make a large vat of homemade gravy without dripping. Everything went great until I added too much flour. All internet searches for a fix just led to it tasting more bland. I had this 'wonderful\" idea to add a little Worchester sauce. I love that flavor. I thought it would add depth. I have never tasted something so horrid. It added a fishy aftertaste. Gross. The whole mess got thrown out.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1gp05w5/6_hours_and_25_later_i_went_to_bed_hungry_how_did/", "created_utc": 1731351845.0, "score": 889, "author": "Head-Moose-7578", "num_comments": 1553, "permalink": "/r/cookingforbeginners/comments/1gp05w5/6_hours_and_25_later_i_went_to_bed_hungry_how_did/", "html_title": "Reddit - The heart of the internet"}
{"title": "Chicken Sandwich. Popeyes has nothing on me.", "selftext": "", "url": "https://i.redd.it/dyw226o095z31.jpg", "created_utc": 1573951713.0, "score": 887, "author": "mattrew84", "num_comments": 37, "permalink": "/r/cookingforbeginners/comments/dxfkhq/chicken_sandwich_popeyes_has_nothing_on_me/", "html_title": ""}
{"title": "Made garlic and herb pasta with veggies last night. It was super tasty.", "selftext": "", "url": "https://i.redd.it/jvquvqf9zzi31.jpg", "created_utc": 1566914330.0, "score": 884, "author": "Fat_Giraffes", "num_comments": 26, "permalink": "/r/cookingforbeginners/comments/cw4u64/made_garlic_and_herb_pasta_with_veggies_last/", "html_title": ""}
{"title": "I finally baked a cake that rose beautifully! 😍", "selftext": "", "url": "https://imgur.com/TtuUtDE", "created_utc": 1553459038.0, "score": 883, "author": "KasperAura", "num_comments": 25, "permalink": "/r/cookingforbeginners/comments/b511wb/i_finally_baked_a_cake_that_rose_beautifully/", "html_title": ""}
{"title": "Italian sausage and potatoes. It’s delicious!", "selftext": "", "url": "https://i.redd.it/i0gdtx2ybxt31.jpg", "created_utc": 1571676602.0, "score": 885, "author": "Fat_Giraffes", "num_comments": 35, "permalink": "/r/cookingforbeginners/comments/dl3bix/italian_sausage_and_potatoes_its_delicious/", "html_title": ""}
{"title": "Zero waste!", "selftext": "", "url": "https://i.redd.it/fg5ru911jii31.jpg", "created_utc": 1566737038.0, "score": 874, "author": "ZeezeTV", "num_comments": 42, "permalink": "/r/cookingforbeginners/comments/cv81o1/zero_waste/", "html_title": ""}
{"title": "An attempt at chicken parmigiana and homemade marinara sauce.", "selftext": "", "url": "https://i.redd.it/kmbsbx2nzmn31.jpg", "created_utc": 1568936534.0, "score": 868, "author": "mirabreaux", "num_comments": 30, "permalink": "/r/cookingforbeginners/comments/d6mdrh/an_attempt_at_chicken_parmigiana_and_homemade/", "html_title": ""}
{"title": "How do people cook multiple times a day every day and keep up with all the dishes?", "selftext": "I’m not sure this is the right sub for this but this is one of my main obstacles when it comes to cooking. I feel like I always take apt longer than the recipies say it will take, like if I have to boil something and then the recipe says to chop a few veggies while the thing boils I know I have to cut those in the beginning before I put the thing on to boil or else I’ll run out of time. This means a lot of the time I can’t wash the dishes as I go, but then I’m tired after having cooked and I want to eat my food warm so I just do the dishes after,  and then I either have to wait for them to dry or wait for the dishe washer to be done that by the time I go to cook my next meal I’d have to use the stuff I just washed and didn’t even put away yet. Am I just using an exorbitant amount of dishes and cooking utensils to cook or do other people have this problem too?", "url": "https://www.reddit.com/r/cookingforbeginners/comments/krhx99/how_do_people_cook_multiple_times_a_day_every_day/", "created_utc": 1609913462.0, "score": 866, "author": "InkGeode", "num_comments": 186, "permalink": "/r/cookingforbeginners/comments/krhx99/how_do_people_cook_multiple_times_a_day_every_day/", "html_title": "Reddit - The heart of the internet"}
{"title": "Having trouble with seasoning your food properly? Try the apple experiment!", "selftext": "I've mentioned this a couple times before in this sub, but I figured I should make a post about it too.\n\nIf you are having trouble with your food coming up bland, or just not quite right, seasoning-wise, it is probably due to not just how much salt you're adding, but when you're adding it.\n\nTake an apple and slice it up. I like slices that are about 1/4\" thick for this\n\nUsing a very small pinch of salt, lightly sprinkle each slice of apple with the same amount of salt. But do it at different time intervals.\n\nSalt slice one and let it sit 5 minutes. \n\nSalt slice two and let it sit 4 minutes.\n\nSalt slice three and let it sit 3 minutes.\n\nSalt slice four and let it sit 1 minute.\n\nSalt slice 5 immediately before eating it.\n\nYou should notice that the longer the salt has been on the apple, the more \"appley\" the apple will taste. The 5 minute slice likely won't be \"salty\", but will taste intensely of apple. With each slice you will notice the apple tasting less \"appley\" and slightly more like an apple with salt on it. The slice you salt immediately before eating will taste a bit bland and salty.\n\nSalt helps draw flavor out of the food, and the more time you give it penetrate and work it's magic, the deeper into the food it can get. This is one of the reasons why things like brining, marinating and dry brining are done. If you combine this method with other flavorings (herbs, spices, citrus zest, vinegar, etc) the salt helps those flavors penetrate and become part of the food too.\n\nWhen you are seasoning you food keep this in mind. Adding salt to something, especially something \"wet\", like meat, potatoes, tomatoes and allowing that salt to sit on there until absorbed, will allow the salt to penetrate into that food and make the food more flavorful. For drier raw food, like green beans, broccoli, even carrots, you can achieve the same effect by blanching in salted water.\n\nIf you are only adding seasonings (salt) at the end of your cooking process, or not letting the salt absorb, your food may taste a bit bland and salty at the same time. Giving salt the time it needs to work on your food is key to getting the most flavor out of your food.\n\nWith this method you may find that even though you are salting each individual ingredient, you may end up using less salt overall, and may not need to add salt once the food is on the plate.\n\nIt's worth experimenting around with to find how much salt, and how long that salt sits on your food before cooking it, works for your taste buds", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1he5w7b/having_trouble_with_seasoning_your_food_properly/", "created_utc": 1734191977.0, "score": 869, "author": "mmmmpork", "num_comments": 78, "permalink": "/r/cookingforbeginners/comments/1he5w7b/having_trouble_with_seasoning_your_food_properly/", "html_title": "Reddit - The heart of the internet"}
{"title": "For the love of Julia Child, do something with your tortillas.", "selftext": "Let's start with a story.  About a decade ago, a friend invited me over for fajita night.  He had the skirt steak marinating for 12 hours and was in the process of firing up the charcoal grill.  \"Awesome, I'll make the pico de gallo and guacamole and be right over,\" which got him excited because he had had my guacamole before.  I got there just as he was pulling the meat and it smelled wonderful.  And then, he pulled the flour tortillas out of the fridge and started assembling the tacos.  \"Whoa, whoa, whoa.  Aren't you going to warm those tortillas up?\" I asked, and he said I could throw mine in the microwave if I wanted.  I grabbed the tortillas and tossed a few on the grill, flipping a couple of times until toasted, and told him to try one.   I swear I changed his culinary world.\n\nMy dad always said that the tortillas that we buy were only mostly cooked.  I am not sure I totally agree with that, but I do firmly believe that both corn and flour tortillas are vastly improved with a little heat treatment.  \n\nPart of that improvement comes from the fact that traditional flour tortillas are made with lard which is solid at room temperature.  Warming them up, \"melts\" the fat which makes them more pliable with a softer, moister mouth-feel.  Warming them in the microwave can accomplish this, but we can do even better.  Just as toasting can add depth to the flavor and texture of a slice of bread, so can it do the same for a tortilla.  In Mexican households, we have what is called a comal which is basically a heavy cast iron flat plate, and personally, mine never comes off the stove.  But you don't need one to do the job.  Any heavy pan big enough to hold the tortilla laying flat will do.  Pre-heat it over medium heat, toss a tortilla on it, and flip every 20-30 seconds.  As the tortilla heats, air pockets inside will expand and the parts that stay in contact with the pan will brown and get crispy.  If you have never had a flour tortilla done this way, please try it.  A good tortilla can outshine the filling when done right.  \n\nAs for corn tortillas, they are not made with any fat at all.  That is why I will always fry them in a bit of lard before eating.  If you don't keep lard in your kitchen, vegetable oil will do,  It doesn't take much fat, just enough to cover the bottom of the pan, also at medium heat.  You can lightly fry them until the edges start to brown a little for a flexible tortilla or until they blister for a shell that will be crunchy once it cools.  This is a must for tostada shells.  You can even take some aluminum foil and fold it into a taco shape that will stand up on its own upside down.  When you pull the tortilla, drape it over your taco form and it will harden into that shape as it cools.  No more buying Old El Paso pre-formed taco shells.  This method also works on an upside-down bowl for mini taco salad bowls.  You could also take a few and cut into quarters, lightly fry, and then scramble with eggs for a dish my family calls Migas.  But the best thing I do with a corn tortilla is fry one side and flip, put a heaping handful of shredded Monterey Jack chees on it, and fold in half.  Fry both sides until crunchy, salt, and enjoy a quesadilla that blows the ones at your local TexMex joint out of the water.  \n\nTortillas, both flour and corn, are absolutely essential to Mexican and TexMex cuisine.  They really deserve to be treated as more than a wrapper for something delicious.  When done right, they are the something delicious.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/rryoad/for_the_love_of_julia_child_do_something_with/", "created_utc": 1640860053.0, "score": 849, "author": "withouta3", "num_comments": 101, "permalink": "/r/cookingforbeginners/comments/rryoad/for_the_love_of_julia_child_do_something_with/", "html_title": "Reddit - The heart of the internet"}
{"title": "Been practicing stir fry for a while. Pretty happy with this.", "selftext": "", "url": "https://i.redd.it/r6eynvool8k31.jpg", "created_utc": 1567454572.0, "score": 846, "author": "None", "num_comments": 22, "permalink": "/r/cookingforbeginners/comments/cyu6q2/been_practicing_stir_fry_for_a_while_pretty_happy/", "html_title": ""}
{"title": "My first attempt at a Pork Katsu curry. Was very delicious", "selftext": "", "url": "https://i.redd.it/jy084yhrc4n31.jpg", "created_utc": 1568710690.0, "score": 844, "author": "XSilent_DevilX", "num_comments": 26, "permalink": "/r/cookingforbeginners/comments/d5e962/my_first_attempt_at_a_pork_katsu_curry_was_very/", "html_title": ""}
{"title": "My landlady doesn't want me to wash the pan in the sink after cooking - is this healthy?", "selftext": "My landlady doesn't want me to wash the pan in the sink after cooking because she says the oil clogs the drain. She normally throws the bits into the bin, then pours a new coat of cooking oil onto the pan and leaves it overnight. Is this healthy? I don't really like not washing the pan and cooking with leftover oil. How am I supposed to clean the pan if I'm not supposed to wash it?\n\nEdit: Am away right now, will be back in a couple of weeks and check what exactly the pan is. It's definitely a nonstick pan, probably a nonstick frying pan.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1alvhos/my_landlady_doesnt_want_me_to_wash_the_pan_in_the/", "created_utc": 1707398252.0, "score": 834, "author": "shastasilverchair92", "num_comments": 388, "permalink": "/r/cookingforbeginners/comments/1alvhos/my_landlady_doesnt_want_me_to_wash_the_pan_in_the/", "html_title": "Reddit - The heart of the internet"}
{"title": "Parsnip (\"Duolingo for cooking\") is in the wild! Help us make it better?", "selftext": "A couple years ago, Redditors on this sub came up with the idea of [building a Duolingo for cooking](https://www.reddit.com/r/cookingforbeginners/comments/hh1vdj/is_there_an_app_like_duolingo_to_help_with_cooking/).\n\n**A lot of blood, sweat, and tears later, you can now get** [**Parsnip in the App Store**](https://apps.apple.com/us/app/parsnip-level-up-your-cooking/id1592325213)**!**\n\nEDIT: if you're an Android user, you can also get [**Parsnip on Google Play**](https://play.google.com/store/apps/details?id=com.tapforce.parsnip).\n\nThis is an early release that may have some bugs, so please [come yell at us on Discord](https://discord.gg/P4qpxsJ6A8) if you find any. We'd love your help fixing them!\n\n&#x200B;\n\nParsnip's goal is eventually to allow anyone in the world to learn any cuisine, by making a [tech tree for all cooking skills](https://parsnip.substack.com/p/a-new-hope). Our goal is to [empower everyone to make delicious, wholesome food](https://parsnip.substack.com/p/why-now) and encourage change from food systems that are bad for people and bad for the planet.\n\n&#x200B;\n\nY'all have been an inspiration to us, and [we'd love to hear your thoughts](https://discord.gg/P4qpxsJ6A8) about the app and ideas about what to do next!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/vbgqq6/parsnip_duolingo_for_cooking_is_in_the_wild_help/", "created_utc": 1655139362.0, "score": 825, "author": "mizzao", "num_comments": 134, "permalink": "/r/cookingforbeginners/comments/vbgqq6/parsnip_duolingo_for_cooking_is_in_the_wild_help/", "html_title": "Reddit - The heart of the internet"}
{"title": "GOOEY Chocolate Chip Cookie Recipe (With cookie dough center!)", "selftext": "", "url": "https://i.imgur.com/StHLSDg.jpg", "created_utc": 1554994774.0, "score": 828, "author": "EmmasGoodies", "num_comments": 40, "permalink": "/r/cookingforbeginners/comments/bc0vn3/gooey_chocolate_chip_cookie_recipe_with_cookie/", "html_title": ""}
{"title": "Your food doesn't have to be traditional, optimized, photogenic, etc. to be good.", "selftext": "This is coming from a food-based content creator (for fun, I have no expectation of \"making it\"), so I know, pot meet kettle. But I've had to check my own mentality at times in my cooking journey, so I thought a reminder may be encouraging to those just getting into cooking.\n\nFood can be ugly and still be incredible. You can deviate from tradition when making something and still have a fantastic end result. You can go off the rails on recipes or make your own mad scientist type creations. Who gives a shit if it's not \"authentic\" or \"proper\" if it's good. And even if it's not good, you can learn from it and try again very soon because we have to eat or ya know, we'll die.\n\nFinally, don't do it for the 'gram unless you just enjoy food photography like me, and even if you do don't prioritize looks over taste. Yes we \"taste with our eyes\", that's a real thing, so make it pretty if you can/want. But I can assure you that some of the best dishes I've ever had look absolutely terrible when photographed. My family forcibly demands my chicken and drop-dumplings once a week and it looks like prison food.\n\nSo enjoy the nice pictures and fun videos of people cooking difficult, pretty, complex dishes. I do. But don't let the arms race of cooking media ever discourage you from getting into the kitchen, having fun, and sustaining yourself. I'm about to take another shot at recreating an exact replica of Taco Bell's chicken flatbread because damn it I miss that menu item and I don't care who judges me.\n\nAnd since I need a flair, here's a recipe for Raising Cane's sauce in hopes that I can cut down on the ridiculous traffic from people lining up into the street to get mediocre fried chicken on my town's main thoroughfare. Yeah I know I'm being a hypocrite, but come on, Zaxby's is right down the street and it's way better.\n\nCombine 2 parts mayo to 1 part Ketchup and add a bit of mustard. I prefer horseradish or dijon mustard but yellow works fine and gets a better color. I don't know if they actually use mustard, but I find that adding a small squeeze of it adds a lot to the sauce. Mix in a splash of worchestershire sauce along with pepper, onion powder, and garlic powder. Taste it and adjust to your taste. Adding a bit of salt is probably going to be necessary, but I like to do that last since the worchestershire sauce can bring a lot of sodium to the party. Personally, I like mine quite peppery.  Dip some buttered garlic toast in it and you have the best part of Cane's without having to go sit in the middle of the road holding everyone up to pay too much money for it.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kgwh30/your_food_doesnt_have_to_be_traditional_optimized/", "created_utc": 1608480195.0, "score": 814, "author": "southerngentleman90", "num_comments": 77, "permalink": "/r/cookingforbeginners/comments/kgwh30/your_food_doesnt_have_to_be_traditional_optimized/", "html_title": "Reddit - The heart of the internet"}
{"title": "Eggs Benedict I made for breakfast. My hollandaise didn't break, only issue was I added a bit too much hot water to thin it out before serving and should have left it a tiny bit thicker. How does it look? - more info below.", "selftext": "", "url": "https://i.redd.it/yob8zon3qgz31.jpg", "created_utc": 1574090635.0, "score": 820, "author": "makeupyourworld", "num_comments": 76, "permalink": "/r/cookingforbeginners/comments/dy4kk0/eggs_benedict_i_made_for_breakfast_my_hollandaise/", "html_title": ""}
{"title": "ALWAYS do this if you use tomato paste…", "selftext": "Sorry…That was a bit dramatic! 😅 I just wanted to share this tip I’ve been following like a religion lately. \n\nTomato paste is sweet. A touch tangy. Full of umami. And oh so delicious. It will give you the ability to add big flavor to a dish with little effort.⠀\n\nBut that’s not a guarantee. If you’re adding tomato paste straight to the liquid, you're missing out on flavor! \n\nSo here’s the trick. Always brown your tomato paste. Whether you cook it on its own or add it to a pan full of onions, celery, and carrots, give the paste and the fat-filled pan plenty of 1-on-1 time. You want to caramelize the tomato paste until it turns a deep red color. ⠀\n\nIf you’re cooking aromatic vegetables for the base of a sauce or soup, wait until they are almost done. And then add your tomato paste. Crank the heat up slightly and stir frequently so it doesn’t burn. You want to suck all the brightness out of it!⠀\n\nOnce it’s turned maroon, make sure to deglaze the pan with wine, stock, or even water. You’ll pick up all the flavor stuck on the bottom of the pan from the browned paste. #SaveTheFond\n\nDon’t use tomato paste? Maybe I can [convince you otherwise!](https://www.saltsearsavor.com/blog/tomato-paste)", "url": "https://www.reddit.com/r/cookingforbeginners/comments/q9zjor/always_do_this_if_you_use_tomato_paste/", "created_utc": 1634480162.0, "score": 816, "author": "saltsearsavor", "num_comments": 79, "permalink": "/r/cookingforbeginners/comments/q9zjor/always_do_this_if_you_use_tomato_paste/", "html_title": "Reddit - The heart of the internet"}
{"title": "egg, avocado, and rice. delicious 😋", "selftext": "", "url": "https://i.redd.it/m3b4h92kfko31.jpg", "created_utc": 1569341191.0, "score": 807, "author": "makeupyourworld", "num_comments": 20, "permalink": "/r/cookingforbeginners/comments/d8pa5u/egg_avocado_and_rice_delicious/", "html_title": ""}
{"title": "My first attempt at Fried Chicken 😋", "selftext": "", "url": "https://i.redd.it/2r7sp87dffp31.jpg", "created_utc": 1569716438.0, "score": 805, "author": "ZXXA", "num_comments": 28, "permalink": "/r/cookingforbeginners/comments/dao2uc/my_first_attempt_at_fried_chicken/", "html_title": ""}
{"title": "People with roommates, please learn food safety if you’re going to be sharing a kitchen and a fridge with other people.", "selftext": "I’ve been in college for three years now. I’ve had 8 different people live with me throughout my time here. What I’ve come to learn is that when people say they’re “very clean people” they’re either delusional or lying, and second, nobody my age seems to know food safety or take it seriously.\n\nAlmost everyone I’ve roomed with feels comfortable leaving leftovers on the table overnight or even for multiple days and still eating it.\n\nI’ve seen our rice cooker, which displays how long rice has been sitting in it, display more than 72 hours and my roommates are still eating it.\n\nRaw chicken uncovered on a paper plate in the fridge, 5 inches away from our Brita water pitcher.\n\nI’ve seen people chop raw meat on a cutting board, then use the same unwashed cutting board to slice their veggies that won’t be cooked.\n\nI see them wash chicken in the sink, then leave things to defrost in there or they store their cutting board in there and give it a quick rinse with only water before using it. This is especially disgusting. *Please* don’t ever assume your kitchen sink is clean and good for doing food prep.\n\nAt this point I have my own separate fridge and freezer because people don’t know how to be safe. Multiple roommates of mine have constant stomach problems and when I try to explain that they’re basically inviting bacteria in, they joke around and say something like “I can’t be killed don’t worry.”", "url": "https://www.reddit.com/r/cookingforbeginners/comments/10hf310/people_with_roommates_please_learn_food_safety_if/", "created_utc": 1674264176.0, "score": 807, "author": "cruskie", "num_comments": 120, "permalink": "/r/cookingforbeginners/comments/10hf310/people_with_roommates_please_learn_food_safety_if/", "html_title": "Reddit - The heart of the internet"}
{"title": "I don’t understand the mentality of the average user of this subreddit.", "selftext": "For example, if you took an average post from this subreddit, but submitted it to r/KitchenConfidential, then it would almost certainly deserve the heavy downvotes, because it’s a sub for PROFESSIONAL CHEFS. This is a subreddit for beginners… why be harsh with them? I see many comments of people asking genuine, great questions, that are downvoted. Why punish someone for wanting to learn? We all have to start somewhere. \n\n/rant", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1hu2qh3/i_dont_understand_the_mentality_of_the_average/", "created_utc": 1736068797.0, "score": 801, "author": "TheDanQuayle", "num_comments": 231, "permalink": "/r/cookingforbeginners/comments/1hu2qh3/i_dont_understand_the_mentality_of_the_average/", "html_title": "Reddit - The heart of the internet"}
{"title": "mac and cheese", "selftext": "", "url": "https://i.redd.it/h3kvxyy2rbw31.png", "created_utc": 1572722906.0, "score": 807, "author": "makeupyourworld", "num_comments": 17, "permalink": "/r/cookingforbeginners/comments/dqp355/mac_and_cheese/", "html_title": ""}
{"title": "PSA: do not use wet oven mitts", "selftext": "Just a quick reminder for anyone who doesn't know or has forgotten, so that you don't wind up like me. If a part of your oven mitts has gotten wet, it will not protect you from heat and you WILL burn your hands. This does not stand for rubber mitts, of course, but all the other ones. \n\nAlso, if you burn yourself do not put any type of ointment or lotion on the burn, as it traps in the heat. Run it under cold water to cool it down as quickly as possible. A nice ice pack after that helps with the constant burn thereafter. \n\nSafe cooking, friends. \n\nEdit: as someone mentioned, it's not advised to ice the burn. You can use a cool, wet compress. ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1ipzosx/psa_do_not_use_wet_oven_mitts/", "created_utc": 1739619952.0, "score": 803, "author": "Tay8641", "num_comments": 74, "permalink": "/r/cookingforbeginners/comments/1ipzosx/psa_do_not_use_wet_oven_mitts/", "html_title": "Reddit - The heart of the internet"}
{"title": "Lesson Learned: ALWAYS soak your rice. ALWAYS.", "selftext": "So I've read to rinse (optional) or soak(if you have time) and I have almost always skipped that step.\n\nWell recently I have not been wearing my contacts which makes everything up close bigger.  I was like \"I wonder what this dark spot is.\"\n\nIt was an insect.  My rice was FULL of insects.  After rinsing several times, I gave up and soaked it and they all came floating to the surface and don't tell my boyfriend because we have been eating rice bugs for years!!\n\n Not only is my soaked rice bug-free but it was also much more flavourful!!  I don't know why this is but the lesson you should learn here is always soak your rice before cooking!\n\nEdit: I am so glad I made this post, I have learned so much about rice!  Don't listen to me... read the comments or watch the linked videos!!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kl9fqh/lesson_learned_always_soak_your_rice_always/", "created_utc": 1609096497.0, "score": 798, "author": "rougecrayon", "num_comments": 203, "permalink": "/r/cookingforbeginners/comments/kl9fqh/lesson_learned_always_soak_your_rice_always/", "html_title": "Reddit - The heart of the internet"}
{"title": "Can anyone please help identify the baking/cooking items in the gif? Sadly, I could only ID the choux pastry :(", "selftext": "", "url": "https://i.imgur.com/JMw1Gil.gifv", "created_utc": 1562602488.0, "score": 800, "author": "TheCatWasAsking", "num_comments": 29, "permalink": "/r/cookingforbeginners/comments/can2hm/can_anyone_please_help_identify_the_bakingcooking/", "html_title": ""}
{"title": "This is about the third time I made Lasagna. I'm glad it turned out better than the previous attempts. Just needs more browning on the top.", "selftext": "", "url": "https://i.redd.it/icg80fj8hbs31.jpg", "created_utc": 1570976203.0, "score": 795, "author": "WhipsandPetals", "num_comments": 44, "permalink": "/r/cookingforbeginners/comments/dhb4be/this_is_about_the_third_time_i_made_lasagna_im/", "html_title": ""}
{"title": "Just some Nachos with a homemade cheese sauce.", "selftext": "", "url": "https://i.redd.it/ghzot874kdo31.jpg", "created_utc": 1569257993.0, "score": 791, "author": "fredw1975", "num_comments": 24, "permalink": "/r/cookingforbeginners/comments/d89bng/just_some_nachos_with_a_homemade_cheese_sauce/", "html_title": ""}
{"title": "I cooked a three course meal for my boyfriend's birthday and it went really well!!!", "selftext": "So I made a post a few weeks ago about being nervous to cook a three course meal for my partner's birthday. I would consider myself an intermediate cook but my nerves can really get the better of me in the kitchen.\n\nSo I was super nervous all day but I managed to pull it off!! Here was my menu:\n\nStarter: Salmon tartare with ciabatta bread\nLink:https://www.olivemagazine.com/recipes/fish-and-seafood/smoky-salmon-tartare-with-lemon-and-capers/\n\nMains: Herb-crusted, pan-fried lamb chops with roast carrots and parnsips, butterbean puree and a red wine sauce\nLink:https://www.ricardocuisine.com/en/recipes/8292-herb-crusted-lamb-chops\n\n\nDessert: Vanilla panna cotta with strawberry compote\nLink:https://www.bbcgoodfood.com/recipes/vanilla-panna-cotta\n\nI made every thing from scratch (P.S I had never made any of these dishes before) and I got a bit flustered getting the timings right for the mains hut the food was delicious. My boyfriend was really pleased and I've come away with renewed confidence in my cooking abilities.\n\nSo here's a post to say - set yourself that cooking challenge! Only good can come out of it, either you make a mistake and learn or you do really well and get a huge confidence boost :)\n\nTip: If you feel nervous at the time or in anticipation of cooking (I did) instead of giving in to those thoughts, tell yourself you're just excited!!! It can really change the way you feel and you can trick yourself into changing anxiety into a good feeling.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/l6ut04/i_cooked_a_three_course_meal_for_my_boyfriends/", "created_utc": 1611834683.0, "score": 786, "author": "xo_vanilla", "num_comments": 23, "permalink": "/r/cookingforbeginners/comments/l6ut04/i_cooked_a_three_course_meal_for_my_boyfriends/", "html_title": "Reddit - The heart of the internet"}
{"title": "homemade pizza!", "selftext": "", "url": "https://i.redd.it/6tk42njuhhx31.jpg", "created_utc": 1573228268.0, "score": 783, "author": "makeupyourworld", "num_comments": 42, "permalink": "/r/cookingforbeginners/comments/dth9ma/homemade_pizza/", "html_title": ""}
{"title": "Tip: After steak is finished cooking remove it from the pan to rest. Add water to the pan and stir until it reduces. Perfect steak sauce every time.", "selftext": "", "url": "https://i.redd.it/sq7761ww0q041.jpg", "created_utc": 1574639123.0, "score": 778, "author": "LostMyFucknPassword", "num_comments": 43, "permalink": "/r/cookingforbeginners/comments/e17364/tip_after_steak_is_finished_cooking_remove_it/", "html_title": ""}
{"title": "🌮 🌮", "selftext": "", "url": "https://i.redd.it/i4wlexdpb7i31.jpg", "created_utc": 1566567415.0, "score": 775, "author": "Neptunium96", "num_comments": 19, "permalink": "/r/cookingforbeginners/comments/cudzz3/_/", "html_title": ""}
{"title": "Garlic Confit just changed my whole life", "selftext": "I can't believe I've gone without garlic Confit my whole life.  It's so simple but it is just such a game changer!  The oil you get makes the most perfect garlic bread and goes great with any vegetables and those oily garlic cloves are heavenly.  For anyone else looking to have their mind blown, here's a super easy recipe I used:\n\n\n\n3 garlic bulbs, peeled to the cloves\n\n2 cups of olive oil (doesn't even matter if it's the cheap stuff, it's gonna taste amazing)\n\n\nThrow all of that in a saucepan on low low low heat for 20 minutes, or until you start seeing little bubbles start to come up in your oil.  Don't cook it so hot though that it starts to burn or carmalize the garlic.  \n\n\n\n\nAnd that's it!  I put the oil and garlic cloves directly on bread like butter and it tastes like the most mind blowing garlic bread.  I use the oil to cook spinach or really any veggie and you completely forget you're eating a vegetable.  If you're a garlic lover, it's a total game changer!!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/k6lbr1/garlic_confit_just_changed_my_whole_life/", "created_utc": 1607090196.0, "score": 769, "author": "hakanthebastard", "num_comments": 73, "permalink": "/r/cookingforbeginners/comments/k6lbr1/garlic_confit_just_changed_my_whole_life/", "html_title": "Reddit - The heart of the internet"}
{"title": "Jack-O-Lantern Quesadilla", "selftext": "", "url": "https://i.redd.it/o5bf6mpxrzr31.jpg", "created_utc": 1570834499.0, "score": 770, "author": "jennythepoohbear", "num_comments": 21, "permalink": "/r/cookingforbeginners/comments/dgmo8y/jackolantern_quesadilla/", "html_title": ""}
{"title": "My sister has a prestigious degree in culinary arts and is the head pastry chef at a high end restaurant. Here’s how she makes chocolate ganache", "selftext": "Take equal parts by volume heavy cream and high quality semi sweet(someone in the comments mentioned 60% or higher) chocolate pieces(so 1 cup to 1 cup, do not do this by weight). \n\n\nMicrowave for 15 seconds, stir until you start to see things melt, then switch to 10 second intervals, stirring for about 10 seconds in between intervals, until. Well about the third or fourth time it just turns into chocolate goop. Once the whole thing looks like chocolate, if there’s a few solids left, just keep stirring and the last little solids will melt, better to under for this than overdo it.\n\nTada!\n\nAs someone who was really intimidated by a recipe asking for ganache after years of watching GBBS, I couldn’t believe it’s actually this simple. I make it about once a month to top ice cream or drizzle on cakes. Thought you all would appreciate this simplification!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/xbnyht/my_sister_has_a_prestigious_degree_in_culinary/", "created_utc": 1662916346.0, "score": 769, "author": "kharmatika", "num_comments": 57, "permalink": "/r/cookingforbeginners/comments/xbnyht/my_sister_has_a_prestigious_degree_in_culinary/", "html_title": "Reddit - The heart of the internet"}
{"title": "Butchering that thirty second Indian egg sandwich that went viral on Reddit a week ago.", "selftext": "", "url": "https://i.imgur.com/7ePddvx.gifv", "created_utc": 1569603354.0, "score": 765, "author": "STylerMLmusic", "num_comments": 116, "permalink": "/r/cookingforbeginners/comments/da37vi/butchering_that_thirty_second_indian_egg_sandwich/", "html_title": ""}
{"title": "Fluffy Japanese Milk Bread ( SOFT Dinner Rolls )", "selftext": "", "url": "https://i.imgur.com/KsFQ5Oy.jpg", "created_utc": 1548342576.0, "score": 769, "author": "EmmasGoodies", "num_comments": 39, "permalink": "/r/cookingforbeginners/comments/ajdbcj/fluffy_japanese_milk_bread_soft_dinner_rolls/", "html_title": ""}
{"title": "First time making kimchi fried rice!", "selftext": "", "url": "https://i.redd.it/crpesijv1iv31.png", "created_utc": 1572363316.0, "score": 761, "author": "dogsfordayz", "num_comments": 23, "permalink": "/r/cookingforbeginners/comments/doric4/first_time_making_kimchi_fried_rice/", "html_title": ""}
{"title": "Drunk friend took my marinating chicken out of the fridge last night, 6 hours…is it safe?", "selftext": "So my chicken has been sitting out for about 6 hours. It was in the fridge in a bowl and covered. The marinade is buttermilk, hot sauce and then some spices like salt, pepper, onion&garlic powder, and cayenne pepper. \n\nI put it back in the fridge so I could clean up the rest of the mess left but is it safe to eat if I were to cook it? It’s a good $40 worth of chicken tenderloin and I’d hate to have to throw it out. \n\n#Edit: \n\nI threw it out. I was about to rip into my friend when they woke up when they hit me with \n\n“Hey that chip dip you made was a little spicy but it was good”\n\n“….what chip dip?” \n\n“You know, the one in that bowl that was covered” \n\n“….you mean the CHICKEN that was MARINATING?!” \n\n“Lmfaooo good one. No the chip dip!” \n\n“WE DONT HAVE ANY CHIP DIP”  \n\n“……oh god”\n\nNeedless to say, it was a great laugh for me and I got reimbursed for the chicken (they didn’t have that much, they’re doing fine and have not gotten sick as of 36 hours later). \n\n###See my reply to u/ pingmycraydar if you want the recipe to what I was making :) ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1ev98ip/drunk_friend_took_my_marinating_chicken_out_of/", "created_utc": 1723987667.0, "score": 765, "author": "None", "num_comments": 222, "permalink": "/r/cookingforbeginners/comments/1ev98ip/drunk_friend_took_my_marinating_chicken_out_of/", "html_title": "Reddit - The heart of the internet"}
{"title": "I just made these to help study all night", "selftext": "", "url": "https://i.redd.it/puzw9zspcmu31.jpg", "created_utc": 1571979536.0, "score": 758, "author": "DashExposeTheHoes", "num_comments": 67, "permalink": "/r/cookingforbeginners/comments/dmskhe/i_just_made_these_to_help_study_all_night/", "html_title": ""}
{"title": "I hope it’s ok to show off our first cooking attempts? I’m new to the sub and this is my first try cooking =]", "selftext": "", "url": "https://i.redd.it/dggmm5tkaje31.jpg", "created_utc": 1564968925.0, "score": 765, "author": "Hippie234", "num_comments": 28, "permalink": "/r/cookingforbeginners/comments/cm4kfb/i_hope_its_ok_to_show_off_our_first_cooking/", "html_title": ""}
{"title": "Learned to butcher the chicken, it was fun", "selftext": "", "url": "https://i.redd.it/a4674lf581z31.jpg", "created_utc": 1573903006.0, "score": 759, "author": "janex-PL", "num_comments": 57, "permalink": "/r/cookingforbeginners/comments/dx5o29/learned_to_butcher_the_chicken_it_was_fun/", "html_title": ""}
{"title": "Definitely the best steak I've made so far! (Sous vide then sear)", "selftext": "", "url": "https://i.redd.it/6pabpvftmgo31.jpg", "created_utc": 1569295205.0, "score": 749, "author": "ICantThinkOfAName945", "num_comments": 21, "permalink": "/r/cookingforbeginners/comments/d8hipz/definitely_the_best_steak_ive_made_so_far_sous/", "html_title": ""}
{"title": "PSA: DO NOT EVER use ChatGPT to generate recipes for food.", "selftext": "There's no guarantee that the recipe would taste good ---or even safe for human consumption! And this applys to all AI assistants, including ChatGPT, Claude, Bard, Character AI and so on. All AI assistants are based on LLMs that can suffer from hallucination, which meaning that the AI would generate text that looks very realistic but is fake.\nAccording to local news, a woman was hospitalized after following a recipe provided by ChatGPT that includes cooking pork. The cooking time provided by the AI was far too short, so the human following the recipe ended up with partially uncooked meat, and suffered from bacteria infection after consumption.\nSo, for your safety, do not ever use recipes provided by AI.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/147jc5e/psa_do_not_ever_use_chatgpt_to_generate_recipes/", "created_utc": 1686560634.0, "score": 748, "author": "Kyon2003", "num_comments": 256, "permalink": "/r/cookingforbeginners/comments/147jc5e/psa_do_not_ever_use_chatgpt_to_generate_recipes/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to Make Chicken Breasts Not Suck: A Complete Guide for Beginners", "selftext": "Dry. Chalky. Rubbery. Spongey. Crunchy. Bland. Tasteless. These are all common adjectives used to describe chicken breasts. But it doesn’t have to be this way. Chicken breasts can be juicy, delicate, and full of flavor, and I’m going to help you achieve that. \n\nThere are just four things you need to know, so this serves as the **TL;DR** for this very long post:\n\n1. Buy air-chilled\n\n2. Make cutlets\n\n3. Salt properly\n\n  a. Light flour coating\n\n4. Cook to the correct temperature\n\nAnd if you are so inclined, I will cover each of these in great detail below. \n\n## 1. Air-chilled\nI’m sure you’ve heard of the saying “garbage in, garbage out”, right? Keep that in mind as I explain this. \n\nIn the US, more than 95% of chickens are processed using a liquid-cooled solution^[1](https://www.bellandevans.com/healthy-living/chlorinated-chicken-concerns-europe-overreacting/). This means they are submerged in ice-cold chlorinated water, and after this, some are then injected with a salt water brine solution, sometimes referred to as broth. As a result of this process, the chicken retains some of that water. It is easy to identify this if you read the fine print on the packaging. See examples below:\n\n[Perdue brand, up to 1%](https://i.imgur.com/gBSVam6.jpg)\n\n[Tyson brand, up to 3%](https://i.imgur.com/Vj333Dw.jpg)\n\n[Perdue brand, up to 10%](https://i.imgur.com/eRMgQr7.jpg)\n\n[Walmart brand, up to ***15%!!***](https://i.imgur.com/IBhQILK.png)\n\n\nFrozen chicken breasts are most often the ones that are also injected (sometimes called enhanced) with a salt water brine, and usually contain up to 15% retained water^[1](https://i.imgur.com/itbyASa.png) ^[2](https://i.imgur.com/eZS9RaD.jpg)\n\nSo why does this matter? Put simply, it is diluting the chicken flavor and changing the texture. Also, the weight of the chicken you are buying is calculated after it is injected or cooled in a bath. That means you are paying chicken prices for this added salt water.\n\nAir-chilled chicken is just as it sounds. Instead of submerging the chicken in ice-cold chlorinated water, these chickens are essentially chilled in a massive refrigerator. This is actually more expensive for the manufacturers, so that translates to higher prices for consumers. At my local grocery store, air chilled chicken breasts are over 3x the cost of standard chicken breasts ($1.99/lb vs $6.69/lb). Whether or not that is worth it is up to you, but I can tell you that I will never go back to the cheap breasts again. Again, just check the labels. Anything that is air-chilled will be labeled as such. See [here](https://i.imgur.com/AgzIUgl.jpg), [here](https://i.imgur.com/0OT2Z5Z.png), and [here](https://i.imgur.com/p4PoL8u.jpg). \n\nWhat about organic chicken? Well, not all organic chicken is air-chilled, and not all air-chilled chicken is organic. I personally do not think *organic* air-chilled chicken is worth the extra cost (around $10/lb near me), it does not taste any better than non-organic *air-chilled* chicken, in my experience. Keep in mind that any company that is producing air-chilled chicken is likely more concerned about producing a quality product than a company that is using liquid cooling. \n\n## 2. Cutlets \nPart of the challenge when cooking chicken breast is having a tapered piece of meat that will always cook unevenly. This will result in the thin side being completely overdone when the thickest side is perfect. Or if the thin side is perfect, the thickest side is still raw. So the only way to combat this is to make the entire piece the same thickness. [Enter the cutlet](https://i.imgur.com/egyDjGE.jpg). \n\nYou will absolutely need a very sharp knife for this, but since that is arguably the #1 most important tool in the kitchen, it’s safe for me to assume that you already have one of those, right? I like to use a boning knife for this, but a chef’s knife will work. \n\nIf your chicken breasts have the tenderloin still attached, you will want to cut that off and cook it separately because it will create an air pocket, and sometimes things will not cook properly if it is still attached. [See here](https://youtu.be/2BeQftjYNO4?t=21). Just think of it as a bonus for the cook.\n\nNow this next step is sort of optional, but if you are working with very large breasts (around 7-9 ounces each), then I consider it mandatory. Use your very sharp knife that you most definitely already have, and slice that chicken breast in half *horizontally*. [See here](https://youtu.be/MrVIHL7JkTM?t=126). Alternatively, you can cut them in half *vertically* first, and then slice the thicker end in half horizontally. This will create smaller portions, if you would like, and it will be a bit easier to cut them horizontally. [See here](https://youtu.be/vp_fnC12UrQ?t=23).\n\nNow that you have your portions ready, you need to ensure they are all an even thickness by *gently* pounding them to about ¼”-½” thickness. Emphasis on gently because it is very possible to explode your chicken breasts. Lay some plastic wrap over the chicken cutlets and use a meat pounder or mallet on the thickest parts of the cutlets. The key is to create an even thickness, it doesn’t really matter how thick they actually are. You will see this process in the video I linked to above. If you do not have a meat pounder or mallet, you can use a small pot. \n\n## 3. Salt \nThis should be a very deliberate thing. Salt and savory cooking are a package deal. There should never be a time where you forget salt, because it should just be second nature to add salt to things that you want to taste good. Bland and lacking salt are synonymous. \nWhen it comes to cooking chicken (and meat in general), it should be even more deliberate. Salt not only enhances the flavor of our food, but in the case of chicken breast, it actually helps to retain much of the liquid that is lost during the cooking process, and creates more tender cooked chicken. [Here](https://www.seriouseats.com/2012/11/the-food-lab-the-truth-about-brining-turkey-thanksgiving.html) is a very thorough write-up if you want to read more about it. \n\nOn top of retaining more liquid, it obviously adds flavor, but it’s very easy to add too much, or too little. We’ve all heard that we should “salt to taste”, but there are some things where this doesn’t work very well, like salting your raw chicken breast before cooking it. Fortunately, the good folks at [Cook’s Illustrated have this figured out for us](https://www.cooksillustrated.com/how_tos/5681-salting-meat) (the formatting of that page seems to be broken currently). I can personally attest that the amount of salt listed in the aforementioned article is perfect, for my and my family’s tastes, you may want a bit more or a bit less. ¾ teaspoon of Diamond Crystal kosher salt per pound of boneless poultry is what they suggest. The brand of salt is also very important. If you aren’t already aware, 1 teaspoon table salt = 1 1/2 teaspoons Morton kosher salt = 2 teaspoons Diamond Crystal kosher salt^[1](https://www.cooksillustrated.com/how_tos/5799-salt-types-and-measurements)\n\nSo let’s look at a realistic example: Say you bought a package of fresh air-chilled chicken breast and the total weight listed on the package is 1.67 pounds. How much salt do you add? ***Edit: this part is not true!*** ~~Well, for starters, that weight is for the entire package of chicken, not just the meat you are going to be eating. Surprise! That’s right, grocery stores weigh the entire package when printing their labels, so you are paying for the packaging as well.~~ So if you start with a package that is 1.67 pounds, you can safely round down to 1.5 pounds, so that means 1.5 teaspoons of Diamond Crystal brand kosher salt, or ¾ teaspoon of any fine table salt. \n\n*When* you add the salt is also very important. Unlike spices and herbs, salt actually penetrates fully throughout the meat, and it does so at a rate that increases as the temperature increases. \n\nAssuming you have cutlets and pounded them thin, next you will want to sprinkle on the appropriate amount of salt, let it sit on a plate or baking sheet at room temp while you continue prepping the rest of your meal. Since this should be your first step, your chicken will only be sitting out for about 30 minutes at room temp, so it is perfectly safe. \n\nBecause salt is hygroscopic, it will begin to draw the moisture out of the chicken, which will in turn dissolve the salt, and then most of that salt water will be reabsorbed back into the chicken. You can actually watch this process happen if you take a close look at your salted chicken every 5 minutes or so. \n\nAt this point, feel free to take whatever creative measures you wish with any other spices or herbs. But the point should remain that salt is the #1 concern at this stage. In fact, a properly salted chicken breast will taste good without the addition of any other spices or herbs. I would even suggest that you try this first so that you can establish a baseline for what good chicken should taste like.\n\nNext, before cooking, there is one final semi-optional step. I say semi-optional because I think the only exception for skipping this is if you have Celiac disease or are counting calories. \n\n### 3a. Flour\n\nCoating your cutlets in a very light layer of flour will protect the outer surface of the chicken from the high heat and it prevents the edges of the chicken from becoming too dry. It really does wonders for the final product. You can see this process in one of the previous videos I linked to, [here](https://youtu.be/vp_fnC12UrQ?t=111). You only need a couple tablespoons of flour per breast, this is not fried chicken. Even if you have celiac disease or are gluten intolerant, I’m sure you could simply use alternative flours for this. \n\n## 4. Cook\n\nI think it’s important that we talk about temperature first. I think the #1 concern for most people about cooking chicken is that you ensure it is cooked thoroughly, as to kill off any salmonella that may be present. The FDA/USDA tells us that we should cook our chicken to 165F because that is the temperature that salmonella (and most other bad bacteria) are killed instantly at, and this just simplifies everything so that there is only one standard to remember, and it is safe for all types of immune systems. What they are not telling you is that bacteria (including salmonella) can be killed off by both temperature *and* time. This is how we pasteurize dairy products without cooking them. You hold them at very specific temperatures for very specific amounts of time. \n\nSo let’s talk about temperatures. Remember, 165F is the temp at which bacteria are killed *instantly*. Unfortunately, your chicken is damn near overcooked at this point. You can safely cook your chicken to 150F as long as it maintains a minimum of 150F for just 3 minutes. [This source](https://www.seriouseats.com/2015/07/the-food-lab-complete-guide-to-sous-vide-chicken-breast.html) has a very clear time and temperature chart for a reference, and all data comes from the same people that told you to cook to 165F. So once your chicken reaches a minimum of 150F in the thickest part (since you’ve presumably made evenly sized cutlets, there should be no drastically different “thickest part”), you want to pull it from the hot pan and let it sit on a plate (ideally a warmed plate) for at least 5 minutes. Remember to check the temperature in several different spots of the chicken so you can be sure. During the resting time, the temperature will actually rise a bit, thanks to carry over cooking, by about 2-5 degrees or so. Thicker cuts rise more, thinner cuts rise less. If it actually reaches 155F, then everything bad will have been killed off in less than 48 seconds. \n\nI will add a disclaimer here to say that if you are cooking for any children, elderly, pregnant women, or otherwise immunocompromised, cooking to 165F is always the safest option. \n\nSo if you haven’t figured this out yet, you will absolutely need a digital instant read thermometer. This isn’t something you can or should guess at. The thermometer is mandatory, it’s as simple as that. I can provide some good recommendations for different budgets if you would like.  \n\nI will always opt for pan frying in this case. I do not think baking thinly sliced chicken breasts with a light coating of flour will work well. In fact, this entire post is basically to discourage people from trying to bake their oversized chicken breasts in the oven. It’s just not a good method, for many reasons. We really need the high heat and direct contact of a skillet to achieve some browning. Browning things creates new flavors, it is important, and it should be something you are deliberately trying to achieve. \n\nI prefer a stainless steel pan for this, but cast iron will work as well. You want to pre-heat your pan over med-high heat with at least 2 tablespoons of oil in it. You will need slightly more oil than you would normally use, as the light coating of flour will soak up a good amount of the oil. Once that oil begins to shimmer and then you see the first wisps of smoke, it is time to add the chicken. \n\nWe are using a hard and fast cooking style. Since these cutlets are so thin, they will cook very quickly, so we want to achieve a deeply browned exterior before overcooking the middle, which is only possible over fairly high heat. \n\nSlowly lay down each cutlet into the hot oil so that you are moving your hand away from you, as to avoid any hot oil splashes. You should hear a hard sizzle almost immediately, this is a good sign. Most 12” skillets should be able to easily fit 3 cutlets at one time, maybe 4 depending on the size of chicken. This is also a good time to use a splatter screen, if you have one. \n\nAfter adding the chicken, you may want to turn the heat up to high, but be ready to turn it back down again if things get too dark, too quickly. Let the chicken cook undisturbed until the edges of the chicken begin to turn white. Then it’s time to start peaking at the bottom. It’s probably a good idea to rotate each cutlet 180 degrees so that they brown more evenly. You probably have some hotspots in your pan. Once each cutlet achieves a deeply browned surface on the one side, then flip it. If you notice the pan is rather dry when you flip it, add more oil to the spot that is dry. Now keep cooking the second side until you reach a minimum 150F internal temp. You should be more concerned about this temperature than you are about browning on the second side. Now pull each cutlet and transfer them to a warmed plate to rest for 5 minutes. \n\n## Bonus - Pan Sauces\nSo now that you have your pan-fried chicken cutlets resting, it’s a perfect opportunity to make a pan sauce. In fact, this cooking method is worth doing just for this opportunity alone. \n\nIf you didn’t use a nonstick skillet, you should now see a lot of [built up brown bits](https://i.imgur.com/M45PnAv.jpg), called fond, on the bottom of your pan. If you did use a nonstick skillet, well, then no fond for you! If the fond looks black and burnt, your heat was too high for too long, and you should skip this step. \nPut your pan back on the heat, medium heat is fine. Get your fond hot, and before it starts to darken, you need to add liquid. You can simply add water, but chicken stock is a better option. If you have it, some white wine along with the water or stock is also a great idea. How much? It doesn’t really matter. Maybe enough so that it’s at least ⅛” deep. Now, bring it to a simmer, and use a flat wooden spoon and start scraping all of that fond up until the bottom of the pan is completely clean. Once you’ve achieved that, let it simmer until it’s reduced slightly. The residual flour in the pan should help thicken the sauce ever so slightly. It’s easy to over reduce at this point, since you are using a wide and shallow pan, so take it off the heat as soon as it’s where you want it. \n\nAt this point, you just need to stir in 1-2 tablespoons of butter and then give it a taste. Add salt until it tastes good. That’s about as simple as you can go, or you can do any of the following to make it even better\n\n* Before adding the liquid, add 1 tablespoon of flour to the fond and cook over medium heat for about 1 minute, or until the flour begins to toast. This will add more flavor and more body to the pan sauce.\n\n* Along with the flour, add 1 tablespoon of tomato paste, and cook until the tomato paste turns rust colored. This adds even more flavor. \n\n* To your cold water or boxed stock, sprinkle on a packet of unflavored gelatin and allow it to bloom for a couple minutes before adding to the hot pan. This adds more body to your pan sauce. You don’t need to do this if you are using homemade stock. \n\n* Before adding the liquid, add some minced shallots and a bit of oil to the hot pan and cook for a couple minutes.\n\n* After adding the butter, whisk in some fresh lemon juice and capers or dijon mustard. The addition of acid is almost always a good idea. \n\n---\n\nLastly, a message to all of the chicken thigh cult members out there, because I know that you are a passionate bunch. I, too, love chicken thighs. This post is not meant to spark a debate between white meat and dark meat, this is simply meant to help those that have not had any success making delicious chicken breasts.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/meeyvo/how_to_make_chicken_breasts_not_suck_a_complete/", "created_utc": 1616855739.0, "score": 749, "author": "96dpi", "num_comments": 47, "permalink": "/r/cookingforbeginners/comments/meeyvo/how_to_make_chicken_breasts_not_suck_a_complete/", "html_title": "Reddit - The heart of the internet"}
{"title": "I feel like this is extremely appropriate here. Also, don't pour water on a grease fire!", "selftext": "", "url": "https://i.imgur.com/5kMUNjO.gifv", "created_utc": 1539198016.0, "score": 751, "author": "Bondi76", "num_comments": 30, "permalink": "/r/cookingforbeginners/comments/9n2dzn/i_feel_like_this_is_extremely_appropriate_here/", "html_title": ""}
{"title": "Accidentally bought sliced ham rather than bone in ham. What now?", "selftext": "I was going to bake a ham for Christmas for the first time. I found instructions and decided I could handle it. I was just going to glaze the ham and throw it in the oven. I just got back from the grocery store and realized I bought sliced ham rather than bone-in ham. Can I still glaze the sliced ham? Originally, I was going to bake the ham for roughly 1.5 hours at 300°F. What alterations should I make if I can glaze the sliced ham? If I can't go with plan A, what are my other options?\n\nGlaze ingredients: brown sugar, maple syrup, honey, and Dijon mustard.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/18p6dxk/accidentally_bought_sliced_ham_rather_than_bone/", "created_utc": 1703340379.0, "score": 744, "author": "None", "num_comments": 97, "permalink": "/r/cookingforbeginners/comments/18p6dxk/accidentally_bought_sliced_ham_rather_than_bone/", "html_title": "Reddit - The heart of the internet"}
{"title": "My first try at a French Omelette. Any tips?", "selftext": "", "url": "https://i.redd.it/d0cdev9fo9y31.jpg", "created_utc": 1573569473.0, "score": 747, "author": "makeupyourworld", "num_comments": 40, "permalink": "/r/cookingforbeginners/comments/dvat9p/my_first_try_at_a_french_omelette_any_tips/", "html_title": ""}
{"title": "Accidentally used cornstarch (and too much of it) on fried chicken", "selftext": "I got home today to my roommate sobbing because she accidentally used cornstarch instead of flour on fried chicken and she was cooking for about 10 people thus the crying. I tried one thinking it might not be too bad but it tastes like chalk and is really bland so we’re wondering if there was a way to undo all this or maybe use it for another recipe? \n\nThanks!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/18w62fx/accidentally_used_cornstarch_and_too_much_of_it/", "created_utc": 1704141527.0, "score": 740, "author": "dandelioness_", "num_comments": 145, "permalink": "/r/cookingforbeginners/comments/18w62fx/accidentally_used_cornstarch_and_too_much_of_it/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is a rice cooker worth it? I make rice twice a week.", "selftext": "If yes what one do you use and how much did you spend?", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1dwaf04/is_a_rice_cooker_worth_it_i_make_rice_twice_a_week/", "created_utc": 1720218719.0, "score": 740, "author": "LoversBiChoice", "num_comments": 1003, "permalink": "/r/cookingforbeginners/comments/1dwaf04/is_a_rice_cooker_worth_it_i_make_rice_twice_a_week/", "html_title": "Reddit - The heart of the internet"}
{"title": "Why did the mushrooms at this restaurant taste so good?", "selftext": "I'm am a complete beginner, so this may be very obvious. I've never been a mushroom person, but I went to a restaurant and got a veggie quesadilla. The menu lists the ingredients as the following: spinach, pico de gallo, mushrooms, and cheese. The mushrooms tasted very good. Almost like I remember meat tasting like (but take that with a grain of salt, I barely have eaten meat in over 3 years). I remember them being wet, almost like covered in an oil? As this was maybe the second time tasting mushrooms in my life, I thought that maybe they just tasted that way. So I made a pizza and put canned sliced mushrooms from Walmart on it. It was not good. It didn't taste anything like I remember meat tasting. I also tried Campbell's Cream of Mushroom soup and it didn't taste right either.\n\nSo any clue what they did to the mushrooms? This might be super obvious, but as I said complete beginner cook here.\n\nEdit: I've gotten so many great responses and ideas from you all. Thank you!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1atisq2/why_did_the_mushrooms_at_this_restaurant_taste_so/", "created_utc": 1708221689.0, "score": 744, "author": "2460_one", "num_comments": 500, "permalink": "/r/cookingforbeginners/comments/1atisq2/why_did_the_mushrooms_at_this_restaurant_taste_so/", "html_title": "Reddit - The heart of the internet"}
{"title": "Grilled Chicken over Linguine with Garlic and Lemon, and a Caesar Salad with homemade dressing, freshly ground pepper, homemade basil croutons, and Parmigiano Reggiano.", "selftext": "", "url": "https://i.redd.it/fq2ds1b0tzu31.png", "created_utc": 1572142403.0, "score": 739, "author": "makeupyourworld", "num_comments": 40, "permalink": "/r/cookingforbeginners/comments/dnnd87/grilled_chicken_over_linguine_with_garlic_and/", "html_title": ""}
{"title": "Please don’t upvote, just wondering does naan work better as a wrap or do I slice it open and stuff it?", "selftext": "Like with pita where you stuff it.. This would be for chicken and salad\n\nEdit: ignore the title, please upvote ⬆️\n\nEdit 2: [The naan tacos](https://m.imgur.com/a/qjegeHy)", "url": "https://www.reddit.com/r/cookingforbeginners/comments/maa5vq/please_dont_upvote_just_wondering_does_naan_work/", "created_utc": 1616372456.0, "score": 738, "author": "pretendstoknow", "num_comments": 62, "permalink": "/r/cookingforbeginners/comments/maa5vq/please_dont_upvote_just_wondering_does_naan_work/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to wash rice completely?", "selftext": "Every recipe I use says to wash the rice. Well there are always soap bubbles left behind OR it takes ages to clean properly. I usually use Dawn dish soap, but I’m thinking of skipping it next time unless there is a way to get the soap bubbles. Is there another product you guys recommend??\n\n\n**edit day 2** the amount of attention this has received has me sweating about what other things I could be doing potentially wrong and thinking that it’s normal….", "url": "https://www.reddit.com/r/cookingforbeginners/comments/xx9yti/how_to_wash_rice_completely/", "created_utc": 1665074802.0, "score": 727, "author": "agreementloop184", "num_comments": 278, "permalink": "/r/cookingforbeginners/comments/xx9yti/how_to_wash_rice_completely/", "html_title": "Reddit - The heart of the internet"}
{"title": "Accidentally froze my Dutch oven 🧍🏻‍♀️", "selftext": "Just like the title says, I accidentally froze my Dutch oven today, with soup in it. \nI had just finished cooking and threw it outside to cool down with the intent of bringing it it to package once I fed my baby, but I got nap trapped, and now I can lift my pot by the lid 🙃\nBasically two questions. \n1- did I just like?? Destroy my brand new cookware?\n2- this is probably silly to even ask, but I can just throw it on low on a burner to thaw right?", "url": "https://www.reddit.com/r/cookingforbeginners/comments/198em9j/accidentally_froze_my_dutch_oven/", "created_utc": 1705440800.0, "score": 725, "author": "Frogsand_such", "num_comments": 134, "permalink": "/r/cookingforbeginners/comments/198em9j/accidentally_froze_my_dutch_oven/", "html_title": "Reddit - The heart of the internet"}
{"title": "me and gf were eating meat and she cut the meat while it was in the pan, theres a couple shallow knife marks on it now, is it still safe to use?", "selftext": "Like the title says, me and gf were having a spread of foods for lunch and she cut the pan the meat was on, I was able to stop her cause I heard its not good for the pan before but im worried is it bad to use now? theres only a couple very shallow knife marks but I don't want to use it if it will kill us, what do youthink?\n\nedit: checked the bottom and is said farberware nonstick cookware, looks like I must replace it soon then ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/18htmew/me_and_gf_were_eating_meat_and_she_cut_the_meat/", "created_utc": 1702507858.0, "score": 722, "author": "None", "num_comments": 544, "permalink": "/r/cookingforbeginners/comments/18htmew/me_and_gf_were_eating_meat_and_she_cut_the_meat/", "html_title": "Reddit - The heart of the internet"}
{"title": "i'm working with very limited space and tools here today! a very wide pan and yes i scrambled the omelette with a plastic spoon. it ALMOST broke but it managed to come out of the pan in one piece. turkey, mozz, + spinach omelette with whole wheat toast, coffee, and some yummy tomatoes.", "selftext": "", "url": "https://i.redd.it/ykj6ilvb9cr31.jpg", "created_utc": 1570549782.0, "score": 722, "author": "makeupyourworld", "num_comments": 22, "permalink": "/r/cookingforbeginners/comments/df1tz2/im_working_with_very_limited_space_and_tools_here/", "html_title": ""}
{"title": "Flatbread doesn't have to be complicated, and you probably have what you need to make it.", "selftext": "In fact, all you really need to make a basic flatbread is flour, water, and salt. Even the salt isn't necessary really. Hell, you don't even need a bowl or a spoon. You can make a pile of flour on your counter (cleaned counter I hope), make a little well in the center, and slowly mix in water with your hands until it forms a dough. Then squish it and toss it on a hot surface and you've got a basic flatbread that could be made on a rock in the woods with no tools other than the means to make fire.\n\nNow that we've gone to the extreme end of simplification and removed the mystery of making probably the world's oldest bread product, I'll go into a leavened version that is only a tiny bit more complex, but will yield fluffy, chewy flatbreads with those characteristic air pockets.\n\n&#x200B;\n\nNote: These amounts are mostly a guideline, not a hard and fast rule. Think of it as a starting point, in no time you won't even need to get near a measuring cup to make it.\n\n**Ingredients**\n\n2 cups all-purpose flour\n\n1 1/2-2 teaspoons baking powder\n\nA pinch of salt\n\n3/4 cup of water\n\n1 tablespoon of oil\n\n**Instructions**\n\nIf you want to get fancy, use a bowl. For the record though, you can absolutely make this using the pile of flour method if you want. That counter's gonna get flour on it anyway so why not.\n\nMix together flour, baking powder, and salt. If you'd like to flavor it up with other seasonings (garlic powder for example) add it now.\n\nAdd the water a small amount at a time and begin mixing together by hand, or with a spoon, or a stick or something.\n\nOnce a rough dough begins to form, add the olive oil and mix by hand until a cohesive ball has formed. Add flour/liquid if needed during this process. We want dough that is pliable, but not too sticky.\n\nDust the counter (for the love of god make sure it's clean first) with flour and plop that dough boy on there. Knead the dough for a few minutes until it slowly springs back when you poke it.\n\nNow we will portion it into balls somewhere between golf ball and baseball sized. A bench scraper is ideal for this, but I use an old, dull knife to separate into chunks.\n\nMake the dough flat. My favorite way to do this is by gently pressing it out with my fingertips until it is about 1/4 inch thick, occasionally picking it up by the edges to stretch it out. I find that by hand-working the dough, we preserve more of the gluten structure formed from the kneading process. You can also roll it out with a rolling pin, can of beans, beer bottle, whatever. It'll still be very good, just make sure it's flat.\n\nHeat a skillet to medium-high, using a bit of cooking spray if you feel it may get sticky (totally optional). Slap a flat-dough on there and watch it bubble up for a minute or two. Once the underside has gotten nice and browned and it's puffed up a bit, gently flip and cook for another minute or two, until the bubbles on the bottom have browned up. After flipping I like to mush it down very gently with the spatula to slightly even out the browning, but honestly I mostly do that cause it's fun.\n\nAs flatbreads finish cooking, place them in a stack on a plate and cover them with a towel. The residual heat will slightly steam them, making them soft and pliable.\n\nEnjoy with wraps, curry, or topped with softened butter.\n\n&#x200B;\n\nEdited to add the cost breakdown (sorry for the crappy formatting, I couldn't sleep so I just threw this together to illustrate how cheap it is:\n\n \n\nFlour: 10lb for 2.24   -   $0.45\n\nOlive Oil: 93 tbsp for 15.88   -   $0.17 for recipe\n\nWater: 24 pack for 9.94   -  $0.45  for recipe (with some left over to drink) \n\nKosher salt: 3 pounds for 16.99 (Diamond Crystal)   -  $0.02 for recipe\n\nBaking powder: 22 oz for 5.28   -   $0.02 for recipe\n\nTotal cost for 4 flatbreads: $1.11\n\n&#x200B;\n\nGuys and gals, that's a buck for a pile of flatbread and a lot of experience working with dough. Plus, as you can see, I was even being extravagant on the price by using bottled water and a mid-priced bottle of olive oil. I don't actually even cook with bottled water and you can use oil that is cheaper to still get great results. Realistically if you're using tap water, I see the cost of this being more like 75 cents.\n\nSo there it is if you needed more incentive. About a dollar (probably less) and you can get more familiar with making bread, plus the end result is fresh flatbread for 2-3 people.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/jfzw47/flatbread_doesnt_have_to_be_complicated_and_you/", "created_utc": 1603374286.0, "score": 718, "author": "southerngentleman90", "num_comments": 51, "permalink": "/r/cookingforbeginners/comments/jfzw47/flatbread_doesnt_have_to_be_complicated_and_you/", "html_title": "Reddit - The heart of the internet"}
{"title": "One BIG REASON You Should Learn To Cook People Are All Of A Sudden Scared To Talk About", "selftext": "Maybe because it conjures up images of a sleazy French man cooking for a naive American girl or people are obsessed with gender roles in society and that women should no longer be expected to sign up for a lifetime of prepping meals for their husbands (I don't think they should for the record) but it is time to address cooking as a serious dating tool.\n\nI'm not talking about men or women, or trying to get laid.  I'm talking about your actual value as a human being for another human being.\n\nSomewhere between money, lifestyle and status people forget that relationships are built in the trenches.  You often fall in love with someone because they make you chicken soup when you're sick or prepare a decent rigatoni the first time they meet your parents or your friends can't believe they woke up early to make everyone crepes on a hungover Sunday.\n\nThe ability to cook is a serious attribute. Much like the ability to make someone laugh is a serious attribute. Much like showing up on time and being reliable when sh\\*t hits the fan is a serious attribute.\n\nSo why learn to cook? I mean, really put time and effort into learning how to cook?\n\nBecause then you can host and hosting will open more social doors for you than you'll ever imagine.  You can be mediocre by all accounts and you obliterate loneliness by simply saying \"Hey I'm making a big dinner tonight come by and bring your friends\" (people rarely turn down a free meal especially in their 20's).\n\nAll I'm trying to say is learning to cook for yourself is motivation but you'll be surprised how much more motivating it is to learn to cook so you can make other people happy.\n\nIn 2023, between between Door Dash and and the Chipotle-fication of restaurants you don't NEED to know how to cook like you did out of necessity in 1965.  Which is why it has become a scarce resource and scarce resources are always valuable.\n\nPS: Please share your thoughts and stories!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/10v9rk3/one_big_reason_you_should_learn_to_cook_people/", "created_utc": 1675698258.0, "score": 723, "author": "ReggieMilligan", "num_comments": 182, "permalink": "/r/cookingforbeginners/comments/10v9rk3/one_big_reason_you_should_learn_to_cook_people/", "html_title": "Reddit - The heart of the internet"}
{"title": "We did cast Iron deep dish pizza for the first time. Never even had deep dish before. I loved this pizza with all my heart.", "selftext": "", "url": "https://i.redd.it/aytfbx1sz2k31.jpg", "created_utc": 1567386672.0, "score": 720, "author": "Dereleik", "num_comments": 17, "permalink": "/r/cookingforbeginners/comments/cyiabo/we_did_cast_iron_deep_dish_pizza_for_the_first/", "html_title": ""}
{"title": "Is this picture tahini? The lady at the store said this was it when I was looking for it, but it’s green :/", "selftext": "I thought it was supposed to be beige/brown.. I’m halfway through making my hummus and nervous and hoping I bought the right thing \nIt looks like a cucumber https://imgur.com/gallery/wSUnXL9\n\nEdit: everyone is cracking up and I want to add a little bit more info for the lulz: I totally thought it could be tahini, because I was like “well maybe I just have to skin it, and then when blended the color will come out more!” 😭😭😭 sooo innocent hahah", "url": "https://www.reddit.com/r/cookingforbeginners/comments/ger4q6/is_this_picture_tahini_the_lady_at_the_store_said/", "created_utc": 1588794662.0, "score": 713, "author": "fucknans", "num_comments": 75, "permalink": "/r/cookingforbeginners/comments/ger4q6/is_this_picture_tahini_the_lady_at_the_store_said/", "html_title": "Reddit - The heart of the internet"}
{"title": "I cooked risotto as the first meal I've ever cooked on my own (18)", "selftext": "", "url": "https://i.redd.it/i7jci596c7k31.jpg", "created_utc": 1567439269.0, "score": 720, "author": "Rock_Blocker", "num_comments": 33, "permalink": "/r/cookingforbeginners/comments/cyqoiw/i_cooked_risotto_as_the_first_meal_ive_ever/", "html_title": ""}
{"title": "What are some easy depression meals?", "selftext": "I'm looking for something **on the level of pasta or scrambled egg**, it can be cooking or baking.\n\nWhenever I look online for easy, quick recipes, it gives me things like \"cut this chicken into 8 circular pieces and season with salt, pepper, thyme, cumin, oregano, and lime-avocado extract, then simmer in sautéed béchamel with hand-plucked watercress\"... I don't want any of that.\n\nI need recipes that are\n\n**-** **easy and foolproof**  \n**- not requiring me to do 3 things at once,** or even 3 things at all  \n**- quick** (less than 1h) because I often forget I'm hungry for hours and then need food urgently  \n**- not requiring 10 expensive ingredients** that will spoil in the fridge (single person household)  \n**- vegetarian**\n\nIn 2023, I am done lying to myself that I can learn how to cook - and have the motivation to cook - complex meals with five different components. I've tried many times and it's just not gonna happen, let alone on a regular basis. So I want to find some more realistic recipes for every day.\n\nThanks in advance for any tips!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/101kc1s/what_are_some_easy_depression_meals/", "created_utc": 1672685664.0, "score": 709, "author": "Outrageous_Fish99", "num_comments": 371, "permalink": "/r/cookingforbeginners/comments/101kc1s/what_are_some_easy_depression_meals/", "html_title": "Reddit - The heart of the internet"}
{"title": "First try at a roast Turkey on my own", "selftext": "", "url": "https://i.redd.it/arjcbn6wi6o31.jpg", "created_utc": 1569172814.0, "score": 705, "author": "mclibby33", "num_comments": 34, "permalink": "/r/cookingforbeginners/comments/d7tgy3/first_try_at_a_roast_turkey_on_my_own/", "html_title": ""}
{"title": "Since I established my cakes never seem to rise, I made scones this time. They look pretty good!", "selftext": "", "url": "https://imgur.com/ysatNFo", "created_utc": 1550874085.0, "score": 708, "author": "KasperAura", "num_comments": 29, "permalink": "/r/cookingforbeginners/comments/atnpgc/since_i_established_my_cakes_never_seem_to_rise_i/", "html_title": ""}
{"title": "Creating an app to learn how to cook from the ground up?", "selftext": "I was thinking about creating a cooking app for absolute beginners, I was thinking of structuring it like Duolingo and there would be interactive lessons where you'd start off assuming 0 cooking knowledge and building up your skill level from making scrambled eggs to cooking tuna etc. Is this something anyone would be interested in me building?\n\nEDIT: What would you guys like to see in an app that helps out beginner cooks? Is there anything I can add or do that makes the experience easier? ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/lwfgw9/creating_an_app_to_learn_how_to_cook_from_the/", "created_utc": 1614727464.0, "score": 691, "author": "WinterAbroad5", "num_comments": 73, "permalink": "/r/cookingforbeginners/comments/lwfgw9/creating_an_app_to_learn_how_to_cook_from_the/", "html_title": "Reddit - The heart of the internet"}
{"title": "Glazed Lemon Cake Squares Recipe", "selftext": "", "url": "https://i.imgur.com/GLUW63o.jpg", "created_utc": 1553785926.0, "score": 700, "author": "EmmasGoodies", "num_comments": 23, "permalink": "/r/cookingforbeginners/comments/b6jz6w/glazed_lemon_cake_squares_recipe/", "html_title": ""}
{"title": "My roommate's dishes always taste bland while mine are flavorful even when using the same recipe", "selftext": "My roommate and I are both learning to cook, and we often follow the same online recipes. The weird thing is, even when we make the exact same dish with the same ingredients, my version comes out flavorful while hers is consistently bland and underwhelming.\n\nWe've been trying to figure out what's causing this difference. We shop at the same grocery store, use the same pots and pans, and even measure ingredients together sometimes. The only real difference I can spot is in our cooking techniques.\n\nI've noticed that when I cook, I tend to:\n\n* Let the onions and garlic properly brown before adding other ingredients\n* Season throughout the cooking process instead of all at once\n* Taste and adjust seasonings multiple times\n* Let meat properly sear before adding liquids\n* Use higher heat for certain steps\n\nMy roommate tends to rush these steps adding everything at once, not letting things brown properly, and only seasoning at the end. She also doesn't taste and adjust as she goes.\n\nI feel bad because she gets discouraged when we compare our dishes, but I'm not sure how to explain what might be happening without sounding condescending. We're both beginners trying to learn together.\n\nIs timing and technique really that important compared to just following the ingredient list? Any advice on how I could help her improve without making her feel bad?\n\n(And no, it's not about different taste preferences even she admits my version of the same recipe tastes better!)", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1jqyo9v/my_roommates_dishes_always_taste_bland_while_mine/", "created_utc": 1743725923.0, "score": 698, "author": "clammyanton", "num_comments": 176, "permalink": "/r/cookingforbeginners/comments/1jqyo9v/my_roommates_dishes_always_taste_bland_while_mine/", "html_title": "Reddit - The heart of the internet"}
{"title": "made hot wings for dinner tonight", "selftext": "", "url": "https://i.redd.it/213hex75v6u31.png", "created_utc": 1571792329.0, "score": 689, "author": "makeupyourworld", "num_comments": 11, "permalink": "/r/cookingforbeginners/comments/dlro7q/made_hot_wings_for_dinner_tonight/", "html_title": ""}
{"title": "Breakfast burritos with egg, sausage, potatoes and cheese!", "selftext": "", "url": "https://i.redd.it/7nsbh19mlpu31.png", "created_utc": 1572018849.0, "score": 688, "author": "itxb3n", "num_comments": 28, "permalink": "/r/cookingforbeginners/comments/dmzdya/breakfast_burritos_with_egg_sausage_potatoes_and/", "html_title": ""}
{"title": "Don't you think that way too many online recipes uses way too many ingredients?", "selftext": "Even recipes advertised for simplicity often use tons of ingredients that you would need a lot of work to collect. Or perhaps there are some places where you can get seriously simple reciples. Any recommendations?", "url": "https://www.reddit.com/r/cookingforbeginners/comments/nallnz/dont_you_think_that_way_too_many_online_recipes/", "created_utc": 1620815843.0, "score": 683, "author": "placek3000", "num_comments": 108, "permalink": "/r/cookingforbeginners/comments/nallnz/dont_you_think_that_way_too_many_online_recipes/", "html_title": "Reddit - The heart of the internet"}
{"title": "My first time making steak after I got a non-stick pan", "selftext": "", "url": "https://imgur.com/vS5XbxP", "created_utc": 1555245576.0, "score": 685, "author": "TheCrimsonSage", "num_comments": 78, "permalink": "/r/cookingforbeginners/comments/bd2cg3/my_first_time_making_steak_after_i_got_a_nonstick/", "html_title": ""}
{"title": "I made oatmeal chocolate chip cookies using the pulp leftover from making oat milk!", "selftext": "", "url": "https://i.redd.it/8xe75pyt2tg31.jpg", "created_utc": 1565959086.0, "score": 675, "author": "whenthereisfire", "num_comments": 17, "permalink": "/r/cookingforbeginners/comments/cr5s2v/i_made_oatmeal_chocolate_chip_cookies_using_the/", "html_title": ""}
{"title": "Do food bloggers realize how awful their recipe pages are?", "selftext": "The pop up ads that block readers from VIEWING the content... the lengthy and unnecessary stories... the effort it takes to get to the damn recipe!\n\nDon’t food bloggers realize how bad their sites are?? Maybe the perks of pay from ads and such is just the purpose, but I can’t imagine they have an audience coming back for more if their page is such a pain in the a**\n\nAny food bloggers have some insight into reasoning? And do they take into account reader satisfaction? Genuinely curious...", "url": "https://www.reddit.com/r/cookingforbeginners/comments/nyk719/do_food_bloggers_realize_how_awful_their_recipe/", "created_utc": 1623542497.0, "score": 680, "author": "BeansinmyBelly", "num_comments": 117, "permalink": "/r/cookingforbeginners/comments/nyk719/do_food_bloggers_realize_how_awful_their_recipe/", "html_title": "Reddit - The heart of the internet"}
{"title": "Tomato and cheese gnocchi", "selftext": "", "url": "https://i.redd.it/tbumizidlej31.jpg", "created_utc": 1567091262.0, "score": 674, "author": "Dynamicfresh84", "num_comments": 19, "permalink": "/r/cookingforbeginners/comments/cx261i/tomato_and_cheese_gnocchi/", "html_title": ""}
{"title": "HelloFresh teaches you how to cook", "selftext": "I just turned 60 and I’ve been a terrible cook my whole life. I just don’t have a “feel” for it at all. \nRecently, I signed up for HelloFresh. They send you the ingredients for two or four meals a week. You have to clean and chop the ingredients, and then cook the meal yourself —with their step-by-step recipe cards to assist. \nIt has been a revelation. With each dish of theirs that I cook, I can easily figure out how to adapt it for my own means. I’ve always struggled figuring out how to cook meat, and with HelloFresh I see that I was trying to make it more difficult than it really is.\nEvery time I make a dish, I make some notes on their big recipe card, which I keep.\nAnyway, just a suggestion. Using HelloFresh has taught me more about how to cook than probably anything else I’ve tried, including videos. \n\n[no, I do not work for hellofresh. After I get tired of HelloFresh, I’m going to try some of the other meal prep services like Blue Apron and Home Chef.]", "url": "https://www.reddit.com/r/cookingforbeginners/comments/o0x0zm/hellofresh_teaches_you_how_to_cook/", "created_utc": 1623819180.0, "score": 673, "author": "karmaapple3", "num_comments": 132, "permalink": "/r/cookingforbeginners/comments/o0x0zm/hellofresh_teaches_you_how_to_cook/", "html_title": "Reddit - The heart of the internet"}
{"title": "First time making dumplings from scratch incl the wrappers", "selftext": "", "url": "https://i.redd.it/cpja88v9num31.jpg", "created_utc": 1568593156.0, "score": 668, "author": "ExploringEarth", "num_comments": 13, "permalink": "/r/cookingforbeginners/comments/d4t0cq/first_time_making_dumplings_from_scratch_incl_the/", "html_title": ""}
{"title": "Chocolate \"Mousse\" Cake - Easy Chocolate Terrine Recipe", "selftext": "", "url": "https://i.imgur.com/AtOMLY1.jpg", "created_utc": 1552572193.0, "score": 669, "author": "EmmasGoodies", "num_comments": 26, "permalink": "/r/cookingforbeginners/comments/b10pgr/chocolate_mousse_cake_easy_chocolate_terrine/", "html_title": ""}
{"title": "Shrimp and broccoli with brown sauce", "selftext": "", "url": "https://i.imgur.com/oBx4DfV.jpg", "created_utc": 1570125558.0, "score": 665, "author": "ashtreylil", "num_comments": 20, "permalink": "/r/cookingforbeginners/comments/dcujeb/shrimp_and_broccoli_with_brown_sauce/", "html_title": ""}
{"title": "made myself a little cheese tray with homemade balsamic glaze and garlic-rosemaru infused oil :)", "selftext": "", "url": "https://i.redd.it/3yyoe2qbdjw31.png", "created_utc": 1572815114.0, "score": 664, "author": "makeupyourworld", "num_comments": 28, "permalink": "/r/cookingforbeginners/comments/dr6pxr/made_myself_a_little_cheese_tray_with_homemade/", "html_title": ""}
{"title": "spinach, turkey, and cheddar omelette with roasted purple potatoes", "selftext": "", "url": "https://i.redd.it/oawfjmn3ubt31.jpg", "created_utc": 1571416358.0, "score": 658, "author": "makeupyourworld", "num_comments": 20, "permalink": "/r/cookingforbeginners/comments/djpzsp/spinach_turkey_and_cheddar_omelette_with_roasted/", "html_title": ""}
{"title": "Still living at home but just recently started trying to cook a bit for my family - Mexican Mac and Cheese with Chickpea Pasta", "selftext": "", "url": "https://i.redd.it/2uzcuoaoflm31.jpg", "created_utc": 1568481668.0, "score": 662, "author": "bi_engineer_", "num_comments": 20, "permalink": "/r/cookingforbeginners/comments/d483u1/still_living_at_home_but_just_recently_started/", "html_title": ""}
{"title": "Tonight’s dinner", "selftext": "", "url": "https://i.redd.it/wsvt1fgvapp31.jpg", "created_utc": 1569835995.0, "score": 657, "author": "x-staunch-x", "num_comments": 53, "permalink": "/r/cookingforbeginners/comments/db90u7/tonights_dinner/", "html_title": ""}
{"title": "Do you hate reading someone's life story when you're looking for a recipe? I'm trying to fix that.", "selftext": "Hi! A buddy and I are working on a new app to make clipping recipes from the web super easy. I'm doing some initial market research on product names and would love to get feedback from fellow foodies. \n\nIf you can spare about 30 seconds could you tell me which product name resonates more with you in this one question survey?\n\n[https://www.surveymonkey.com/r/MHMT3T3](https://www.surveymonkey.com/r/MHMT3T3)\n\nEDIT\nThe survey is closed, thanks for voting. The app — [ClipDish](https://getclipdish.com) is going into public beta soon.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/az4n4t/do_you_hate_reading_someones_life_story_when/", "created_utc": 1552145737.0, "score": 654, "author": "BizJoe", "num_comments": 51, "permalink": "/r/cookingforbeginners/comments/az4n4t/do_you_hate_reading_someones_life_story_when/", "html_title": "Reddit - The heart of the internet"}
{"title": "Single person living alone. What should I always have on hand or on my shopping list?", "selftext": "Hello all! I don’t entertain much as I live alone in a small apartment.  I like cooking but am not amazing at it or very experienced.  Looking for ideas for snacks (ie can quickly grab and be ready in 1 or 2 steps), or dinners that are minimal in effort.  \n\nWhat are some items I should always have that can help achieve this?  Thank you!\n\nEdit: I guess it’s also worth mentioning that while I don’t have a butt ton of money, I’m lucky enough to where I have never struggled to put food on the table... but I also struggle with executive dysfunction issues hence this post 😆\n\nEdit2 : uuh wow I didn’t expect it to get this kind of attention - usually my posts like this get buried lol (I have a second account for personal reasons).  Thank you for the awards!! Lots of great ideas here, keep em coming! 💕", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kvi19a/single_person_living_alone_what_should_i_always/", "created_utc": 1610417798.0, "score": 654, "author": "legend-of-sora", "num_comments": 143, "permalink": "/r/cookingforbeginners/comments/kvi19a/single_person_living_alone_what_should_i_always/", "html_title": "Reddit - The heart of the internet"}
{"title": "Tips that have helped my cooking", "selftext": "Hi everyone!  About 6 years ago I was a hopeless cook. I'd eat pasta or noodles every meal and it would always be bland and boring. Since then I've worked hard to try and become a better chef and I wanted to share some general tips that have helped me cook better. \n\nPrep: \nAlways prep before you start. There's no better way to guarantee your meal will be burnt than trying to chop the potatoes while your onion fries. Have everything chopped/grated/out of the pantry before you switch the heat on. Also clear your work space, it helps you track what's going into the pan and when. Switch on the oven and let it preheat if you need it. \n\n\nHerbs: \nFresh is best. If you use dried it usually for baking and even then don't over use as they can be bitter. \n\nRosemary, oregano and thyme are good baking herbs. Use them when you intend to bake something in the oven and they'll add great flavour and aromatics. They tend to pair well with meat or starchy veg.\n\nParsley and Coriander are softer herbs and won't stand up to baking. Instead add them towards the end of cooking to get their full flavour. \n\nBasil is definitely an aromatic. That means it tastes bad on its own but the smell is what adds to your cooking. It should be added right at the end of cooking when the heat is off!\n\n\nSpices:\nFirstly make sure you have all the staples. I'd include cumin, coriander seeds, turmeric, paprika, nutmeg, ginger, sumac and chili flakes as my go to spices. Buy the big bags from Asian groceries to keep the price down and refill glass jars. \n\nMake sure you add spices early either as a marinade with oil on your meat/veg or at the very least before you add any liquid to your dish. \n\nUse recipes as inspiration for what combos of spices and herbs go well together. \n\nCumin is my favourite spice. This is because I find it so versatile and can be found in many of the cuisines I cook. For example you can pair it with paprika if your making fajitas, or with turmeric in a curry. Add it to some mince alone and make a kebab. \n\nChilli flakes are the one spice worth spending a little more on. Cheap flakes or chili powder add a hot but nasty shallow taste to your food. Instead go for aleppo or Urfa chili flakes if you can find them, your food will instantly be richer. \n\nSumac is good with red meat, add it after cooking and it will add a nice lemony taste that'll make your dish more interesting. \n\nOther ingredients:\nSalt - Add early especially to meat. I usually sprinkle before I even start cooking. If your adding liquid make sure you taste and sprinkle again if needed. \n\nGarlic - Garlic is getting is the king of aromatics and flavour. I use it in most meals. Frequently I add it early to the pan and fry on a low heat to keep it from burning (depending on the meal I can do this for up to 5 mins!) . Then whack up the heat just before you cook whatever else you have. \n\nFlour - Defintely can be your friend when cooking meat. A sprinkling (maybe half a handful) of flour added before cooking will help your meat pick up flavour from galric/spices and make it richer. It can also be used when thickening a sauce, but it can't work miracles, just carefully pour away excess liquid. \n\nButter/salt/sugar - If you're not worried about your health just put a lot of these ingredients in. Tbh you can't go wrong on quantities (within reason!) and they will improve just about any dish. I add salt and sugar early and then butter towards the end as it can make a dish richer. \n\nEquipment:\nKnives- Tip I learnt from Anthony Bourdain. A few quality pieces of cookware are much better than cupboards of tat.  Just have one good chopping knife. It should be large and kept very sharp. Make sure you buy a proper knife sharpener to go with it.\n\nPans- I mostly use one large frying pan which has high sides and is oven proof. Most of my dishes are made on the stove top but I've learnt that I can confidently put it in the oven too. I primarily do this when I want to fry meat to get that nice seared taste but then want to bake the dish to get a richer flavour in the liquid. \n\n\nHope these tips help, I'm sure there is more I have forgotten ill add later. \n\nI'll try to answer any follow up questions when I get the chance.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/fy11rh/tips_that_have_helped_my_cooking/", "created_utc": 1586467631.0, "score": 648, "author": "penurious", "num_comments": 43, "permalink": "/r/cookingforbeginners/comments/fy11rh/tips_that_have_helped_my_cooking/", "html_title": "Reddit - The heart of the internet"}
{"title": "Cooked my first dish ever! Spicy Potato Curry.", "selftext": "", "url": "https://i.redd.it/ugwjy8pyx8q31.jpg", "created_utc": 1570073808.0, "score": 652, "author": "pinktothebone", "num_comments": 23, "permalink": "/r/cookingforbeginners/comments/dclg9t/cooked_my_first_dish_ever_spicy_potato_curry/", "html_title": ""}
{"title": "My first chicken curry!", "selftext": "", "url": "https://i.redd.it/ocg1900ysrt31.jpg", "created_utc": 1571609680.0, "score": 645, "author": "None", "num_comments": 29, "permalink": "/r/cookingforbeginners/comments/dkqsw8/my_first_chicken_curry/", "html_title": ""}
{"title": "Is there a basic learning app like duolingo for cooking?", "selftext": "Hiya all,\n\n&#x200B;\n\nwas wondering same as OP here ([https://www.reddit.com/r/cookingforbeginners/comments/hh1vdj/is\\_there\\_an\\_app\\_like\\_duolingo\\_to\\_help\\_with\\_cooking/](https://www.reddit.com/r/cookingforbeginners/comments/hh1vdj/is_there_an_app_like_duolingo_to_help_with_cooking/)) whether there is such an app like duolingo.\n\n&#x200B;\n\nBasically i am not looking for recipes and how to cook them, but rather find out what makes bread fall/rise in the oven, why is my chicken dry, whats the best way to create ingredient A B C. I have spent some time googling and could not find anything. Given the whole covid lockdown maybe something has been emerging which i simply did not find yet...\n\n&#x200B;\n\nTL;DR: is there an app which teaches basics of ingredient handling in a gamified way?\n\n&#x200B;\n\nAfterpost edit - thanks a lot for all the feedback. I know how to cook chicken, that was a mere example ;-) I also want to thank you for the specific recommendations on content (for the others, I am aware of the app youtube). To the guys&gals working on the app as mentioned, will also have a look and good luck!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/k0slnf/is_there_a_basic_learning_app_like_duolingo_for/", "created_utc": 1606312614.0, "score": 639, "author": "avoques", "num_comments": 90, "permalink": "/r/cookingforbeginners/comments/k0slnf/is_there_a_basic_learning_app_like_duolingo_for/", "html_title": "Reddit - The heart of the internet"}
{"title": "finally going to start making food for work! honey sesame turkey meatballs and mashed potatoes", "selftext": "", "url": "https://i.redd.it/1a1614hcu0041.jpg", "created_utc": 1574334199.0, "score": 642, "author": "sadsoli", "num_comments": 25, "permalink": "/r/cookingforbeginners/comments/dzhpw4/finally_going_to_start_making_food_for_work_honey/", "html_title": ""}
{"title": "Fluffy Cinnamon Roll Recipe", "selftext": "", "url": "https://i.imgur.com/anaZkEe.jpg", "created_utc": 1551971700.0, "score": 643, "author": "EmmasGoodies", "num_comments": 15, "permalink": "/r/cookingforbeginners/comments/aydnmv/fluffy_cinnamon_roll_recipe/", "html_title": ""}
{"title": "I'll never buy boxed macaroni and cheese again.", "selftext": "This works with any kind of pasta - fusilli, penne, macaroni, angel hair, spaghetti, whatever. You can buy it in bulk, store brand, for pretty good prices, especially when it's on sale. Stock up if it goes on sale.\n\nThen you want deli American cheese, not the prepackaged stuff. Yes it matters, because yes it's different. (And better!)\n\nSalt the water and boil the pasta according to directions. I like mine on the firmer side so when the box says \"cooks in 10-12 minutes\" I pull it at 9-10 minutes. If it says 5-6 minutes (like angel hair) I pull it at 4 minutes or so, if the noodles are really pliable when I stir them. (Side note, most directions vastly overstate the amount of water you need. In general you want the pasta completely covered with at least an inch of water on top of it. You don't have to wait the 20 minutes it takes to boil four quarts of water for a box of spaghetti noodles. Use a large sauce pan and break them in half and then apply gentle pressure until they soften and are submerged, for example.)\n\nDrain into a colander but don't do a good job of it - you want some of that salted water in reserve, probably 2-3 tablespoons per serving you're cooking. Alternately you can just ladel some into a cup or bowl right before you strain the noodles. \n\nPut the noodles back in the pot with the water you saved (or that you didn't pour out) and and add 2-3 slices of cheese per serving, ripped into quarters or halves, and then stir until it's all melted and you have a cheese sauce. This takes approximately a minute or so, if you do it immediately. The residual heat on the noodles and the water you saved (immediately prior to straining) is enough to get the job done. It's that fast.\n\nThis doesn't sound like it would be good but it is phenomenal. You can also add grated parmesan or some other cheese if you want to fancy it up, but be aware that many 'harder' cheeses will not melt and emulsify well. Also shaker can parmesan (and anything pre-shredded in a bag) is treated with corn starch, which isn't really a problem for me but might be for some of you. (You want an emulsifier like sodium citrate or even good old mustard powder for some cheese, experiment if you want, and if you're really going all out you want to do this separately in a little sauce pan.)\n\nIf you use less water you can add a splash of milk, but it's not required.\n\nAdd salt and pepper, garlic, oregano or basil if you want. I sometimes add in a spoonful of basil pesto for a completely different experience.\n\nYou can get American cheese from the deli for $4-$6 per pound in most markets I'd imagine, or $8-$9 per pound for Boar's Head. I've never really counted slices but this is enough cheese for a good number of batches. It's a little more expensive than the prepackaged stuff but that's because it's actual cheese and not 'cheese product'. It's worth it. You can also use it on sandwiches and melts.\n\nIf no one watches you make this, they'll have no idea what you did and will assume you are a wizard when you say you didn't make it from a box, when in fact you got the idea from the cookingforbeginners subreddit.\n\nAdd peas and tuna for homemade tuna helper. Add steamed broccoli for noodles and broccoli in cheese sauce. Add browned ground beef and chili powder and some jalapenos or diced chipotles for chili mac.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/ir2tcn/ill_never_buy_boxed_macaroni_and_cheese_again/", "created_utc": 1599871066.0, "score": 634, "author": "inthrees", "num_comments": 125, "permalink": "/r/cookingforbeginners/comments/ir2tcn/ill_never_buy_boxed_macaroni_and_cheese_again/", "html_title": "Reddit - The heart of the internet"}
{"title": "I'm thinking of doing a cooking channel and insta page on how to make great foods for beginners from all over the world on a tight budget. What do you guys think?", "selftext": "", "url": "https://www.reddit.com/r/cookingforbeginners/comments/elqzzx/im_thinking_of_doing_a_cooking_channel_and_insta/", "created_utc": 1578479252.0, "score": 635, "author": "JoJo2kMax", "num_comments": 93, "permalink": "/r/cookingforbeginners/comments/elqzzx/im_thinking_of_doing_a_cooking_channel_and_insta/", "html_title": "Reddit - The heart of the internet"}
{"title": "First attempt at homemade chicken fried rice.", "selftext": "", "url": "https://i.redd.it/dzwtb49fjxk31.jpg", "created_utc": 1567756485.0, "score": 631, "author": "mirabreaux", "num_comments": 53, "permalink": "/r/cookingforbeginners/comments/d0dm4a/first_attempt_at_homemade_chicken_fried_rice/", "html_title": ""}
{"title": "Buttermilk Biscuits", "selftext": "", "url": "https://i.redd.it/paz219yhkkj31.jpg", "created_utc": 1567163629.0, "score": 629, "author": "alyssa_boii", "num_comments": 31, "permalink": "/r/cookingforbeginners/comments/cxfh3d/buttermilk_biscuits/", "html_title": ""}
{"title": "First Time Lamb Rack w Crushed Potatoes, Cherry Tomatoes, Rosemary and Garlic.", "selftext": "", "url": "https://i.redd.it/lew1r0mitri31.jpg", "created_utc": 1566815544.0, "score": 630, "author": "thegirlwhowaited-", "num_comments": 39, "permalink": "/r/cookingforbeginners/comments/cvm92t/first_time_lamb_rack_w_crushed_potatoes_cherry/", "html_title": ""}
{"title": "Why is chicken breast at home never like in resturant", "selftext": "My mother makes sometimes chicken breast on a pan with oil cooking it but it always tastest so different from resturant and often you cant bite it well its chewy, what are some resturant secrets from you guys who have worked there is it the meat quality or is it prepared better.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1ix85xl/why_is_chicken_breast_at_home_never_like_in/", "created_utc": 1740419476.0, "score": 621, "author": "volkswagen_das_auto_", "num_comments": 459, "permalink": "/r/cookingforbeginners/comments/1ix85xl/why_is_chicken_breast_at_home_never_like_in/", "html_title": "Reddit - The heart of the internet"}
{"title": "Chocolate tart, thanks to sortedfood for the recipe and making pastry look much easier than it actually is", "selftext": "", "url": "https://i.redd.it/shdhleqsjel31.jpg", "created_utc": 1567962430.0, "score": 621, "author": "None", "num_comments": 26, "permalink": "/r/cookingforbeginners/comments/d1dnyg/chocolate_tart_thanks_to_sortedfood_for_the/", "html_title": ""}
{"title": "What do you guys like on your breakfast burritos??", "selftext": "", "url": "https://i.redd.it/rf5pr2p358h31.jpg", "created_utc": 1566141452.0, "score": 626, "author": "duftluft", "num_comments": 77, "permalink": "/r/cookingforbeginners/comments/cs2g2c/what_do_you_guys_like_on_your_breakfast_burritos/", "html_title": ""}
{"title": "We made Parsnip (\"Duolingo for cooking\") because of this sub. Can you tell us what you think?", "selftext": "Two years ago, this sub came up with the idea of building a Duolingo for cooking.\n\n>[r/cookingforbeginners: Is there an app like Duolingo to help with cooking?](https://www.reddit.com/r/cookingforbeginners/comments/hh1vdj/is_there_an_app_like_duolingo_to_help_with_cooking/)\n\nInspired by many of your ideas, and with a lot of hard work, here we are!\n\nIf you have an iOS device, you can [**try the Parsnip App for iOS**](https://parsnip.ai/). \n\n**EDIT**: we also just went live on with [**Parsnip on Google Play**](https://play.google.com/store/apps/details?id=com.tapforce.parsnip)!\n\n&#x200B;\n\nThe app has a long way to go, but Parsnip will eventually be a **tech tree for all cooking skills**—if your nerd side is curious, [here's the plan for that](https://parsnip.substack.com/p/a-new-hope). We're passionate about this because helping everyone cook is [good for people and good for the planet](https://parsnip.substack.com/p/why-we-started-parsnip).\n\n&#x200B;\n\nYou can also [**come talk to us on Discord**](https://discord.gg/P4qpxsJ6A8) anytime! Parsnip is a work in progress, and we'd love to hear your suggestions about what to do next.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/t6nynj/we_made_parsnip_duolingo_for_cooking_because_of/", "created_utc": 1646414418.0, "score": 621, "author": "mizzao", "num_comments": 154, "permalink": "/r/cookingforbeginners/comments/t6nynj/we_made_parsnip_duolingo_for_cooking_because_of/", "html_title": "Reddit - The heart of the internet"}
{"title": "My friend is sick with the flu, and I thought I'd make coconut macaroons for her since they are her favorite. It's my first time, how do they look? :)", "selftext": "", "url": "https://imgur.com/4FXjTZ5", "created_utc": 1556990268.0, "score": 619, "author": "KasperAura", "num_comments": 30, "permalink": "/r/cookingforbeginners/comments/bknepl/my_friend_is_sick_with_the_flu_and_i_thought_id/", "html_title": ""}
{"title": "My mom loves easy over eggs/ the whites with the yokes in them", "selftext": "Im 14 and my mom doesnt get to have breakfast in the mornings usally and I want to cook my mom her favorite eggs. She doesnt know how to cook them. Any links much appreciated.\n\nEdit:Made the eggs my mom said that the eggs where good. \n\nNever mind she LOVED it", "url": "https://www.reddit.com/r/cookingforbeginners/comments/hnbeyz/my_mom_loves_easy_over_eggs_the_whites_with_the/", "created_utc": 1594186826.0, "score": 614, "author": "Mincraft_is_lit", "num_comments": 53, "permalink": "/r/cookingforbeginners/comments/hnbeyz/my_mom_loves_easy_over_eggs_the_whites_with_the/", "html_title": "Reddit - The heart of the internet"}
{"title": "Can you help us with ideas for a \"Duolingo for cooking\" for teaching beginners?", "selftext": "Hi all, over the last year there were a couple of really popular posts right here in r/cookingforbeginners where we saw that many Redditors wanted an app or experience to help learn cooking from the ground up:\n\n* [https://www.reddit.com/r/cookingforbeginners/comments/k0slnf/is\\_there\\_a\\_basic\\_learning\\_app\\_like\\_duolingo\\_for/](https://www.reddit.com/r/cookingforbeginners/comments/k0slnf/is_there_a_basic_learning_app_like_duolingo_for/)\n* [https://www.reddit.com/r/cookingforbeginners/comments/lwfgw9/creating\\_an\\_app\\_to\\_learn\\_how\\_to\\_cook\\_from\\_the/](https://www.reddit.com/r/cookingforbeginners/comments/lwfgw9/creating_an_app_to_learn_how_to_cook_from_the/)\n\nInspired by all the excitement here, we've been working on an educational tool that teaches & explains cooking skills & techniques within recipes, called Parsnip: try it out at [**https://parsnip.ai/**](http://parsnip.ai/). We built Parsnip to track the skills that you learn and motivate you with fun badges and levels as you gain more experience.\n\nParsnip is definitely a work in progress and we would love to work with Redditors here—who helped come up with idea—to make it better. What do you like? What sucks? What is something we could add to help you and others learn to cook better? Happy to hear any suggestions or you can DM me too!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/oeydcr/can_you_help_us_with_ideas_for_a_duolingo_for/", "created_utc": 1625588647.0, "score": 614, "author": "mizzao", "num_comments": 115, "permalink": "/r/cookingforbeginners/comments/oeydcr/can_you_help_us_with_ideas_for_a_duolingo_for/", "html_title": "Reddit - The heart of the internet"}
{"title": "Grilled Honey Mustard Chicken Thighs- Marinated for ~5 hrs", "selftext": "", "url": "https://i.redd.it/2vwwtpl0pjh31.jpg", "created_utc": 1566281758.0, "score": 611, "author": "acidic-abolony", "num_comments": 21, "permalink": "/r/cookingforbeginners/comments/cstmfd/grilled_honey_mustard_chicken_thighs_marinated/", "html_title": ""}
{"title": "First attempt at chicken parm! Tasted great and was relatively simple to make", "selftext": "", "url": "https://i.redd.it/xsgwa1fnicy31.jpg", "created_utc": 1573603852.0, "score": 611, "author": "shreddy_vt", "num_comments": 21, "permalink": "/r/cookingforbeginners/comments/dvj67k/first_attempt_at_chicken_parm_tasted_great_and/", "html_title": ""}
{"title": "What foods spoil faster in the fridge than at room temp?", "selftext": "I recently learned that potatoes actually spoil faster in the fridge because the cold temperatures accelerate the conversion of starch to sugar. I know there are plenty of lists of foods that are safe to keep at room temp, but I want to know what other foods are explicitly bad to put in the fridge. (My apartment is strange in that I have much more excess fridge space than pantry space.)", "url": "https://www.reddit.com/r/cookingforbeginners/comments/19ck906/what_foods_spoil_faster_in_the_fridge_than_at/", "created_utc": 1705888503.0, "score": 608, "author": "yadec", "num_comments": 212, "permalink": "/r/cookingforbeginners/comments/19ck906/what_foods_spoil_faster_in_the_fridge_than_at/", "html_title": "Reddit - The heart of the internet"}
{"title": "Roommate turned my broth off last night, is it ok to turn back on and keep cooking?", "selftext": "My high roommate turned off the burner to the bone broth that I’m trying to make. I’ve never made anything like this before so I don’t know if I have to scrap the whole pot since it was just sitting out for 7 hours...can y’all help me out?\n\nEdit: it’s official, I’m gonna just kill my roommate and use his bones for my new broth /s\nThanks for being so helpful and telling me the truth and not what I want to hear!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kbqw99/roommate_turned_my_broth_off_last_night_is_it_ok/", "created_utc": 1607786900.0, "score": 610, "author": "Coffeeshopthot", "num_comments": 117, "permalink": "/r/cookingforbeginners/comments/kbqw99/roommate_turned_my_broth_off_last_night_is_it_ok/", "html_title": "Reddit - The heart of the internet"}
{"title": "The secret to good meat? Buy good meat.", "selftext": "I know, what a revelation. \n\nBut honestly, I've been getting meat from a local meat-share delivery service for almost a year and every time I make a whole roast chicken I can't believe how good it is from just being salted overnight then going in the oven for 40-50 minutes. I've gotten some meat from the local supermarkets from time to time and the difference in taste is pretty shocking.\n\nAre you a beginning cook trying to figure out how to make good meat? Step 1 is definitely going to be to buy good quality meat.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/jv8r8z/the_secret_to_good_meat_buy_good_meat/", "created_utc": 1605540897.0, "score": 607, "author": "afterschoolsolutions", "num_comments": 48, "permalink": "/r/cookingforbeginners/comments/jv8r8z/the_secret_to_good_meat_buy_good_meat/", "html_title": "Reddit - The heart of the internet"}
{"title": "lemon butter shrimp with asparagus and rice!", "selftext": "", "url": "https://i.redd.it/q3qt8g86fjz31.jpg", "created_utc": 1574123279.0, "score": 604, "author": "None", "num_comments": 22, "permalink": "/r/cookingforbeginners/comments/dycdyx/lemon_butter_shrimp_with_asparagus_and_rice/", "html_title": ""}
{"title": "How do i cook a grilled cheese Quietly, It is 5am and i don’t need a recipe just Tips.", "selftext": "Like how to keep the butter from screaming without loosing the toast.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/ljmn48/how_do_i_cook_a_grilled_cheese_quietly_it_is_5am/", "created_utc": 1613301450.0, "score": 606, "author": "Herobrine145Reddits", "num_comments": 132, "permalink": "/r/cookingforbeginners/comments/ljmn48/how_do_i_cook_a_grilled_cheese_quietly_it_is_5am/", "html_title": "Reddit - The heart of the internet"}
{"title": "Sometimes my eggs come right out of the pan and other times they are fused to it. Why?", "selftext": "Please be very gentle with me. I have a lot of anxiety around cooking and feeding myself for reasons I don’t want to get into. I’m trying to teach myself to cook again. I used to be able to make decent omelettes. Now when I try about half the time the omelette becomes fused to the pan and I end up having to scrape it all out and it’s just gross. I use a non stick pan and put butter in there before the eggs. I also use a plastic spatula. Sorry if this is too basic of a question. I realize I should know how to do this already.\n\nEdit: I don’t understand. Why are people downvoting this? Is this not a beginner cooking question? Is there a better place for this post?", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kn3hw3/sometimes_my_eggs_come_right_out_of_the_pan_and/", "created_utc": 1609339685.0, "score": 605, "author": "about831", "num_comments": 92, "permalink": "/r/cookingforbeginners/comments/kn3hw3/sometimes_my_eggs_come_right_out_of_the_pan_and/", "html_title": "Reddit - The heart of the internet"}
{"title": "Fluffy Vanilla Cake With Cheesecake Filling ( Easy and no special mold required)", "selftext": "", "url": "https://i.imgur.com/mWdgGVE.jpg", "created_utc": 1550763510.0, "score": 604, "author": "EmmasGoodies", "num_comments": 13, "permalink": "/r/cookingforbeginners/comments/at4i14/fluffy_vanilla_cake_with_cheesecake_filling_easy/", "html_title": ""}
{"title": "Made a Chinese style pulled pork tonight with steamed buns and some garnishes to go with it", "selftext": "", "url": "https://i.redd.it/ch3g974ve9n31.jpg", "created_utc": 1568771933.0, "score": 599, "author": "Doggystyle_Rainbow", "num_comments": 24, "permalink": "/r/cookingforbeginners/comments/d5qyap/made_a_chinese_style_pulled_pork_tonight_with/", "html_title": ""}
{"title": "How the fuck do I make soup?", "selftext": "Like a normal soup. I *genuinely* can't find any instructions online that aren't fancy, probably because it's so easy but I just don't know how? I know you need a stock like meat or fish, and vegetables but do you just **dump** it all in a pot and let it boil? Something more to it? There must be.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/cgddjs/how_the_fuck_do_i_make_soup/", "created_utc": 1563803029.0, "score": 595, "author": "sadweegoldfish", "num_comments": 69, "permalink": "/r/cookingforbeginners/comments/cgddjs/how_the_fuck_do_i_make_soup/", "html_title": "Reddit - The heart of the internet"}
{"title": "Had a roommate request I make him a dish he saw me prepare the other day", "selftext": "After 27 years on this Earth I've just been getting into cooking over the last few months and have been trying my hand at different recipes. Gave cacio e pepe a shot recently, which my roommates saw me making, and today one of them asked me if I'd make him the \"pasta dish with the mountain of cheese because it looks amazing.\" I've never had some ask me to cook them something before, and the look of \"mmmmm\" on his face during the first bite was immensely rewarding. Thankfully this is the third time I've made it now but the first time I got it \"right\" lol. I'm also thankful for Alton Brown because this recipe is the bomb\n\nAnyway just wanted to share because I'm feelin good about myself for a change and I also think I'm about to become addicted to feeding people. And I highly highly recommend this recipe! I'll post in comments", "url": "https://www.reddit.com/r/cookingforbeginners/comments/ff5hea/had_a_roommate_request_i_make_him_a_dish_he_saw/", "created_utc": 1583632294.0, "score": 600, "author": "scojo415", "num_comments": 23, "permalink": "/r/cookingforbeginners/comments/ff5hea/had_a_roommate_request_i_make_him_a_dish_he_saw/", "html_title": "Reddit - The heart of the internet"}
{"title": "How do I cook and safely eat a hat?", "selftext": "I lost a bet", "url": "https://www.reddit.com/r/cookingforbeginners/comments/iaooqr/how_do_i_cook_and_safely_eat_a_hat/", "created_utc": 1597565240.0, "score": 591, "author": "Modpirate_385", "num_comments": 98, "permalink": "/r/cookingforbeginners/comments/iaooqr/how_do_i_cook_and_safely_eat_a_hat/", "html_title": "Reddit - The heart of the internet"}
{"title": "spinach omelet, potato hash, and tomatoes 🍳 🌿 🍅", "selftext": "", "url": "https://i.redd.it/iyzfokoyw9z31.jpg", "created_utc": 1574008194.0, "score": 594, "author": "makeupyourworld", "num_comments": 25, "permalink": "/r/cookingforbeginners/comments/dxomk3/spinach_omelet_potato_hash_and_tomatoes/", "html_title": ""}
{"title": "Puff Pastry Burgers: Tonight I put 1/4 pound burger patties, sauerkraut, caramelized onions, and aged cheddar in puff pastries and baked it. Waiting for it to cool down so I can eat it!", "selftext": "", "url": "https://i.redd.it/jny4h1o9mpj31.jpg", "created_utc": 1567224740.0, "score": 592, "author": "Doggystyle_Rainbow", "num_comments": 34, "permalink": "/r/cookingforbeginners/comments/cxrjjg/puff_pastry_burgers_tonight_i_put_14_pound_burger/", "html_title": ""}
{"title": "my parents have absolutely ruined food for me. how do i get my tastebuds back?", "selftext": "(lmao just read this over and this is kinda sad lol , trigger warning for e.d. habits, and parental depression lol) \n\na little backstory is that my parents have both untreated mental illnesses. i love them both dearly, however I kinda feel like they should have gotten the help they needed before having and raising me. anyways, they kind of used to cook a bit when i was really young but it was always canned , unseasoned , and overcooked, or just a frozen meal. once i grew tastebuds of my own i realized that their cooking wasn't the greatest, i was still pretty young so i just kinda,, stopped eating food? unless it was fast food i basically refused to eat it. \nnow i'm 19, and still. hate. food. i try not to eat out much anymore but it's like the only thing i like to eat, other than maybe rice pudding and grilled cheeses. i know it's super bad but i don't know how to make myself like food. it always looks so gross to me. every time i look at pintrest recipes i'm just grossed out.   veggies, fruits, bread, everything. it's so boring and gross. i don't know how to bring out my love of food. i know this is super bad for my health and i want to change i just don't know how. Has anyone here recovered from a fast food addiction ?? how did you do it if you did ?? lmao sounds stupid but it's so real.\n\nTLDR; i have a fast food addiction, everything else seems gross to me. i know it's so bad for me and i want to change. what are some easy really flavourful recipes i can make by myself ?\n\nedit: y'all are all so sweet i woke up with notifications expecting people to be like \"just grow up\" but that's what i'm trying to do !! 💕 thank u guys so much", "url": "https://www.reddit.com/r/cookingforbeginners/comments/je87cm/my_parents_have_absolutely_ruined_food_for_me_how/", "created_utc": 1603134250.0, "score": 588, "author": "ihcorex", "num_comments": 146, "permalink": "/r/cookingforbeginners/comments/je87cm/my_parents_have_absolutely_ruined_food_for_me_how/", "html_title": "Reddit - The heart of the internet"}
{"title": "You can make Chicken and Dumplings from scratch much more easily than you think and it's very cheap!", "selftext": " \n\n**\"Rustic\" Chicken and Dumplings**\n\nThis comforting and hearty recipe may be the epitome of cooking with what you've got. I've always gone with my eyes and by feel/taste, so take my measurements with a very hefty grain of salt. At the end of the day we are making thick chicken soup and dropping biscuit dough in. Feel free to mix it up however you want using this foundation\n\n**Ingredients for the chicken part**\n\n4 bone-in, skin-on chicken thighs (just trust me, okay)\n\n1 medium onion, yellow or white\n\n3 or 4 cloves of garlic, minced\n\nA few tablespoons of oil or butter\n\n4 cups of chicken stock, or enough to cover at least half of the chicken thighs (I use bullion and water)\n\nSalt and pepper to taste\n\nAromatics of choice if desired/available\n\n**Ingredients for the dumplings**\n\n2 cups AP flour\n\n2 to 2-1/2 teaspoons baking powder (in general you want about 1 teaspoon of baking powder per cup of flour)\n\n1 teaspoon white sugar\n\nPinch of salt to taste\n\n1/2 cup chilled butter (make sure it's cold)\n\n1 1/4 cups whole milk (also make sure it's cold)\n\n**Method**\n\nHeat a large pot over medium heat and add oil/butter to coat the bottom. Rub chicken thighs with a pinch of salt and place skin side down into the pot.\n\nWhile the chicken is browning, dice the onion roughly and mince the garlic.\n\nOnce the chicken thighs have gotten some color on the skin, flip them and add the onions. Let cook until the onions begin to soften.\n\nAfter onions have softened, add minced garlic. Be sure to keep the garlic moving and be ready to take off the heat if it begins to burn at all.\n\nAfter a few minutes the garlic should be a golden brown and the onion should be lightly caramelized. Turn the heat down to medium-low and add the chicken stock (aim for the chicken to be at least halfway covered and seasonings of choice. Salt and pepper will be just fine, but if you want to add aromatics or other seasonings go for it. I basically never make it the same way twice. I suggest going a bit easy for now since ideally we want that chicken fully cooked before taste testing. We can always add more later.\n\nCover the pot and let simmer until the chicken begins to fall apart, at least 30 minutes.\n\nTo make the dumplings\n\nBegin this process once the chicken is starting to get fully cooked and tender.\n\nMix flour, baking powder, sugar, and salt thoroughly in a medium bowl. I like to add a bit of garlic powder as well but that's optional. Cut cold butter into small chunks and incorporate into the dry mixture. Use a fork, your hands, a stick, whatever. We just want small solid pieces of butter, roughly pea-sized.\n\nMix with utensil of choice until it forms into a very wet, shaggy dough. It will be sticky and almost more of a very thick batter when ready.\n\n**To finish it up**\n\nBy this point, the chicken should be falling off the bone and shredding easily in the pot. Pull those bones out with tongs or really anything that's not your hand. Give the chicken a rustling to get it nice and broken up, and it's time to drop those dumplings!\n\nUsing a spoon or your hands, pull out small chunks of the dough/batter and drop them into the soup. It will be a bit sticky and messy, and it won't be a pageant winner visually. Once again I am asking you to trust me. Stay conservative on scooping the dumplings as they will at least double in size, typically more. A tablespoon or so per dumpling serves me well.\n\nCook uncovered for about 10 minutes, then cover and cook for about another 10 minutes, or until the dumplings have firmed up and doubled.\n\n**EAT IT**\n\nWHAT ARE YOU WAITING FOR! No need to let this rest. Go ahead and serve it up and eat it hot. If you are unsure of the doneness of the dumplings, pull one out and have a chef snack. It should be pillowy soft with just a bit of chew. Cooking for longer produces a chewier dumpling if that's what you prefer.\n\n**Notes**\n\nI know bone-in, skin-on thighs may raise some eyebrows. In my experience, it adds a ton of flavor and texture to the dish overall. Plus they are super cheap compared to other cuts. The skin is easy to take out after it's imparted it's delicious fatty flavor, if you prefer. Other cuts of chicken would also be fine if you'd like to go leaner, or if you only have a different cut on hand. If using white meat, be gentler on the heat and time.\n\nThe dumplings almost always end up being the star of the show, which is why I use drop dumplings instead of a more doughy dumpling. They are like pillowy flavor sponges and they thicken the broth on their own. If you prefer a thicker/chewier dumpling, add a bit more flour to the dough and/or cook a bit longer with the dumplings in.\n\nThis is a very simple base recipe, so feel free to go wild with add-ons. Throw in some peas and carrots, or add some sage or oregano.\n\nThis recipe is insanely cheap and keeps and heats up well, so no wonder it's been a go-to for feeding the family for so long. I've gotten it well below $0.75 per serving, and even with chicken breast it doesn't creep too far above a buck a bowl. Plus clean-up is minimal since we basically just use one pot and one bowl.\n\n**BONUS RECIPE**\n\nThe dumpling recipe can be used exactly as is for drop biscuits so this recipe serves double duty. Whip up some dumplings, drop roughly golf ball sized balls onto a greased pan, and bake for 12-15 minutes until golden brown. Top with melted butter, syrup, jam, or whatever you want.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/jcvq1m/you_can_make_chicken_and_dumplings_from_scratch/", "created_utc": 1602943683.0, "score": 587, "author": "southerngentleman90", "num_comments": 66, "permalink": "/r/cookingforbeginners/comments/jcvq1m/you_can_make_chicken_and_dumplings_from_scratch/", "html_title": "Reddit - The heart of the internet"}
{"title": "General tip: *SALT THE WATER* for potatoes and pasta!", "selftext": "I’m telling you, its a game changer. I don’t measure; i just take the big canister that’s used to fill the table shaker, turn it over the pot and kinda swirl a quick circle around the pot. \n\n\n(Just remember: you can always put more in, but you can’t take it out!)\n\nEdit: rice too. I just personally keep my rice bland bec I like to use it to balance things that are strongly flavored.\n\nEdit 2: the amount of salt added to rice is more important to be careful of. You can’t use a free hand like you can with pasta and potatoes, as all the water is absorbed into the rice and thus, all the salt. My thanks to commenters who pointed that out.\n\nEdit 3: there *is* a particular dish called salted potatoes, where they boil potatoes with the skin still on. This is not specifically what I’m referring to (although it does technically fit the description.)", "url": "https://www.reddit.com/r/cookingforbeginners/comments/xke9kz/general_tip_salt_the_water_for_potatoes_and_pasta/", "created_utc": 1663788189.0, "score": 590, "author": "babyjo1982", "num_comments": 146, "permalink": "/r/cookingforbeginners/comments/xke9kz/general_tip_salt_the_water_for_potatoes_and_pasta/", "html_title": "Reddit - The heart of the internet"}
{"title": "Supposed to be white sauce over veggies but the sauce turned out more like gravy. Still tasted good tho", "selftext": "", "url": "https://i.redd.it/z279ttdv8fm31.jpg", "created_utc": 1568406710.0, "score": 583, "author": "squirrelfunny", "num_comments": 57, "permalink": "/r/cookingforbeginners/comments/d3v5jb/supposed_to_be_white_sauce_over_veggies_but_the/", "html_title": ""}
{"title": "Easy and tasty depression meals??", "selftext": "Content warning: depression\n\nHey all, hate to bring such a dour topic to a great sub, but depression is something I suffer with majorly. I was wondering if people who share the same problem, or just know a tasty easy recipe could share some?\n\nI often neglect food and hygiene the most during my slumps, and it can get really bad. Particularly during such an isolated time. The recipes can vary in ease and difficulty, but I would prefer some fairly easy ones. With little to no prep or maybe not as much cooking time?\n\nThank you in advance, and good luck during these trying times!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/j2i0qt/easy_and_tasty_depression_meals/", "created_utc": 1601452871.0, "score": 588, "author": "redsenma", "num_comments": 228, "permalink": "/r/cookingforbeginners/comments/j2i0qt/easy_and_tasty_depression_meals/", "html_title": "Reddit - The heart of the internet"}
{"title": "I have no idea how to cook. Tried YouTube and internet tutorials but failed. Nothing works", "selftext": "I’m 16 and since quarantine started cooking has been a big struggle. Before I used to eat in school 3 times a day so I never thought about cooking much. Never learned to cook before. Now, I’m often hungry because I don’t have proper meals. I can do some stuff like boil an egg, make an oatmeal, boil pasta but nothing more than that. \n\nHow can I learn to cook? My father never cooks because “it’s women’s job”(I hate him) and my mother doesn’t know how to cook and doesn’t care that I don’t have anything to eat. So my parents can’t teach me to cook. I’ve tried many recipes on YouTube or on internet but they failed. Pancakes and fried eggs end up sticking to the pan, rice end up being mushy. I’ve even had food poisonings because I didn’t know how to cook properly. I didn’t know that beans need soaking and ate them almost raw. Also most of the meat I’ve cooked was raw inside and that gave me food poisonings as well.\n\nThe foods I cook using YouTube or internet tutorial never work. The biscuit I tried to cook were very hard and impossible to bite, the cake I tried to cook 5 times even I tried different recipes never turned out eatable. And the soups I tried to cook tasted horribly but was eatable at least. Also there’s always not enough ingredients at home and when I want to buy new ingredients my parents don’t let me buy \n\nI find cooking very exhausting too, I try so hard and put a lot effort and in the end I end up with nothing but uneatable meal, dirty kitchen and dishes, wasting ingredients, my energy and many hours. Also then my parents scold me for wasting food. It’s so much effort for nothing. And peeling potatoes are so difficult, I spend like 30 minutes peeling 3 potatoes. I don’t even know how to peel potatoes.\n\nHow can I learn to cook? Do I need to go to cooking courses? I would like to go however there’s pandemic and it also costs money and there’s no one to drive me to a place where lessons take place. Please help me\n\nEdit: thank you so so much for your advice and help!!!!!! \n\nI live in Kazakhstan so things might be different here. Like fruits and vegetables are extremely expensive, 100 g berries cost 20 dollars and one avocado costs 10$ while an average broccoli costs about 5$. An average salary here is about 400$ so it’s an extra issue", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kmggvk/i_have_no_idea_how_to_cook_tried_youtube_and/", "created_utc": 1609255778.0, "score": 586, "author": "redcolorlover", "num_comments": 230, "permalink": "/r/cookingforbeginners/comments/kmggvk/i_have_no_idea_how_to_cook_tried_youtube_and/", "html_title": "Reddit - The heart of the internet"}
{"title": "First time making Fried Chicken at home! Any tips for breading mixes?", "selftext": "", "url": "https://i.redd.it/mc2i2i07wnz31.jpg", "created_utc": 1574177453.0, "score": 581, "author": "None", "num_comments": 41, "permalink": "/r/cookingforbeginners/comments/dylws2/first_time_making_fried_chicken_at_home_any_tips/", "html_title": ""}
{"title": "This is for those who are looking for a way to cook steaks without smoking out their entire kitchen.", "selftext": "America's Test Kitchen just created a new method (new to me at least) for achieving a good sear on a steak without creating a ton of smoke. [Here is a link to the video](https://www.americastestkitchen.com/recipes/12368-pan-seared-strip-steaks), but it is behind a paywall, so I will describe the process below. \n\nYou will need a well-marbled steak that is 1 & 1/2\" thick and a nonstick skillet. \n\nYes, a nonstick skillet. I was skeptical at first, but then I tried it and was quite surprised. \n\nSeason your steaks with salt & pepper, let them sit at room temp for at least 45 minutes, or up to 24 hours in the fridge. \n\nPat the steaks dry, add to the COLD nonstick pan. That's right, cold pan, and no oil. Insanity, I know. \n\nNow, turn the burner on full blast, set a timer for 2 minutes. Once the time is up, flip the steaks and reset the timer for 2 minutes. The steaks will be gray at this point. \n\nOnce that timer is up, flip the steaks and lower the heat to medium, and reset the timer to 2 minutes. You should now see the slightest bit of browning. \n\nNow you are going to leave the heat on medium for the rest of the process. Flip every 2 minutes, you should see a dark crust forming more and more with each flip. Start checking the internal temp when the crust starts looking good. By the time it reaches 120-130F, you should have a nice crust. You will start getting some smoke at this point, due to the rendered fat, but it won't be nearly as much as more traditional methods.\n\nLet them rest for 5-10 minutes. \n\nThis actually works. I suppose you could do this in a carbon steel or cast iron as well, but I don't think stainless steel would work well here, it would probably stick initially until that crust is built up. \n\nI am not saying this is superior to a hot sear, butter baste, or reverse sear, or anything like that, I'm just saying it works, and creates barely any smoke.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/lieryw/this_is_for_those_who_are_looking_for_a_way_to/", "created_utc": 1613147907.0, "score": 581, "author": "96dpi", "num_comments": 44, "permalink": "/r/cookingforbeginners/comments/lieryw/this_is_for_those_who_are_looking_for_a_way_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "pure heaven", "selftext": "", "url": "https://i.redd.it/135zocn8bno31.jpg", "created_utc": 1569376055.0, "score": 579, "author": "makeupyourworld", "num_comments": 36, "permalink": "/r/cookingforbeginners/comments/d8wp2f/pure_heaven/", "html_title": ""}
{"title": "How do I make sandwiches at home taste more like deli sandwiches?", "selftext": "I’m celiac, so that limits the bread options, but the meat and cheese and lettuce and other toppings seem like they taste different at a subway or firehouse or deli than they ever do at home. What can I do differently?", "url": "https://www.reddit.com/r/cookingforbeginners/comments/gq3l13/how_do_i_make_sandwiches_at_home_taste_more_like/", "created_utc": 1590377488.0, "score": 578, "author": "tangerines-are-tasty", "num_comments": 127, "permalink": "/r/cookingforbeginners/comments/gq3l13/how_do_i_make_sandwiches_at_home_taste_more_like/", "html_title": "Reddit - The heart of the internet"}
{"title": "Up your taco game with homemade tortillas! You don't need any special tools and it's quick and simple.", "selftext": "If you have favorite authentic Mexican spot, you know how much of a difference fresh corn tortillas make when it comes to tacos. Now I won't claim my tortillas are as good as my favorite taqueria, but they are pretty dam close and way better than store-bought. Most recipes will call for a tortilla press or rolling pin, but I'll let you in on a secret: all you need to do is get the tortillas flat and thin and you can accomplish that easily with basically anything you have that's flat. I use my cutting board, but you could use a pan or sturdy plate. Hell, use a flat rock from the yard if you want to. Just get to squishing that wet corn flour.\n\n&#x200B;\n\n**Tools:**\n\nOne ziplock bag with the top and sides cut off\n\nOne mixing bowl\n\nOne cutting board or other flat and sturdy surface (plates, pans, cooking sheets, etc)\n\nOne skillet\n\n&#x200B;\n\n**Ingredients:**\n\n1 Cup Masa Harina (dried corn flour)\n\n1 Cup Water\n\n1 teaspoon Salt\n\n&#x200B;\n\n**Instructions:**\n\nMix together the Masa Harina and salt.\n\n&#x200B;\n\nForm a well in the center of the Masa.\n\n&#x200B;\n\nAdd 1/2 of the water and begin mixing by hand.\n\n&#x200B;\n\nSlowly add water until it forms into a firm dough ball that holds its shape. You may find that you need more water or that you may need less depending on your kitchen environment. \n\n&#x200B;\n\nPinch off a roughly golfball-sized piece of the dough and roll it into a ball until smooth.\n\n&#x200B;\n\nLay out the cut ziplock bag and place the dough ball onto one side. Fold the other half of the bag to cover the dough. \n\nOptionally, you can lightly dust the bag with flour or spray with a non-stick spray.\n\n&#x200B;\n\nPlace the cutting board on top of the covered dough ball and press straight down slowly, using your body weight.\n\nContinue until the tortilla is at your preferred thickness, roughly 1/8 of an inch.\n\n&#x200B;\n\nCarefully peel off the top of the bag. Place one hand underneath the bag and tortilla and flip it onto your other hand.\n\n&#x200B;\n\nGently peel off the second side the same as the first.\n\n&#x200B;\n\nPlace the tortilla on a skillet set to medium high. Cook for about 1 minute and flip, cooking for an additional minute.\n\n&#x200B;\n\nRemove and place on a towel-lined plate. As tortillas are cooked, place them in a stack on the plate and cover with the towel.\n\nCovering with the towel helps the tortillas steam with their residual heat, making them soft and pliable.\n\n&#x200B;\n\nTop with your favorite taco fillings and enjoy!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/jnwri7/up_your_taco_game_with_homemade_tortillas_you/", "created_utc": 1604496863.0, "score": 579, "author": "southerngentleman90", "num_comments": 52, "permalink": "/r/cookingforbeginners/comments/jnwri7/up_your_taco_game_with_homemade_tortillas_you/", "html_title": "Reddit - The heart of the internet"}
{"title": "The secret to next level cooking: Acid", "selftext": "When people talk about improving a dish, they normally focus on seasoning. No complaints there. But after that, something often gets forgotten. That is, the addition of an acidic element.\n\nMy top tip for (inexpensively) improving any savoury dish - and some sweet - is to add an acid of your choice, primarily vinegar (and there are hundreds of variations) or citrus (lemon, lime, grapefruit, bergamot) or pickles. And when I say any savoury dish, I mean any and all of them.\n\nThis small adjustment is an absolute gamechanger. Salt gives flavour intensity. **Acid gives it dimension.**", "url": "https://www.reddit.com/r/cookingforbeginners/comments/xi6cms/the_secret_to_next_level_cooking_acid/", "created_utc": 1663577171.0, "score": 576, "author": "idoze", "num_comments": 105, "permalink": "/r/cookingforbeginners/comments/xi6cms/the_secret_to_next_level_cooking_acid/", "html_title": "Reddit - The heart of the internet"}
{"title": "Petition to ban posts that don’t post the recipe also", "selftext": "So I see many delicious, simple fares here that I am wondering. “Hmm how they made it?” for inspiration, only to go into the comments sections for many people asking the same question but there is still no recipe in sight.\n\nIn some of the make-up subs I frequent, if people post a selfie but do not post the list of products they used to create that look, then the post gets deleted. Because that is a make up sub for people to look at other people’s make ip and get inspiration from. They didn’t want no Instagram 2.0 with people just posting selfies.\n\nLikewise, this is not a foodstagram page to take picture of what’s cookin’ tonight and post it here for likes and karma. The post should benefit the rest of the subreddit community also.\n\nSo I propose that pictures of food with no ingredients list or recipe or even describing How they made it be deleted. Who’s with me? 🙋‍♀️ HEY MODS", "url": "https://www.reddit.com/r/cookingforbeginners/comments/dxk8fe/petition_to_ban_posts_that_dont_post_the_recipe/", "created_utc": 1573980345.0, "score": 574, "author": "None", "num_comments": 29, "permalink": "/r/cookingforbeginners/comments/dxk8fe/petition_to_ban_posts_that_dont_post_the_recipe/", "html_title": "Reddit - The heart of the internet"}
{"title": "Gordon Ramsey Teaching Lazy Bachelors How To Cook A Basic Curry (I used to be one of these lazy bachelors who ate a tonne of fast food so can relate!)", "selftext": "", "url": "https://www.youtube.com/watch?v=606QlJ6uud0", "created_utc": 1547503247.0, "score": 567, "author": "studentjsd", "num_comments": 38, "permalink": "/r/cookingforbeginners/comments/ag0zgx/gordon_ramsey_teaching_lazy_bachelors_how_to_cook/", "html_title": "Teaching Lazy Bachelors How To Cook A Basic Curry | Gordon Ramsay - YouTube"}
{"title": "Easy No Bake Cheesecake With 3 Microwavable Toppings!", "selftext": "", "url": "https://i.imgur.com/ly5v3My.png", "created_utc": 1553177987.0, "score": 566, "author": "EmmasGoodies", "num_comments": 29, "permalink": "/r/cookingforbeginners/comments/b3r2zi/easy_no_bake_cheesecake_with_3_microwavable/", "html_title": ""}
{"title": "What is a “commonly” known fact about preparing certain foods that everyone should know to avoid getting sick/ bad food. ", "selftext": "So I had a friend tell me about a time she decided to make beans but didn’t realize she had to soak them for 24 hours before cooking them. She got super sick. I’m now a bit paranoid about making new things and I’d really like to know the things that other people probably think are common knowledge! Nobody taught me how to cook and I’d like to learn/be more adventurous with food. \n\nETA: so I don’t give others bean paranoia, it sounds like most beans do not need to be soaked before preparing and only certain ones need a bit of prep! Clearly I am no chef lol ", "url": "https://www.reddit.com/r/cookingforbeginners/comments/1fna7up/what_is_a_commonly_known_fact_about_preparing/", "created_utc": 1727058490.0, "score": 562, "author": "Woolama", "num_comments": 630, "permalink": "/r/cookingforbeginners/comments/1fna7up/what_is_a_commonly_known_fact_about_preparing/", "html_title": "Reddit - The heart of the internet"}
{"title": "Cooking Don'ts (No \"do's\" here)", "selftext": "Some things not to do when cooking:\n\n1. Do not put a potato in the oven to bake without wrapping it in aluminum foil. (I tried that once, it exploded)\n2. Do not test to see if grease or oil is hot enough by sticking your finger in it. (It healed, eventually)\n3. If using a brush to spread pizza sauce on your crust, do not shake out the brush afterwards. (That took me about 20 minutes to clean up)\n4. Do not put lighter fluid on your meat on the grill to get it took cook faster. (It doesn't work, and you have to throw the meat away)\n5. It doesn't take a dinner roll 2 minutes to heat up in a microwave on high. (It becomes charcoal, and all your smoke alarms go off)\n6. Cook your macaroni first before putting it in the oven and covering it with cheese. (Really, don't)\n7. Do not use habanero peppers in your salad. (Remember Jar Jar Binks' tongue in the Phantom Menace?)\n8. Get your water boiling before you put your spaghetti in it.\n9. Do not leave the plastic bag of gizzards etc. inside your turkey when you bake it.\n10. And finally, do not leave ice cream out to thaw.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/jbewzr/cooking_donts_no_dos_here/", "created_utc": 1602728241.0, "score": 566, "author": "None", "num_comments": 183, "permalink": "/r/cookingforbeginners/comments/jbewzr/cooking_donts_no_dos_here/", "html_title": "Reddit - The heart of the internet"}
{"title": "5 meals under $3.50 per serving from Walmart weekly Ads.", "selftext": "Hey all,\n\nI spent an hour putting together a meal plan for the next ten days. I found a list of discounted items while going through Walmart's weekly ads and then tried to create a meal around them. My goal was to cook healthy meals and keep each serving under $3.50. I ended up with five different meals and around 31 servings, totaling about $61. There are some repeating ingredients across the recipes, but I have listed them separately if you are only interested in one of them.\n\nI had fun looking up deals and coming up with recipes with the on-sale items. I was able to reduce my 10 day meal cost going from somewhere around $110 to $61. I'm going to start creating these plans weekly for myself and would be happy to share them with the community if anyone else is interested?\n\n**1. Salmon and Rice (3 servings)**\n\nTotal: $10.32 | $3.44 per serving\n\n- Great Value Long Grain Enriched Rice (1x bag) $1.26\n\n- Rising Tide Atlantic Salmon Fillets (1x bag) $7.24\n\n- Frozen Peas and Carrots (1x bag) $0.84\n\n- Frozen Broccoli (1x bag) $1.0\n\n**2. Spaghetti and Meatballs (5 servings)**\n\nTotal: $11.75 | $2.35 per serving\n\n- Ground Beef (1lb) $3.99\n\n- Great Value Italian Style Bread Crumbs (1x) $0.92\n\n- Great Value Spaghetti (2x 4servings) $0.82\n\n- Great Value Finely Shredded Parmesan Cheese (1x) $2.22\n\n- Sam's Choice Italia Pasta Sauce with Cherry Tomatoes (1x 5servings) $2.98\n\n- Garlic Powder (1x bottle) $0.98\n\n**3. Turkey Burgers with Mashed Potatoes and Gravy (6 servings)**\n\nTotal: $13.68 | $2.28 per serving\n\n- Butterball Original Seasoned Frozen Turkey Burgers (1x bag) $7.17\n\n- Great Value Gravy Mix, Brown (2x bag) $0.30\n\n- Hormel Homestyle Mashed Potatoes (2x bag) $2.98\n\n**4. Fried Rice with Shrimp (8 servings)**\n\nTotal: $14.32 | $1.79 per serving\n\n- Wild Gulf Medium Raw Shrimp (1x bag) $6.97\n\n- Great Value Less Sodium Soy Sauce (1x bottle) $1.32\n\n- Green Onions (1x bunch) $0.78\n\n- Great Value Large White Eggs (1x dozen) $1.38\n\n- Great Value Long Grain Enriched Rice (1x bag) $1.26\n\n- Frozen Peas and Carrots (2x bag) $0.84\n\n- Garlic Powder (1x bottle) $0.98\n\n**5. Chicken Soup (8 servings)**\n\nTotal: $11.52 | $1.44 per serving\n\n- Chicken Tenderloins (1lb) $3.96\n\n- Chicken Broth (2x bottle) $1.22\n\n- Carrots (1lb) $0.98\n\n- Celery Stalk (1x pack) $1.38\n\n- Onion (1x) $0.78\n\n- Great Value Long Grain Enriched Rice (1x bag) $1.26\n\n- Italian Parsley (1x bunch) $0.78\n\n\nEdit: I wasn’t expecting such a positive response haha A few people suggested creating a sub to share more posts like this so that’s just what I did! Check out r/MealRecipes for more discounted meal recipes 🍽", "url": "https://www.reddit.com/r/cookingforbeginners/comments/nrpq81/5_meals_under_350_per_serving_from_walmart_weekly/", "created_utc": 1622759042.0, "score": 561, "author": "Zanadil0", "num_comments": 33, "permalink": "/r/cookingforbeginners/comments/nrpq81/5_meals_under_350_per_serving_from_walmart_weekly/", "html_title": "Reddit - The heart of the internet"}
{"title": "Mods: Can we setup a biweekly cooking challenge?", "selftext": "Speaking as regular user, I feel like the hardest step is taking feedback or tips and actually using them. If we had a biweekly/monthly challenge with a chosen dish, we could all cook it and submit our pictures/feedback.\n\nI'm thinking we set it up so we can reply to a stickied comment with recipe examples and all the header comments would be submissions. \n\nI wouldnt mind helping run this as well if we need more support. I feel like the challenge is its own reward, but I guess we could have custom flair too.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/n43y8d/mods_can_we_setup_a_biweekly_cooking_challenge/", "created_utc": 1620067604.0, "score": 553, "author": "psuedoPilsner", "num_comments": 45, "permalink": "/r/cookingforbeginners/comments/n43y8d/mods_can_we_setup_a_biweekly_cooking_challenge/", "html_title": "Reddit - The heart of the internet"}
{"title": "250 kg of pasta are too much for 3 people?", "selftext": "I am not very good at balance the quantity of food needed", "url": "https://www.reddit.com/r/cookingforbeginners/comments/i5gv1p/250_kg_of_pasta_are_too_much_for_3_people/", "created_utc": 1596817450.0, "score": 555, "author": "Dom11halfelf", "num_comments": 102, "permalink": "/r/cookingforbeginners/comments/i5gv1p/250_kg_of_pasta_are_too_much_for_3_people/", "html_title": "Reddit - The heart of the internet"}
{"title": "First post: mashed potatoes, peas and a rainbow trout. Pretty easy and very tasty.", "selftext": "", "url": "https://i.redd.it/uud0ecajxxj21.jpg", "created_utc": 1551634856.0, "score": 558, "author": "Dusty1000287", "num_comments": 36, "permalink": "/r/cookingforbeginners/comments/awwat5/first_post_mashed_potatoes_peas_and_a_rainbow/", "html_title": ""}
{"title": "Easy Guide to Stir Fry", "selftext": "I saw [this guide](https://imgur.com/gallery/ESnbPr7) on Imgur for stir fry basics. I hadn't seen it on here before. Sorry if this is a repost.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/exbvjb/easy_guide_to_stir_fry/", "created_utc": 1580588009.0, "score": 550, "author": "Redraider0", "num_comments": 15, "permalink": "/r/cookingforbeginners/comments/exbvjb/easy_guide_to_stir_fry/", "html_title": "Reddit - The heart of the internet"}
{"title": "I’m a 17 year old who has done very little cooking throughout their life, but my parents want me to make them a meal all on my own this week to see how I do. Do you have any recipes I could completely fairly easily that also are impressive?", "selftext": "I wanna impress them slightly as the extent of my cooking has mostly been ramen and toast. I love watching cooking content online so I like to think I’ve picked up on some stuff, but I want to try a recipe that allows for some leeway but still gives a pretty banging meal. I don’t have much limitation with ingredients so anything helps. Thank you!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/fvgp7d/im_a_17_year_old_who_has_done_very_little_cooking/", "created_utc": 1586104740.0, "score": 544, "author": "Devjorcra", "num_comments": 140, "permalink": "/r/cookingforbeginners/comments/fvgp7d/im_a_17_year_old_who_has_done_very_little_cooking/", "html_title": "Reddit - The heart of the internet"}
{"title": "Would anyone be interested in regular cooking tips from a passionate home chef? Need any cooking advice? AMA.", "selftext": "Hey guys!  I just stumbled upon this lovely thread!  I'm a passionate home chef.  I'm rather adventurous in what I cook and I will literally spend days researching and prepping for dinner parties.  I love to use recipes as a way to explore places I've never been.  I also create, test, and rework my own recipes sometimes putting in months of work.  I've picked up a lot of good tips along the way and I'm wondering if you might like me to post random cooking tips now and then?\n\nLet me know!\n\nAlso, if you have any cooking questions today, fire away!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/cu1d8p/would_anyone_be_interested_in_regular_cooking/", "created_utc": 1566497994.0, "score": 546, "author": "GronkVonHaussenberg", "num_comments": 243, "permalink": "/r/cookingforbeginners/comments/cu1d8p/would_anyone_be_interested_in_regular_cooking/", "html_title": "Reddit - The heart of the internet"}
{"title": "Cool website to search for recipes based off ingredients you already have at home!", "selftext": "This is a really cool and easy way to use up those leftover ingredients you have had sitting in your cupboard and fridge! \nLink: https://tonightsrecipe.com", "url": "https://www.reddit.com/r/cookingforbeginners/comments/eazi8c/cool_website_to_search_for_recipes_based_off/", "created_utc": 1576419939.0, "score": 546, "author": "None", "num_comments": 16, "permalink": "/r/cookingforbeginners/comments/eazi8c/cool_website_to_search_for_recipes_based_off/", "html_title": "Reddit - The heart of the internet"}
{"title": "Parsnip, the ‘Duolingo for cooking’ would like to help you achieve your New Year’s cooking resolutions.", "selftext": "Our cooking app for beginners, [Parsnip](http://parsnip.ai/), was born out of this very subreddit. Your comments and feedback have been very useful for figuring out what beginners want to learn how to cook.\n\nToday, we are interested in discovering *why* you want to cook. Do you have a personal goal to cook more at home? What is driving you to learn or blocking you from achieving your goals? What can we do to help get you in the kitchen?\n\nLet’s discuss your culinary journeys, no matter how big or small, and prop each other up with encouragement and support. We would love to play our part in helping you achieve your New Year's resolution.\n\n(Oh and as always, feel free to ask any questions about cooking)", "url": "https://www.reddit.com/r/cookingforbeginners/comments/zrmax4/parsnip_the_duolingo_for_cooking_would_like_to/", "created_utc": 1671629766.0, "score": 547, "author": "EligibleSpatula", "num_comments": 115, "permalink": "/r/cookingforbeginners/comments/zrmax4/parsnip_the_duolingo_for_cooking_would_like_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "Today I learned that when you are boiling water for potatoes, pasta, veg, what have you...", "selftext": "...that, once the water has reached a full boil, you can turn the heat down by a decently large amount, and the water will continue to be a boil.\n\nNo more boiling over pots for me!\n\nMy dad says it’s because of “thermodynamics”.\n\nI call it...magic.\n\n😂😂😂", "url": "https://www.reddit.com/r/cookingforbeginners/comments/suxqv0/today_i_learned_that_when_you_are_boiling_water/", "created_utc": 1645127921.0, "score": 545, "author": "Severe-Draw-5979", "num_comments": 76, "permalink": "/r/cookingforbeginners/comments/suxqv0/today_i_learned_that_when_you_are_boiling_water/", "html_title": "Reddit - The heart of the internet"}
{"title": "EASY 12 Layer Chocolate Cake ( No special pan required )", "selftext": "", "url": "https://i.imgur.com/0D0gF5z.jpg", "created_utc": 1549551025.0, "score": 548, "author": "EmmasGoodies", "num_comments": 28, "permalink": "/r/cookingforbeginners/comments/ao4h0m/easy_12_layer_chocolate_cake_no_special_pan/", "html_title": ""}
{"title": "Here's my lazy one-pot Carnitas recipe. Almost no cleanup too. What's your favorite one-pot recipe?", "selftext": "Carnitas are incredible and I love making them the traditional way, which is to fry them and slow cook them in lard. However, sometimes I don't have lard on hand or easily available and let's be honest, I'm also very lazy. You can absolutely make this with sautee'd onions and garlic. You can for sure fry up the carnitas for a little extra texture. But you don't have to in order to have fall-apart, delicious pork. And if someone bullies you for using a basic recipe, let me know and I'll give them a stern talking-to.\n\n&#x200B;\n\nSlow Cooker Carnitas\n\nIngredients:\n\n\\- 3-5 Pounds pork shoulder, cut into a few chunks\n\n\\- 3 tablespoons canola or vegetable oil\n\n\\- 6-8 ounces Mexican Coke (the kind you drink)\\*\n\n\\- 2 tablespoons citrus juice (orange, lime, or lemon)\n\n\\- 2 teaspoons garlic powder (or 6 cloves of crushed fresh garlic)\n\n\\- 1 1/2 teaspoons ground Cumin\n\n\\- 1 1/2 teaspoons Chile Powder\n\n\\- 1 1/2 teaspoons Onion Powder\n\n\\- 1 teaspoon dried Oregano\n\n\\- 4 teaspoons salt\n\n\\- 1 1/2 teaspoons ground black pepper\n\n\t\\*Be sure it's the kind with Cane Sugar, not Corn Syrup. If needed, sub in broth\n\nInstructions:\n\n\\- Divide pork shoulder into chunks so that it can fit into your slow cooker or pot.\n\n\\- Coat the bottom of the pot with oil and toss in the pork shoulder. Spread remaining oil over the meat to coat evenly. Generously add seasonings, mixing and rubbing as you go, until all of the meat is covered.\n\n\\- Mix in the citrus and Mexican Coke (or broth). The meat should be about halfway covered.\n\n\\- Cook on low for about 6 hours, or high for about 3 hours until the pork easily shreds.\n\n\\- Enjoy!\n\n**Notes:**\n\n\\- This is the lazy version. If you feel sassy and want to take them up a notch, roast the pork (before slow cooking) at 450f in a high-rimmed baking sheet (it will release a lot of juices) for 15-20 minutes, or until it's developed a browned crust. Then add the pork along with the juices into the slow cooker or pot.\n\n\\- Another option is to quickly pan fry the pork after it finishes cooking. And I mean quickly, otherwise you'll lose all of that tenderness you put in all that work for. Well, not physical work, this is super easy. I mean the work it takes to smell it cooking all day and refrain from digging in early.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/jwgiqa/heres_my_lazy_onepot_carnitas_recipe_almost_no/", "created_utc": 1605709009.0, "score": 539, "author": "southerngentleman90", "num_comments": 55, "permalink": "/r/cookingforbeginners/comments/jwgiqa/heres_my_lazy_onepot_carnitas_recipe_almost_no/", "html_title": "Reddit - The heart of the internet"}
{"title": "Order matters! Add your spices to the pan before the liquid when making soups, sauces, or stews.", "selftext": "Certain spices, including herbs, release more flavor in fat than in water. Cooks Illustrated did an [experiment](https://www.cooksillustrated.com/how_tos/6581-blooming-in-oil-for-flavor) where they found up to 10x more flavor compounds when spices and herbs were steep in oil than fat. So cool, right?!\n\nPlus fat is magical. It carries flavor and permeates it throughout the dish. This is especially great for whole spices, like fennel seeds, where you can taste the fennel even if you never have a bite with fennel seeds in it.\n\nSo always give your spices a chance to \"bloom\" directly in fat for 30 seconds. Whether that is with onions, carrots, and celery that you've been sauteing for a soup or ground beef you're browning in a pan for bolognese, add your spices before your liquid. That extra time with the fat will boost the flavor of your dish!\n\nYou'll smell the difference :)\n\n*If you like cooking tips like this, I share others like it in a weekly email newsletter called* [*Salt Sear Savor*](https://www.saltsearsavor.com)*.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/om4tw8/order_matters_add_your_spices_to_the_pan_before/", "created_utc": 1626530529.0, "score": 534, "author": "saltsearsavor", "num_comments": 52, "permalink": "/r/cookingforbeginners/comments/om4tw8/order_matters_add_your_spices_to_the_pan_before/", "html_title": "Reddit - The heart of the internet"}
{"title": "Focaccia is the best beginners bread - no kneading, basically no effort and very versatile as well", "selftext": "Ingredients:\n\n2 cups plain flour\n\n1 cup lukewarm water\n\nolive oil\n\n1 teaspoon of yeast\n\n1 teaspoon of salt\n\n\\+ extras like black pepper, oregano, thyme, ground up sun dried tomatoes, olives etc.\n\nInstructions:\n\n1. Mix flour, yeast, water, salt and any extras you're adding in (in the one I made today I added 6/7 minced sun dried tomatoes, some mixed herbs and black pepper)\n2. Lightly grease with olive oil, cover and leave in the fridge over night (12 hours roughly)\n3. The next morning deflate and transfer to a cast iron skillet or baking pan greased with a good glug of olive oil. Cover and leave for another couple hours (I usually wait 4 hours in time to bake for lunch).\n4. Preheat oven to 210 degrees celcius / 425 Fahrenheit.\n5. Before baking, use your finger to indent lots of crevices and drizzle with more olive oil (around 2 tablespoons). Sprinkle with a little salt and any other you want (I like more herbs and spices and stuff like that, you could even add some chilli oil!).\n6. Immediately put into the oven for 25-30 minutes.\n7. Enjoy!!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/h7ucdu/focaccia_is_the_best_beginners_bread_no_kneading/", "created_utc": 1592000027.0, "score": 533, "author": "Cherryday11", "num_comments": 26, "permalink": "/r/cookingforbeginners/comments/h7ucdu/focaccia_is_the_best_beginners_bread_no_kneading/", "html_title": "Reddit - The heart of the internet"}
{"title": "Recently I bought smoked salt. I tried seasoning a steak with this stuff like normal salt and let me tell you, terrible idea. With that said, how can I use this in cooking?", "selftext": "", "url": "https://i.imgur.com/Vnkf0ul.jpg", "created_utc": 1562702560.0, "score": 522, "author": "Kilgor_trout27", "num_comments": 63, "permalink": "/r/cookingforbeginners/comments/cb611t/recently_i_bought_smoked_salt_i_tried_seasoning_a/", "html_title": ""}
{"title": "Hey everyone, here in France, on the 2nd of February we celebrate \"La Chandeleur\" (Candlemas), where it's traditional to eat crêpes for an entire day.I wanted to share my family's recipe so you guys can celebrate too! They are really easy and fun to make.", "selftext": "As well as being delicious, this crêpe batter is superior to other batters because you don't need to let it rest before making crêpes and you don't need to butter the pan between each crêpe.\n\nIf you're interested, I've made a whole video on the history of Candlemas and how to make crêpes, which you can checkout here: [https://www.youtube.com/watch?v=ddqvAM1AAyg&lc=UgyCNeDz5CfXh2VRW7p4AaABAg](https://www.youtube.com/watch?v=ddqvAM1AAyg&lc=UgyCNeDz5CfXh2VRW7p4AaABAg)\n\nOtherwise, here is the recipe.\n\nFor 24 crêpes, you will need:\n\n\\- 250g of Flour (0.55 lbs)\n\n\\- 60g of Butter (2.1 oz)\n\n\\- 5g of Salt (0.2oz)\n\n\\- 6 Whole Eggs\n\n\\- 600ml of Milk (2.5 cups)\n\n\\- 4tbsp of Water\n\n\\- 4tsp of a Strong Liquor (such as Cognac or a Dark Rum)\n\n(The original recipe asked for twice as much salt but that was too much. If the crêpes feel bland, add a pinch of salt.)\n\n1. Heat your milk on a medium-low stove up until it's just about to boil. Do not let it boil as milk spills over very easily.\n2. While your milk is heating, put your flour in a large bowl, make a hole in the middle, break your eggs into it, and whisk them together. When the flour and eggs are well combined, add the water, salt, and liquor, and whisk again.\n3. When your milk is warm enough, take it off the stove, add the butter and mix them together. When the butter is melted, slowly pour it into your batter while vigorously whisking the batter as to avoid forming lumps.\n\nVoilà! Your dough is now ready. As I've said before, you can immediately use it to make crêpes, which are a great and fun way to spend an afternoon with friends and family.\n\nTo make a nice crêpe, take a shallow and wide pan (22 cm/8.5 inches) and put it on high heat. Put some butter in the pan and once it's melted, grease the whole pan with a piece of paper. You only need to butter the pan for its first crêpe. When the pan is nice and hot, take your batter, whisk it again to mix incorporate any flour that fell to the bottom (I recommend doing that regularly), take a large scoop of batter and pour it onto your warm pan. Spread it evenly, let it stick a second or two, and then pour any excess batter back into the bowl.\n\nLet the crêpe cook for a couple of minutes. Once the crêpe sticks off by itself, you can flip it. I recommend just picking it up with your fingers for that. Let it cook for a minute or two on the other side and enjoy it warm with any spread you like.\n\nAs a topping, I strongly recommend trying out \"Crème de Marron\" or brown sugar with lemon.\n\nBon appétit!\n\nI really hope you give these a try. They are tasty, easy and fun to make and you can put any toppings you like on them so it's really a great way to spend an afternoon with friends and family.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/aksurb/hey_everyone_here_in_france_on_the_2nd_of/", "created_utc": 1548713819.0, "score": 527, "author": "None", "num_comments": 39, "permalink": "/r/cookingforbeginners/comments/aksurb/hey_everyone_here_in_france_on_the_2nd_of/", "html_title": "Reddit - The heart of the internet"}
{"title": "Stove Top Pizza with Simple from Scratch Dough (Recipe in comments)", "selftext": "", "url": "https://imgur.com/JjMgdaB", "created_utc": 1551795754.0, "score": 527, "author": "CookWithEyt", "num_comments": 17, "permalink": "/r/cookingforbeginners/comments/axlo9a/stove_top_pizza_with_simple_from_scratch_dough/", "html_title": ""}
{"title": "Learn from my mistake: Cooked potatoes don't go in the freezer!", "selftext": "I had half a bag of potatoes sitting around about to go bad, so I thought \"Hey, I'll just put them in the slow cooker with some spices and freeze them after for later!\"\n\nWell I took them out of the freezer the other day and let them sit in the fridge to thaw. Once they were unfroze they were mushy mush! I didn't understand where I went wrong until i googled.\n\nTurns out the high water content in cooked potatoes makes them turn into goo when you freeze/unfreeze them.\n\nSo learn from my mistake and don't ruin a batch of potatoes!\n\nMaybe this is common knowledge to most, but for a beginner cook like myself I had to learn the hard way...\n\n\nEDIT:\n\nthanks for all the tips guys! Wish I consulted this sub first before ruining my potatoes. Good to know they can be frozen with the right prep and if used right away. Thank you!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kk0y09/learn_from_my_mistake_cooked_potatoes_dont_go_in/", "created_utc": 1608910990.0, "score": 523, "author": "None", "num_comments": 37, "permalink": "/r/cookingforbeginners/comments/kk0y09/learn_from_my_mistake_cooked_potatoes_dont_go_in/", "html_title": "Reddit - The heart of the internet"}
{"title": "Dinner last night. Trying new foods", "selftext": "", "url": "https://i.redd.it/r4nv4xddyxn31.jpg", "created_utc": 1569069055.0, "score": 522, "author": "atvlouis", "num_comments": 35, "permalink": "/r/cookingforbeginners/comments/d79w4l/dinner_last_night_trying_new_foods/", "html_title": ""}
{"title": "Fried up last night's roasted potatoes with seasoned salt, smoked paprika, garlic powder, and black pepper to make some great home fries. With bacon and fluffy scrambled eggs!", "selftext": "", "url": "https://i.redd.it/wuvyxn5ymvy31.jpg", "created_utc": 1573835335.0, "score": 517, "author": "makeupyourworld", "num_comments": 18, "permalink": "/r/cookingforbeginners/comments/dwt4vp/fried_up_last_nights_roasted_potatoes_with/", "html_title": ""}
{"title": "I eat a microwaved potato and a bean & cheese burrito every day. That's it. I need guidance", "selftext": "I have an ungodly amount of cheese and sour cream with both of them, but here's the kicker: I'm lactose intolerant. I don't feel super great. I don't remember the last time I ate a vegetable.\n\nI need simple meals that I can either make in the microwave, or in a batch to eat as leftovers. Sometimes I make an Americanized goulash and that works well for batch meals but.. I put cheese on top of it too :( I think I may have a dairy addiction if that's possible.\n\nAnyone have some simple meals? I can follow instructions, like I've made a filet mignon before that came out good, I just don't have much motivation.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/ijjalr/i_eat_a_microwaved_potato_and_a_bean_cheese/", "created_utc": 1598817430.0, "score": 516, "author": "FriedPost", "num_comments": 89, "permalink": "/r/cookingforbeginners/comments/ijjalr/i_eat_a_microwaved_potato_and_a_bean_cheese/", "html_title": "Reddit - The heart of the internet"}
{"title": "30 years old and don’t know where to start, like really basic stuff", "selftext": "I feel at a compete loss. I’m 30 years old and have decided enough is enough of frozen oven meals and microwave dinners. I try to eat healthier by making micro meals but their downfall is salt content. \n\nI can cook a steak, Maggi chicken in the oven and a boiled egg and that is as far as my knowledge goes. It’s embarrassing. If something doesn’t tell me how long I have to cook it for on what shelf and gas Mark number I can’t do it. I can’t even fry or poach an egg and I don’t know where to start with it all this late in life. \n\nI’m such a novice I don’t even know what utensils I need, currently all I own is a saucepan and a frying pan, what’s a good range of things I need for beginner cooking. Do I need a wok or can you make stir fry in a frying pan? Do I need a baking dish?\n\nGrateful for any advice or links to websites/videos that will help with inspiration. I have looked here and online but I get so overwhelmed or no recipes I like (pasta, lasagne, chicken, burger, steak, spaghetti, fajitas, curry are my main likes). \n\nAnother thing as a beginner I’ve never quite got my head around is how do you safely reheat food in the microwave. I see lots of people people take left overs to work the next day and they’re all fine but I worry about food poisoning. Is it really safe to reheat chicken in the microwave etc? It would improve my diet so much at work rather than having a sandwich and crisps 5 days a week. \n\nThanks.\n\nEdit: thanks so much for everyone’s help. Really appreciate all the inspiration and motivation. Hopefully I can get an update here in a few months once I’ve had a good crack at it. Some great starting points here. Thanks everyone!", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kucq8b/30_years_old_and_dont_know_where_to_start_like/", "created_utc": 1610277310.0, "score": 511, "author": "Exxtraa", "num_comments": 200, "permalink": "/r/cookingforbeginners/comments/kucq8b/30_years_old_and_dont_know_where_to_start_like/", "html_title": "Reddit - The heart of the internet"}
{"title": "First time making omelets! Spinach, cherry tomatoes, onion, bacon, and cheese.", "selftext": "", "url": "https://i.redd.it/ezboioqxo4v31.png", "created_utc": 1572201570.0, "score": 514, "author": "katXOmichele", "num_comments": 33, "permalink": "/r/cookingforbeginners/comments/dnxlfj/first_time_making_omelets_spinach_cherry_tomatoes/", "html_title": ""}
{"title": "LPT: HelloFresh has their recipes listed", "selftext": "Odd time to notice this but my mom did the mom thing and sent me her free box from HelloFresh, it's not bad but I noticed they do have the ingredients + recipes listed online. Would suggest them for finding ideas.\n\nhttps://www.hellofresh.com/recipes/apricot-balsamic-glazed-pork-tenderloin-5d14d4ab7ae20d00092cd50b", "url": "https://www.reddit.com/r/cookingforbeginners/comments/fkqrqt/lpt_hellofresh_has_their_recipes_listed/", "created_utc": 1584543298.0, "score": 514, "author": "rologies", "num_comments": 20, "permalink": "/r/cookingforbeginners/comments/fkqrqt/lpt_hellofresh_has_their_recipes_listed/", "html_title": "Reddit - The heart of the internet"}
{"title": "Here's how I make perfect copycat Egg McMuffins at home. It's easy, cheaper, and better.", "selftext": "[Here's the short video version](https://youtu.be/easwekHnUCg)\n\nYou can make a perfect Egg McMuffin at home in less time than it takes to go through the drive through. This tastes just like what you get from the golden arches, except better. If you aren't convinced to try it yet, it's also way cheaper, about $1 per McMuffin. So now that I've got your attention, let's make one.\n\n**Ingredients:**\n\nEnglish Muffin\n\n1 Egg\n\nA splash of milk or water\n\n1 Slice American Cheese (or any kind if you want to change it up)\n\n1 Slice Canadian Bacon\n\n1 Pinch each Salt and Pepper\n\nA little butter (optional but recommended, we are recreating fast food)\n\n**Instructions**\n\n1. Heat skillet or griddle over medium heat. Melt in butter and add in each English Muffin slice side down. Toast until lightly browned, about 1 minute, and set aside.\n2. Melt in a bit more butter and add Canadian Bacon to the pan. Let sizzle for about 30 seconds per side or until it's crisped up how you prefer. If it starts to cup up, you can press down on it to get even coverage.\n\n\\*Note: If you are using a larger skillet or griddle, steps 1 and 2 can be done at the same time.\n\n3. While cooking the other ingredients, grease a microwave-safe mug with cooking spray or just a bit of vegetable oil and crack in an egg. Add a splash of milk or water (don't skip this part, it helps get a fluffy texture in the finished egg), as well as a pinch of salt and pepper. Whisk together until combined.\n\n4. Set your microwaves power to Medium (using High can result in a rubbery egg), and microwave in 30 second intervals until set, but still light and fluffy. For 1 egg, this takes about 1 minute in my microwave, so just a couple of rounds.\n\n5. Assemble the muffin sandwich with cheese, egg, and Canadian bacon. Add the whole thing back to the still-warm pan, cover, and let steam for about 30 seconds. Enjoy!\n\n**Notes:**\n\nI had to use my small skillet because my larger one is in the shop, but even doing this one piece at a time only took me about 5 minutes. If you have a larger cooking surface, it's easy to do everything at once and have it done in 3.\n\nIf you want to cook multiple eggs at once in the Microwave with this method, use the biggest mug you can and follow the same instructions with up to 3 eggs. Keep a closer eye on them as they rise as they cook, and fall a bit as they cool. Once done, you'll be left with a beautiful E G G C Y L I N D E R. Slice it into circles of your preferred size. Looks weird in cylinder form, but once cut, each one is perfect for the muffin.", "url": "https://www.reddit.com/r/cookingforbeginners/comments/kdlsrq/heres_how_i_make_perfect_copycat_egg_mcmuffins_at/", "created_utc": 1608039216.0, "score": 509, "author": "southerngentleman90", "num_comments": 49, "permalink": "/r/cookingforbeginners/comments/kdlsrq/heres_how_i_make_perfect_copycat_egg_mcmuffins_at/", "html_title": "Reddit - The heart of the internet"}
{"title": "I want to put together a cookbook with the dishes I used to feed myself and others while in college.", "selftext": "I am talking simple dishes with minimum tools and few ingredients that can serve many dishes.  The book will focus on a few techniques that can produce a variety of dishes, and will follow up with shopping lists to produce a month's worth of food for 2-4 broke hombres.  \n\nThis would be based on the cooking I did for me and a roommate while I was in college.  We were/are big guys, and I fed both of us for $100/month.  These days would be closer to $150/200.\n\nCheap, delicious, fulfilling, and not vegan/vegaterian.  Is there interested", "url": "https://www.reddit.com/r/cookingforbeginners/comments/n1lpyy/i_want_to_put_together_a_cookbook_with_the_dishes/", "created_utc": 1619754770.0, "score": 506, "author": "withouta3", "num_comments": 38, "permalink": "/r/cookingforbeginners/comments/n1lpyy/i_want_to_put_together_a_cookbook_with_the_dishes/", "html_title": ""}
{"title": "Shepherds pie (with Guinness gravy out of the picture) for my first home cooked meal with the help of my girlfriend! Gotta thank my family and my brother for helping me with putting the right flavors together", "selftext": "", "url": "https://i.redd.it/a3204tdo9bg31.jpg", "created_utc": 1565743462.0, "score": 516, "author": "NoFoodOnTheFlohr", "num_comments": 19, "permalink": "/r/cookingforbeginners/comments/cq27iv/shepherds_pie_with_guinness_gravy_out_of_the/", "html_title": ""}
