{"title": "How I accidently became a healthy eater and why it's been so easy to keep doing it", "selftext": "DISCLAIMER: This post got removed from r/HealthyFood and I got permanently banned for questioning it. I am willing to risk to be banned here too. I just thought I'd share my experience. No ill will intended.   \n\\---  \n \n\nIt must have been around 3 years ago,  when I saw my girlfriend pour something like 300g of sugar into a  mixing bowl to bake a cake (that we would typically finish in one or two  days). She was following the recipe and didn't really think about it. I  don't bake much at all, so I just casually said \"whoa that's a lot of  sugar\". This was probably the first time she started questioning her  (and my) sugar intake and over the following months she started  following this health-food-movement that's been popping up all over  social media in her home country.The principles are easy: Reduce sugar,  read the labels, try to avoid processed foods. We kind of tried to do  that here and there, and she already started feeling much better both  physically and mentally. I still hadn't really bought in, because it  seemed like too much effort and I wasn't really overweight or  experiencing any health problems anyway.\n\nFast  forward to March 2020 and opportunity struck. Suddenly I am working  from home, saving 90 minutes a day on commute. Time which I can invest  to cook my own meals instead of eating Chinese take-out or hot dogs or  some supermarket-junk at work. No more coke machine in the hallway. No  more chocolate treats at the front desk when entering the office. No  after-work beers or weekends out drinking.\n\nWhen  my country first went into lockdown in March, we started making  shopping lists for the week so we'd only have to leave the house once a  week. We came up with fully planned out meal plans for the next 10 days  or so, and we started getting more and more creative. We were getting  recipes off the internet, sharing pictures with friends and family, it  even got to a competitive level when sharing our home-made food-porn.\n\nIt's also a fact that, if you're cooking from scratch, healthy recipes are way easier to make than junk food.\n\nSo  at this point we're thinking more about our eating habits and we're  checking the ingredients of all the stuff we buy at the supermarket. We  follow two simple principles: What's the sugar content per 100 grams?  Can we pronounce all of the ingredients that are listed?\n\nHere are some random facts:\n\n* The store-brand product often has less sugar and fewer artificial preservatives than the trusted brand name product.\n* \"light\" or \"diet\" products often have higher sugar content than the full-fat stuff (e.g. yoghurt)\n* soft drinks and fruit juices are basically poison\n* you  can eat as much chocolate as you like, as long as you stick to high  cocoa percentage. (50 g sugar per 100 g in your classic milk-chocolate,  13 g sugar per 100 g in our favourite store-brand 85% dark chocolate)\n* you can't eat (or drink) what you don't buy\n* your mom's christmas cookie recipe? Cut the sugar in half and try if you notice a difference. We certainly didn't!\n\nI'll  still have a can of coke here or there, but I am aware that coke has 11  g of sugar per 100 ml. For a 330 ml can that's 36 g or roughly 100% of  the WHO recommended free sugar intake per day. I won't buy more than one  can at a time, so I don't have the opportunity to consume more.\n\nAll  in all, cooking from scratch has been really fun and we have come up  with so many recipes, that we're now collecting them in our own cookbook  that we'll give away as christmas presents to our families. Our meat  consumption is down, but who doesn't love bacon... and we'll have  something like home-made wings twice a month and of course fish once or  twice a week.\n\nSince quarantine  started I lost 6 kilos without ever feeling hungry or even trying to  lose weight. The last time I had a BMI of 21 must have been probably  around age 20 (I am now in my mid-30s). I have never been someone who  works out, this hasn't changed with Covid either. I've been working from  home since March and it's really been a revelation for my physical  well-being.\n\nTLDR: Reduce sugar, read labels, profit.", "url": "https://www.reddit.com/r/healthyeating/comments/k8j9d3/how_i_accidently_became_a_healthy_eater_and_why/", "created_utc": 1607356848.0, "score": 290, "author": "klaymens", "num_comments": 32, "permalink": "/r/healthyeating/comments/k8j9d3/how_i_accidently_became_a_healthy_eater_and_why/", "html_title": "Reddit - The heart of the internet"}
{"title": "The mental (addictive) aspect of food", "selftext": "Does anyone else struggle with emotional eating habits?  At some point in my life (for reasons I can elaborate on if needed) I linked \"relaxation\" with food.  Especially after a hard day of work or stressful situation the ability to sit down and indulge in an unhealthy meal makes me feel like \"ahhhh I can relax...I deserve this\".  The feeling of having a BIG meal especially something unhealthy seems to do the trick but healthy meals or smaller portions just don't give me the same feeling.\n\nWhen I was younger I seemed to get by ok with this method...but in the last couple years it's really caught up with me.\n\nI know what I eat to do but whenever I think about it, the emotional aspect seems to get in my way.  I think to myself \"how will I relax or decompress without this coping mechanism?\"\n\nI know that a common answer is to find other ways to cope...and I get that...but I've tried those things before and they just don't seem to do the trick in the same way.\n\nHas anyone dealt with something similar and overcome the tendency?  Will I eventually get used to it?  Or is it just something I'll always struggled with?", "url": "https://www.reddit.com/r/healthyeating/comments/ei7908/the_mental_addictive_aspect_of_food/", "created_utc": 1577819162.0, "score": 237, "author": "cass2769", "num_comments": 54, "permalink": "/r/healthyeating/comments/ei7908/the_mental_addictive_aspect_of_food/", "html_title": "Reddit - The heart of the internet"}
{"title": "Short student survey about healthy eating", "selftext": "Hi everyone!  I have a short [survey here](https://docs.google.com/forms/d/e/1FAIpQLSdBhyG15oJisgZW44I5XcrWjaSj5CZML5QqgtyVGqDfTdBT5w/viewform?usp=sf_link) regarding healthy eating habits.  This is for a school project.\n\nI apologize if this is the wrong place to post.  If you have any additional comments or feedback feel free to comment below :)", "url": "https://www.reddit.com/r/healthyeating/comments/f6cr8q/short_student_survey_about_healthy_eating/", "created_utc": 1582128233.0, "score": 155, "author": "amusingpine", "num_comments": 55, "permalink": "/r/healthyeating/comments/f6cr8q/short_student_survey_about_healthy_eating/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to eat healthier when my husband won't?", "selftext": "I used to be the fittest person. I ate plenty of fruits and vegetables. I drank tons of water and I ate mainly fish or chicken. I never ate fried food. Then I started dating this guy who always ate out. I would normally get a salad or something. Well we got married and I thought if I tried to cook at home he eat at home. I have tried so many times to make vegetables. He will only eat broccoli and that is if he is in the mood. He will eat baby carrots but now he has turned on that. He eats only apples if it is in a pie.  He loves red meat. He could take or leave chicken. I have ried these different recipes so we will both eat something but there is always a complaint. The only way he will eat vegetables is if we are eating out somewhere and it is fried. He doesn't like texture of mash unless red potatoes and those have to be garlic with tons of salt. I have compromised and started eating more like him and I have paid for it. I'm not healthy anymore and I've gained 40lbs since we were married. He told me that was my own darn fault not his. Do I just need to make separate meals for us for now on? What should I do because its a losing battle.", "url": "https://www.reddit.com/r/healthyeating/comments/eirkl9/how_to_eat_healthier_when_my_husband_wont/", "created_utc": 1577930702.0, "score": 142, "author": "blondy508", "num_comments": 48, "permalink": "/r/healthyeating/comments/eirkl9/how_to_eat_healthier_when_my_husband_wont/", "html_title": "Reddit - The heart of the internet"}
{"title": "My doctor asked me to cut sodium, sugar and carbs. I need help finding foods that I could eat 😬", "selftext": "", "url": "https://www.reddit.com/r/healthyeating/comments/dzev07/my_doctor_asked_me_to_cut_sodium_sugar_and_carbs/", "created_utc": 1574315564.0, "score": 137, "author": "ThePartTimeVegan", "num_comments": 231, "permalink": "/r/healthyeating/comments/dzev07/my_doctor_asked_me_to_cut_sodium_sugar_and_carbs/", "html_title": "Reddit - The heart of the internet"}
{"title": "Poor diet for entire life/sugar addicted", "selftext": "Hi, I'm a 25 year old woman. My entire life I have eaten garbage. I grew up on tv dinners and mcdonalds. When I was 16 I started vegetarianism and just started eating baked goods and I have not stopped. Lately I have been addicted to starbucks, it's awful because I drink super sweet lattes and cookies.  I'm spending money that I don't have on things that are ruining my life. I'm overweight for the first time in my life, I feel like absolute garbage.\n I want to get healthy but I have no idea what to eat! If anyone has any easy vegetarian recipes please share them with me. I'm a student so things that are quick and easy to take to school would be really helpful. \nThank you! \nPs. I'm especially concerned with my health at this point being that 3 of my grandparents died from heart disease and my dad and twin brother have type 2 diabetes. I do not have type 2 diabetes and need a drastic change in my diet to keep it that way.", "url": "https://www.reddit.com/r/healthyeating/comments/e9e3hp/poor_diet_for_entire_lifesugar_addicted/", "created_utc": 1576102161.0, "score": 120, "author": "Jude1294", "num_comments": 51, "permalink": "/r/healthyeating/comments/e9e3hp/poor_diet_for_entire_lifesugar_addicted/", "html_title": "Reddit - The heart of the internet"}
{"title": "I finally went nutritionist a week ago. This is my journey", "selftext": "I was skinny when I young. After 20, my Behcet disease makes an attack on my left leg veins. (deep vein thrombosis). That's why I quit dancing. My moves decreased. Behcet disease brings a lot of problems for me. In addition, I have different health problems too. \n\nBla Bla Bla Bla... I got fat. My highest weight 94kg 207 lbs. At his point, I started a diet. I and my wife paid attention to what we ate. We started the gym. we lost weight. \n\nBut this was not enough for me and my health problems. We decided we will go to nitritionist. \n\nNitritionist prohibits the cereals, dairy products and dried legumes (of course junk food too)\n\nNow, i am at -10kg-22lbs. I think I'm having the die off syndrome. I do not know when it ends but i am motivated.\n\nSorry my english mistakes.\n\nUpdate: this diet is so hard. I messaged my nutritionist and ask her if this prohibits are forever?\nShe said \"No. This era is detox are. After 6 weeks we will unleash some foods will be available.", "url": "https://www.reddit.com/r/healthyeating/comments/f3ew2b/i_finally_went_nutritionist_a_week_ago_this_is_my/", "created_utc": 1581620393.0, "score": 91, "author": "DominusTheMerciful", "num_comments": 24, "permalink": "/r/healthyeating/comments/f3ew2b/i_finally_went_nutritionist_a_week_ago_this_is_my/", "html_title": "Reddit - The heart of the internet"}
{"title": "Constantly overeating and feeling so guilty and disgusted", "selftext": "I never really noticed I'm over eating, now that I'm older it has impacted me more.\nI can't tell how often 1 gummi bear or a handful of chips have escalated and suddenly the bag is empty. How often i give in to impulses.\nExtremely often i keep on eating my dinner/lunch even though I'm already uncomfortably full. Even having to take breaks between bites. I always feel the need to finish my food because i don't want to waste any \n\nMost of the time i don't even notice it happening and will think back on it only days or weeks laters.\nWhen i do notice the guilt is physically painful. And still while writing this i feel the need to finish my dinner even though I'm already full.\n\nIt just happens so often. \n\nWhy can't i be stronger than this.\n\nHow do i make this stop", "url": "https://www.reddit.com/r/healthyeating/comments/mowwhm/constantly_overeating_and_feeling_so_guilty_and/", "created_utc": 1618167535.0, "score": 91, "author": "Green1234abc", "num_comments": 23, "permalink": "/r/healthyeating/comments/mowwhm/constantly_overeating_and_feeling_so_guilty_and/", "html_title": "Reddit - The heart of the internet"}
{"title": "Eating a diet rich in fruit and vegetables is associated with less stress, according to new research. The findings revealed people who ate at least 470 grams of fruit and vegetables daily had 10 per cent lower stress levels than those who consumed less than 230 grams.", "selftext": "[https://www.ecu.edu.au/news/latest-news/2021/05/eating-more-fruit-and-vegetables-linked-to-less-stress-study](https://www.ecu.edu.au/news/latest-news/2021/05/eating-more-fruit-and-vegetables-linked-to-less-stress-study)", "url": "https://www.reddit.com/r/healthyeating/comments/nddt3u/eating_a_diet_rich_in_fruit_and_vegetables_is/", "created_utc": 1621129708.0, "score": 85, "author": "None", "num_comments": 2, "permalink": "/r/healthyeating/comments/nddt3u/eating_a_diet_rich_in_fruit_and_vegetables_is/", "html_title": "Reddit - The heart of the internet"}
{"title": "Giving up alcohol for health reasons", "selftext": "I stopped drinking alcohol a few months ago for health and diet purposes and im so happy with my decision. Anyone else? \n\nAlso if anyone knows subreddits to help me keep it up that aren't about sobriety as an emotional thing /addiction i would really appreciate it. I've only seen addiction posts so far and thats not really my scene\n\nr/teetotal was a perfect fit for me, if anyone else is looking for this. Thanks u/redheadgemini", "url": "https://www.reddit.com/r/healthyeating/comments/jrsnfd/giving_up_alcohol_for_health_reasons/", "created_utc": 1605039465.0, "score": 89, "author": "atliticus98", "num_comments": 12, "permalink": "/r/healthyeating/comments/jrsnfd/giving_up_alcohol_for_health_reasons/", "html_title": "Reddit - The heart of the internet"}
{"title": "I've tracked my alcohol consumption daily for the last 5 months. Here's how building mindfulness about when and how much I drink has helped me improve my diet and overall health.", "selftext": "Exactly 20 weeks ago I set out on a mission to improve my drinking habits, with the belief that cutting back on my consumption could be a keystone habit for improving my overall quality of life. At the time I didn't feel like my drinking was out of control, but was noticing the effects of alcohol more in the form of bad nights of sleep, feelings on low energy and lost productivity, and beer belly that was becoming harder and harder to keep off.\n\nHere's how my drinks and dry days have trended since:\n\n&#x200B;\n\nhttps://preview.redd.it/3igbu8twh8c51.jpg?width=1074&format=pjpg&auto=webp&s=622693cdff2d29be4a5b416c3b35af8e0cbb3a52\n\nTo keep me on top of the tracking habit, I built Cutback Coach ([https://cutbackcoach.com](https://cutbackcoach.com/)), a simple text message system to track each drink. In the first few weeks, I was surprised to find that my starting intake was over 30 drinks a week, with just 1-2 dry days. Here's what my stats looked like in the first week of tracking:\n\n**Starting stats (week of 2/24/20)**\n\n* Total weekly drinks: 31\n* Total weekly dry days: 2\n* Alcohol calories per week: 4,650\n* Poor nights of sleep from drinking: 5\n* Money spent on alcohol: \\~$155/week\n\nThe calories and sleep metrics are the ones that really stood out to me. I was effectively adding 2 extra days of eating to my week in the form of alcohol, and costing myself less optimal sleep most nights of the week. Just this awareness served as great motivation to cutback.\n\n5 months of daily tracking later, I've been able to make a huge impact on my overall consumption, and I'm feeling the health benefits. Here's what a typical week looks for me now:\n\n**Last week's stats (week of 7/13/20)**\n\n* Total weekly drinks: 14\n* Total weekly dry days: 4\n* Alcohol calories per week: 2,100\n* Poor nights of sleep from drinking: 3\n* Money spent on alcohol: \\~$70/week\n\nTaking my first week as a baseline, the health improvements from this small behavior change have been massive.\n\n**What this means for my health (and wallet)**\n\n* I've cut calories from alcohol by 2,550 per week (basically a full day of eating)\n* I've added 2 extra nights of uninterrupted sleep to my week each week\n* I'm saving almost $100 a week that previously went to booze\n\nI still enjoy drinking, and as you can see from my trend chart above I do have heavier drinking weeks here and there. The difference is that now I feel that my habits are on my terms, and I'm much more mindful about when I decide to drink, and how much.\n\nI feel healthier, and am excited to keep this new path going.", "url": "https://www.reddit.com/r/healthyeating/comments/hva42f/ive_tracked_my_alcohol_consumption_daily_for_the/", "created_utc": 1595347685.0, "score": 77, "author": "nicknella", "num_comments": 21, "permalink": "/r/healthyeating/comments/hva42f/ive_tracked_my_alcohol_consumption_daily_for_the/", "html_title": "Reddit - The heart of the internet"}
{"title": "I always eat worse when I’m with my boyfriend...", "selftext": "I normally cook healthy for myself, limit my portions, and exercise. But whenever I spend more than a couple days at my boyfriend’s place I gain weight and just feel nasty. He’s a bigger dude so he goes really hard when it comes to food. Just enormous portion sizes. I don’t mind dating a bigger dude but it’s stressing me out because I feel anxious and out of control when I don’t have healthy eating options. I don’t know how I even tell him this without sounding like a giant dick. Advice?", "url": "https://www.reddit.com/r/healthyeating/comments/kbs1qk/i_always_eat_worse_when_im_with_my_boyfriend/", "created_utc": 1607790933.0, "score": 72, "author": "None", "num_comments": 6, "permalink": "/r/healthyeating/comments/kbs1qk/i_always_eat_worse_when_im_with_my_boyfriend/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to stop snacking so much?", "selftext": "I love cooking so my meals are usually balanced, healthy meals but i find that my snacking is a problem. There are never snack foods in the house because I never buy them when I go food shopping just out of habit and I know that if i did have like crisps or something in the house then they would be eaten way too fast.\n\nHowever I like like 3 minutes from my nearest shop and when i crave some doritos or something, I will easily get up and go buy some crisps and it because of the lockdown, i start to just want to snack all the time because I am bored and my mental health isn't that great.\n\nThis obviously isn't good for my body or my bank account so i'd really appreciate some advice.\n\nI am sure the most common advice would be to just stop (really helpful...) or to replace those with healthy snacks but I am worried that i will just eat the healthy snacks, still have those cravings and then go get the unhealthy ones and end up just eating more.", "url": "https://www.reddit.com/r/healthyeating/comments/jwidmp/how_to_stop_snacking_so_much/", "created_utc": 1605715293.0, "score": 71, "author": "nextcatagoryis", "num_comments": 64, "permalink": "/r/healthyeating/comments/jwidmp/how_to_stop_snacking_so_much/", "html_title": "Reddit - The heart of the internet"}
{"title": "How can I stop eating junk food?", "selftext": "First of all, I've beaten a few bad habits in the past. The most effective way has proven to be making it harder for myself to access whatever I'm addicted to. And that's exactly why this time it's so hard.\n\n&#x200B;\n\nI still live with my family. They really love junk food. All the time there is a ton of sweets, chips, chocolate etc laying around. I am a student and don't have a job, so moving out is out of the question, even though it would be the best thing to happen to me. All members of my family have health issues related to diet and they still don't change anything at all about it. I'm always asking them not to buy junk, but of course no one listens to me.\n\n&#x200B;\n\nI have very little willpower, so I don't know what to do while being surrounded with junk food, really. I always lose with this. If you have any advice, please share it.", "url": "https://www.reddit.com/r/healthyeating/comments/ld8zi1/how_can_i_stop_eating_junk_food/", "created_utc": 1612537446.0, "score": 67, "author": "memyk", "num_comments": 24, "permalink": "/r/healthyeating/comments/ld8zi1/how_can_i_stop_eating_junk_food/", "html_title": "Reddit - The heart of the internet"}
{"title": "About my last post.", "selftext": "I recently posted about my confusion about my diet, and I want to thank everyone for your replies.\n\nOn closer inspection I think I’ve found the problem, I forgot to factor in the amount of calories in the garlic and herb dips I usually use when I eat chicken. I completely forgot to even consider it.\n\nIt turns out there are 675 calories in 100ml of the dip, and I used over half of the 100ml dip every time I had chicken (every day). They are also high in fat.\n\n Also I may have been miscalculating the amount of seeds and nuts I eat because of the way I measured them.\n\nSince stopping the dips and altering the measurement of seeds I have, I have some how lost about 5 pounds.", "url": "https://www.reddit.com/r/healthyeating/comments/fe37xe/about_my_last_post/", "created_utc": 1583446700.0, "score": 69, "author": "AnOddFad", "num_comments": 4, "permalink": "/r/healthyeating/comments/fe37xe/about_my_last_post/", "html_title": "Reddit - The heart of the internet"}
{"title": "What foods can I eat as much of, without the worry of any weight gain?", "selftext": "I already have had cucumbers and eggs, made popcorn with coconut oil, and that’s it. What else are snacks that have barely any repercussions for eating, I can prep or buy anything too.", "url": "https://www.reddit.com/r/healthyeating/comments/lx8ha4/what_foods_can_i_eat_as_much_of_without_the_worry/", "created_utc": 1614817808.0, "score": 65, "author": "IWannaLiveBetter", "num_comments": 31, "permalink": "/r/healthyeating/comments/lx8ha4/what_foods_can_i_eat_as_much_of_without_the_worry/", "html_title": "Reddit - The heart of the internet"}
{"title": "My body is a garbage fire. What are your favorite healthy, delicious, \"clean eating\" foods?", "selftext": "I am beyond exhausted and have been horrible with self care for the last two years (getting my degree and working full time). Stress has been through the roof and sleep and good eating have been few and far between. Same for exersize.\n\nMy body feels horrible all the time -- digestive stuff, sleep issues, nausea, headaches, anxiety, and just general blugh malaise. Now that I'm almost done, I want to take better care of myself. I drink a ton of water, but I need help getting my eating back into a good place. \n\nTldr: what are your favorite clean, healthy, delicious foods? Bonus points if cooking is kept to a minimum (I'm an assembler, not a cooker). I eat everything and I love vegetables, I just haven't eaten one since school started. TIA!!!", "url": "https://www.reddit.com/r/healthyeating/comments/hft48n/my_body_is_a_garbage_fire_what_are_your_favorite/", "created_utc": 1593115595.0, "score": 64, "author": "Olivejacks", "num_comments": 23, "permalink": "/r/healthyeating/comments/hft48n/my_body_is_a_garbage_fire_what_are_your_favorite/", "html_title": "Reddit - The heart of the internet"}
{"title": "I would rather continue to eat nothing, than eat foods that I hate.", "selftext": "I’ve been doing intermittent fasting (16:8 or 20:4) to lose weight, but it hasn’t been going well. I’ve noticed I’m going to have to start eating healthy foods when I’m not fasting, but I just have this weird toxic mindset about food.\n\nEating something unhealthy but tasty after fasting = i’ve earned it, its not even 1200 calories, I’m enjoying it, it tastes good\n\nEating something healthy after a fast: this tastes bad / bland, I’m getting no enjoyment out of it, **and** I’m adding calories? What the eff is the point? Why not just keep fasting??\n\nHow do I stop seeing food as something to enjoy, and start seeing it as nothing but fuel?", "url": "https://www.reddit.com/r/healthyeating/comments/g5u0v1/i_would_rather_continue_to_eat_nothing_than_eat/", "created_utc": 1587526991.0, "score": 63, "author": "None", "num_comments": 14, "permalink": "/r/healthyeating/comments/g5u0v1/i_would_rather_continue_to_eat_nothing_than_eat/", "html_title": "Reddit - The heart of the internet"}
{"title": "Does any one else sometimes read the subreddit as health yeating.", "selftext": "", "url": "https://www.reddit.com/r/healthyeating/comments/sq8h6r/does_any_one_else_sometimes_read_the_subreddit_as/", "created_utc": 1644610506.0, "score": 61, "author": "QuestionDistributor", "num_comments": 7, "permalink": "/r/healthyeating/comments/sq8h6r/does_any_one_else_sometimes_read_the_subreddit_as/", "html_title": "Reddit - The heart of the internet"}
{"title": "STORY: I feel completely different now I'm healthy", "selftext": "Just thought I would share a story with you all. So I was living for the past year in an apartment in my uni town and we didn't have a fridge/freezer (my fault, silly money saving decision which... didn't save money aha) which I thought would lead me to eat less meat and dairy but really just resulted in me spending a year eating junk food as it was impossible to meal prep or store fresh food.  \n\n\nNow I've moved and started over, I have a glorious fridge/freezer and have been eating healthy meals, 3x a day, with healthy snacks such as banana/yogurt/honey (begone: pot noodles and samosa!) for the last month. It was a rough adjustment as the sudden change in my diet lead me to have cramps for the first week but then it all evened out. My girlfriend says I have noticeably lost weight (yay!) but yesterday was a very stressful day and, without going over my calorie limit, I had a burger with chips and a nutella crepe.  \n\n\nTHIS MORNING I FEEL HUNGOVER. PROPERLY HUNGOVER - AND I DON'T DRINK ALCOHOL AT ALL.  \n\n\nI'm in shock, firstly at how my body now is very very unhappy with eating junk food whereas previously it was my whole existence but more how I never realized I used to feel this mentally sluggish and slow every day and got used to it! I remember now I used to wake up every morning and need 3 hours to slowly wake up. Eating healthily is like suddenly the lights have switched on in my brain. I'm never going back. Ever. This isn't about how my body looks anymore, this is about owing it to myself to have my brain thriving every day.\n\n&#x200B;\n\nTLDR - was unhealthy for a whole year. Now I'm much healthier. Had a junk food meal last night for the first time in ages and I'm shocked at how awful I feel the next morning as a result and now I notice the magnitude of change to my life eating healthily has made.", "url": "https://www.reddit.com/r/healthyeating/comments/l3a03u/story_i_feel_completely_different_now_im_healthy/", "created_utc": 1611398759.0, "score": 56, "author": "None", "num_comments": 5, "permalink": "/r/healthyeating/comments/l3a03u/story_i_feel_completely_different_now_im_healthy/", "html_title": "Reddit - The heart of the internet"}
{"title": "Mexico supplies 47% of the US's fruit imports and 63% of its vegetable imports. They are about to get 25% more expensive due to the Trump Tariffs", "selftext": "Sources:\n\n[https://www.ers.usda.gov/amber-waves/2024/october/growth-in-mexico-s-horticultural-exports-to-the-united-states-continued-even-as-new-u-s-food-safety-laws-took-effect](https://www.ers.usda.gov/amber-waves/2024/october/growth-in-mexico-s-horticultural-exports-to-the-united-states-continued-even-as-new-u-s-food-safety-laws-took-effect)\n\n[https://www.apricitas.io/p/trumps-blockade-of-america](https://www.apricitas.io/p/trumps-blockade-of-america)", "url": "https://www.reddit.com/r/healthyeating/comments/1j3hp0u/mexico_supplies_47_of_the_uss_fruit_imports_and/", "created_utc": 1741112842.0, "score": 57, "author": "floyd1728", "num_comments": 10, "permalink": "/r/healthyeating/comments/1j3hp0u/mexico_supplies_47_of_the_uss_fruit_imports_and/", "html_title": "Reddit - The heart of the internet"}
{"title": "I've lived on pasta and takeout basically my whole life - how do I start eating better? More details in post.", "selftext": "So to start I don't need to lose weight at all, I simply want to increase my nutrition and stop eating empty calories that don't actually do anything for my body. \n\nI understand the basics of healthy eating - eat whole, unprocessed foods in these categories: veggies/fruits, whole grains, proteins, and healthy fats. The problem is.. \n\nI don't know how to cook for one, and two I don't know how to combine these properly. At all. I seem to only find info about what individual items to eat but not when/how and in what combination if that makes sense. I'm 20 and living at home with family that only really eats stuff like pizza, burgers, steak etc so that's why I have *no* frame of reference and feel totally lost. \n\nI have wanted to start eating better for a long time and the only reason I haven't is because I'm honest to god clueless and don't know how to start. My diet is a mess and has no consistency. Like I don't know what a proper healthy meal looks like. So I'll have a piece of fruit, or roast some veggies, or something but then end up not having enough calories for the day if that's all I eat. A typical day for me is like.. a banana/apple for \"breakfast\" (I don't eat at the same time every day so I just mean first meal of the day) and takeout at \"dinner\". Like I said there's no consistency, I don't even eat 3 times a day because I don't get hungry that often and I tend to eat a lot at dinner. Or ill eat pasta or something. \n\nBasically I'm an idiot that doesn't know how to eat like a normal person lol. \n\nI'm looking for some specific advice or links to recourses for dummies about what/how to eat healthily. I hope this post makes sense.", "url": "https://www.reddit.com/r/healthyeating/comments/n7wnyn/ive_lived_on_pasta_and_takeout_basically_my_whole/", "created_utc": 1620502374.0, "score": 56, "author": "None", "num_comments": 18, "permalink": "/r/healthyeating/comments/n7wnyn/ive_lived_on_pasta_and_takeout_basically_my_whole/", "html_title": "Reddit - The heart of the internet"}
{"title": "What frozen fruits are best for ice cream substitutes?", "selftext": "I absolutely love frozen blueberries as an alternative to frozen sweet stuff, but I was wondering what other fruits are good for that. Strawberries aren’t great because they get way too solid and impossible to bite through, so anything that I can grab and eat while still frozen is what I’m looking for.", "url": "https://www.reddit.com/r/healthyeating/comments/fljtci/what_frozen_fruits_are_best_for_ice_cream/", "created_utc": 1584658976.0, "score": 52, "author": "eslieee", "num_comments": 28, "permalink": "/r/healthyeating/comments/fljtci/what_frozen_fruits_are_best_for_ice_cream/", "html_title": "Reddit - The heart of the internet"}
{"title": "Why does eating healthy seem SO hard?", "selftext": "I feel as though eating healthy is so hard. For so long, I've been told \"Oh, eating lean and healthy is so expensive it's just not realistic.\" Or \"It's too much of a hassle to plan your meals and cook them.\" I want to eat lean and healthy while also losing weight. Every time I get ready to change my diet, I go into the store and I get intimidated. I ask questions like \"what should I buy?\" \"How much of this stuff do I need to buy to last a full week?\" \"How do I even cook this stuff?\" \"Do I need to just eat the same exact thing every week?\" It's all just so confusing. And articles online aren't any better. They tell you to balance your diet and eat chicken and broccoli and that's basically the whole article. I don't know how to educate myself on these things but I want to learn so bad. Any tips?", "url": "https://www.reddit.com/r/healthyeating/comments/lty5ld/why_does_eating_healthy_seem_so_hard/", "created_utc": 1614462558.0, "score": 50, "author": "Extra-Milk69", "num_comments": 17, "permalink": "/r/healthyeating/comments/lty5ld/why_does_eating_healthy_seem_so_hard/", "html_title": "Reddit - The heart of the internet"}
{"title": "Made the mistake of too large a deficit, my metabolism slowed", "selftext": "I'm doing intermittent fasting, but I'm getting all my nutrients plus a daily multi vitamin.  I think I accidentally did too much of a deficit cause I got tired of counting calories and now I think my metabolism has slowed.  I've learned my lesson and am upping my food intake, but I'd like to figure out how to get my metabolism back to a healthy place.  Any tips?  Or am I good just by eating at a good level and letting it naturally rise to its normal place?", "url": "https://www.reddit.com/r/healthyeating/comments/fjafw1/made_the_mistake_of_too_large_a_deficit_my/", "created_utc": 1584313451.0, "score": 51, "author": "None", "num_comments": 11, "permalink": "/r/healthyeating/comments/fjafw1/made_the_mistake_of_too_large_a_deficit_my/", "html_title": "Reddit - The heart of the internet"}
{"title": "I’m 5’10 just over 200 pounds and I’m 19, I’m making a commitment to go back to the gym and shred and be consistent but my dietary choices keep holding me back.", "selftext": "Just have a question for y’all on how to quit processed carbs and sugary drinks for good. I know it doesn’t happen overnight but if any of y’all know or have any tips for me to follow please let me know! As soon as this quarantine bullshit stops and it’s safe to go out in public again I’m hitting the gym and staying consistent this time instead of going for 4 months and then quitting. If y’all have any tips on how to keep that processed garbage off please let me know!", "url": "https://www.reddit.com/r/healthyeating/comments/fpnb2q/im_510_just_over_200_pounds_and_im_19_im_making_a/", "created_utc": 1585269609.0, "score": 49, "author": "Jdrg245", "num_comments": 13, "permalink": "/r/healthyeating/comments/fpnb2q/im_510_just_over_200_pounds_and_im_19_im_making_a/", "html_title": "Reddit - The heart of the internet"}
{"title": "Easier to eat healthier during lockdown?", "selftext": "Hey everyone! Is it easier for you to eat healthier since you have more time to prepare it at home, or are you feeling more of an urge to just start snacking with unhealthy snacks because there’s a lot of free time? Or is there no change to your usual diet?", "url": "https://www.reddit.com/r/healthyeating/comments/fmsim1/easier_to_eat_healthier_during_lockdown/", "created_utc": 1584845310.0, "score": 51, "author": "zfarooqui7", "num_comments": 51, "permalink": "/r/healthyeating/comments/fmsim1/easier_to_eat_healthier_during_lockdown/", "html_title": "Reddit - The heart of the internet"}
{"title": "My eating habits are all messed up...need someone to knock some sense into me", "selftext": "Heads up this will probably be long.  I don't think I've ever written about this in detail so I'll probably ramble.\n\nAbout me: mid 30s female.  I became aware of my weight for the first time about age 6.  My mom was heavy and spoke about it openly...so I guess that's how it got into my head.  I was average weight as a kid but got chubby in 3rd grade.  Got teased for it and kind of started to hate my body.  I also matured early so started developing around that time...got my first period at age 10 in 4th grade.  Bad acne and started getting anxiety attacks (gosh isn't puberty fun!).  My body sort of felt like the enemy.  But I was really into dancing back in those days so I had a strange dichotomy of hating my body and enjoying it at the same time.  The \"chubby\" phase didn't last too long...I was a little overweight but as I became a teenager no one seemed to be bothered by that.  I also was dealing with anxiety issues.  Those issues sometimes made it difficult for me to eat...this helped keep my weight in check but also made it so that no one wanted to mention anything about my eating habits bc they k re it was a sensitive subject for me.  In high school I always wanted to lose like 5 lbs.  I was about 5'5\" and about 140.  I think I wore like a size 8 or 10...so quite average.  I never had much in the way of boobs but carried most of my weight in my hips/thighs/butt (which probably made me look thinner than I was).  I started to feel a little more comfortable in my body during these years.... especially when I got a boyfriend and saw how attracted he was to my body.\n\nOk, so, fast forward.  I was in my 20s and my weight fluctuates a lot. My highest is probably 170 lowest is probably 130.  The low points always seem to come during periods of anxiety or heartbreak.  I'm working an office job so I don't get much exercise that way.  I try some hardcore diets like paleo and have good success but when I attempt to go back to more moderate ways of eating, I always backslide and undo everything.  I try to consistently work out but don't have much success with that.  Basically I can do hard core perfection in terms of diet and exercise for like a month at a time but after that I seem to go off the rails.\n\nSo now I'm in my 30s and things are different.  The lowest my weight has been in the last several years has been like 155.  This was after a breakup where I lost some weight.  Unfortunately I have gained all of that back plus some.  I'm now hovering around 180.  I'm still only five foot five so this is not ideal.  I've started working out more consistently and eating healthier overall... But nothing seems to be changing.  I think I'm finally facing the facts that my body has just changed, my metabolism has slowed down, and making small changes are just not enough anymore to get me where I want to be.\n\nSo where does that leave me?  I need to make some larger changes and they need to be long-term.  I have the memories of hardcore diets from years past and I don't want to go that route again.  I'd like to find a way that I can eat healthier the majority of the time and with smaller portion sizes overall.  But I also know myself well enough that, if I try to restrict myself too much, when I do take a break or a cheat or whatever you want to call it...my tendency is to go overboard and have a hard time getting back on the healthy bandwagon.  So how do I moderate that tendency.\n\nFor me I think tracking is key.  I don't really want to track calories or macros or anything... But I do think tracking certain things might be helpful.  For example, I know some people do a cheat day once a week...while I like the idea of building some flexibility into the diet from the start, one day a week doesn't sound ideal.  I'd rather just give myself 3 cheat meals a week (or something similar) that I can use when I want.  So I don't feel that binge feeling of wanting to go nuts on the cheat day. \n\n I've tried this method before and had some limited success.  But here is what happened that didn't work:\n\n1) I think there is a piece of my brain that is a little bit obsessive and a bit of a perfectionist (I'd imagine it's probably the same part of my brain that's prone to anxiety).  So there were times in the past when I had planned for a cheat meal and when the time came my brain sort of stopped wanting it...I sort of thought to myself \"let me hold off on this for now and see how much longer I can go without a cheat\".  Not a big deal in theory but I think that when I do this too much it pushes me in the direction of trying to be too perfect with my eating... Which then can lead to a binge when I make a \"mistake\".  \n\n2) I start to play games in my head about what constitutes a \"cheat\".  When I'm thinking about it logically it seems pretty obvious.  But in the moment, especially if I'm super hungry, I start to blur the lines of what I'm \"allowed\".  An example would be something like \"there were cookies at work and I had two of them... Does that constitute a cheat?  It was only a couple of cookies...no big deal\".  Or it might be something like \"I really want the salad with fried chicken but I should eat grilled chicken instead... Surely doing the fried chicken instead of the grilled doesn't necessitate using a cheat meal...it's a salad afterall\".  these are just a couple of examples but it can lead to a slippery slope or the lines between healthy and cheat are blurred.\n\nAnd that's Ultimately what fucks me up so much.  I don't like the idea that certain foods are inherently bad or good.  Food is food and my goal should just be to focus on eating healthy MOST of the time.  But my brain wants what it wants and I've learned that I just don't do moderation very well.  So if I don't do moderation well and extreme diets also aren't my thing what else is there?  \n\nI know I've been rambling for awhile now.  And I feel like overall I'm getting a little obsessed with food.  Which is completely the opposite of the goal.  Yesterday my partner and I we're talking about wanting to lose weight in the new year... And we started talking about different diet options we could do.  We started making rules for this new diet...and my first questions were about what \"cheats\" we had built in.  It seems so counterintuitive because I should be focusing on all the healthy things I'm going to do not all of the few instances where I won't do those healthy things.  But that is the way my brain goes every time I try to make these changes \n\nAnyway...enough rambling.  If anyone out there has any advice...would love to hear it", "url": "https://www.reddit.com/r/healthyeating/comments/egla84/my_eating_habits_are_all_messed_upneed_someone_to/", "created_utc": 1577502543.0, "score": 51, "author": "cass2769", "num_comments": 15, "permalink": "/r/healthyeating/comments/egla84/my_eating_habits_are_all_messed_upneed_someone_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "Let's quit drinking coke", "selftext": "I need some accountability. My boyfriend is such an enabler. I don't think it would solve all my problems but it's a great place to start. Let's try to do 30 days. If you don't have a problem with sodas but you have something else you'd like to change for 30 days, let's do it!", "url": "https://www.reddit.com/r/healthyeating/comments/ow9ei1/lets_quit_drinking_coke/", "created_utc": 1627887781.0, "score": 49, "author": "msreginalewis", "num_comments": 19, "permalink": "/r/healthyeating/comments/ow9ei1/lets_quit_drinking_coke/", "html_title": "Reddit - The heart of the internet"}
{"title": "I’m morbidly obese and have a heart issue. I need to get healthy and food has always been an issue for me. Can I get some help?", "selftext": "So I’m 31, 6’2”, 355 lbs, and I had a heart attack a few months ago. I quit drinking energy drinks and pop, but I’m not losing weight, and I actually gained a few pounds since my heart attack. I’ve never been good at knowing how to eat healthy and what not and I don’t have a lot of time to really learn it. I was told I wouldn’t make it to 40 if I didn’t get my act together so I’m here for help with planning meals that I can make and are healthy. I usually do fast food because if the lack of time and ease to just go through a drive thru.\n\nSo I’m looking for good healthy meals but I have a family of 5 that I need to feed so I have a budget that I need to stick to and it needs to be ideally be quick to make. I don’t want to cut out meat entirely, red or otherwise, but outside of that I’m pretty open. So what are some good meal ideas for breakfast, lunch, and dinner, with breakfast and lunch being more of a grab and go thing. I’ve been skipping breakfast when I can but I don’t think that is helping, and I eat either a turkey and cheese wrap with mustard on a whole wheat tortilla or a tuna sandwich from Jimmy Johns for lunch. Are these ok or should I do something different?\n\nI just need help, and I’m new to this, so please bear with me as I ask questions and try to learn about all of this stuff. Please and thanks!", "url": "https://www.reddit.com/r/healthyeating/comments/m74eg4/im_morbidly_obese_and_have_a_heart_issue_i_need/", "created_utc": 1615998793.0, "score": 48, "author": "SarcasticOP", "num_comments": 20, "permalink": "/r/healthyeating/comments/m74eg4/im_morbidly_obese_and_have_a_heart_issue_i_need/", "html_title": "Reddit - The heart of the internet"}
{"title": "All our decisions are influenced by your environment (e.g. your House!) - some tips on how to sort your house out to support you to make good decisions on eating healthier", "selftext": "A. If you walked into a room that only had no food on the counter and a microwave meal in the fridge\n\nB. If you walked into a room with just apples on the counter, microwave meal and a healthy prepared meal in the fridge\n\nYour decisions have been heavily influenced by the design of the room - what you would choose to do in scenario A and B are likely to be different. If you think about the design of your room beforehand you can encourage certain behaviours. There is a lot of research to show that humans tend to do whatever is the easiest thing... that's why supermarkets tap into this - The most profitable items are in the middle of the shelf where you can easily reach, the less profitable items are right at the bottom. Its only a small amount of extra effort but enough to influence you.\n\n[This video here](https://youtu.be/9jsdS2K0W6k) will give you more details about changing your environment but below is a good summary if you prefer to read :)\n\n&#x200B;\n\n**The principle for good environmental design is:**\n\n1. If you want to encourage a good behaviour make it as simple as possible\n\ne.g. Have a cold water tap installed / Always have a cold bottle of water available in your fridge\n\n2. If you want to discourage a bad behaviour make it as difficult as possible\n\ne.g. The frying pan is kept upstairs somewhere!\n\n&#x200B;\n\nI have applied some design decisions to my environment below to encourage or discourage my exercise and eating habits... please feel free to add more in the comments and ill chuck them in!\n\n1. Only have healthy food on display (fruits, nuts, Carrots...! )\n2. Remove all unhealthy food from your house - I need to walk a mile to get a coke!\n3. Place your unhealthy cooking equipment in a bag upstairs (frying pan, Pizza Cutter)\n4. I have my gym clothes laid out ready to go on a chair before i go to bed\n5. I have my coffee machine turn on at 7AM every day\n6. I prepare healthy full meals and healthy snacks in advance for impulse eating\n7. I have a pint of water next to my bed when i go to sleep and I need to finish it when i wake up", "url": "https://www.reddit.com/r/healthyeating/comments/hep83l/all_our_decisions_are_influenced_by_your/", "created_utc": 1592953409.0, "score": 50, "author": "richrjw", "num_comments": 2, "permalink": "/r/healthyeating/comments/hep83l/all_our_decisions_are_influenced_by_your/", "html_title": "Reddit - The heart of the internet"}
{"title": "Why the heck do I get nauseous when I'm hungry?", "selftext": "I've had this problem for a long time now - my stomach is very very sensitive. I throw up like twice a month just because I get super nauseous, especially in the evenings. When I get hungry, I sometimes start feeling like I'm gonna vomit. Whenever that happens, it prevents me from eating.\nSometimes, while I'm eating, I take one too many bites and have to throw up afterwards. All of that's happening despite the fact that I'm a very slow eater.\n\nHas anyone been experiencing the same thing? The hell am I doing wrong? I do not have any food allergies.", "url": "https://www.reddit.com/r/healthyeating/comments/g8cu2o/why_the_heck_do_i_get_nauseous_when_im_hungry/", "created_utc": 1587900707.0, "score": 46, "author": "ImmaNeedYouToStfu", "num_comments": 41, "permalink": "/r/healthyeating/comments/g8cu2o/why_the_heck_do_i_get_nauseous_when_im_hungry/", "html_title": "Reddit - The heart of the internet"}
{"title": "First time eating healthy with my boyfriend. We are college students on a budget, what are some good low carb, high fat high protein easy meals we can meal prep together?", "selftext": "Whenever I google “low carb high fat high protein” meals, intricate meals pop up and I have no idea where to even begin. Most of my life I’ve been healthy, I’ve also been blessed with a fast metabolism. However, university has made my health kind of take the back seat as all the cheap meals are normally crap. My boyfriend and I eat out frequently, but we are trying to become healthier, and he really wants to lose weight and exercise at the same time. I want meal prep ideas that are affordable for college students, but I have no idea where to start. :( does anyone have any ideas for us? We love eggs and avocado and chicken, but eating that 24/7 would be very boring. I’m also trying to gain muscle mass, so I’ll be consuming lots of protein hopefully. Does anyone have any ideas? This is my first time posting here too, I hope these types of questions are appropriate. Thank you in advance!", "url": "https://www.reddit.com/r/healthyeating/comments/f4ar9q/first_time_eating_healthy_with_my_boyfriend_we/", "created_utc": 1581780079.0, "score": 50, "author": "Miimmoouuu", "num_comments": 28, "permalink": "/r/healthyeating/comments/f4ar9q/first_time_eating_healthy_with_my_boyfriend_we/", "html_title": "Reddit - The heart of the internet"}
{"title": "Am I the only one who feels like healthy foods are expensive?", "selftext": "I know that in the long-term I won't end up spending lots of money in hospital and fixing health problems that I could have avoided but oh well\n\nEdit; thank you for all the great insights you have shared.", "url": "https://www.reddit.com/r/healthyeating/comments/nf94hb/am_i_the_only_one_who_feels_like_healthy_foods/", "created_utc": 1621340011.0, "score": 49, "author": "Mean_Isopod_309", "num_comments": 34, "permalink": "/r/healthyeating/comments/nf94hb/am_i_the_only_one_who_feels_like_healthy_foods/", "html_title": "Reddit - The heart of the internet"}
{"title": "I think i'm getting the hang of this.", "selftext": "For most of my life, I'd been underweight. My parents would force feed me when they thought I wasn't eating enough and tease me for being so skinny. I know they were just trying to get me to gain weight,  but this made me form a very bad relationship with food.I eat maybe once a day. A half a burger because I can't stomach the whole thing and lots of sweets. I have a very bad sweet tooth. I guess because my body is trying to get all the nutrients That I don't get from sugar. I know this isn't healthy but some days, snacks are the only things I can stomach. The sight of food occasionally makes me want to throw up. Recently,  I started a plan to gain weight. I set a goal for 2,000 calories a day (I was eating maybe 600 before) and it's going well I think. The goal is the gain 5 pounds per week. I think because I'm eating breakfast now, it stimulates my appetite because I'm ravenously hungry through out the day. I go over my calorie intake goal and typically consume about 2500-3000 calories. It's so weird to not be hungry. I had gotten so used to having hunger constantly in the background. I had gotten to used to ignoring my hunger cues. I'm up about 3 pounds. I know this isn't much but I'm proud of it. I went from barely eating anything to eating everything I can see. My goal is to go from my 105 to 135 in about 2 months. I'm still fairly new to this so advice would be appreciated. Is this a good plan? Should I do something differently?", "url": "https://www.reddit.com/r/healthyeating/comments/lgwdbe/i_think_im_getting_the_hang_of_this/", "created_utc": 1612971879.0, "score": 46, "author": "Godhelpmeplease12", "num_comments": 8, "permalink": "/r/healthyeating/comments/lgwdbe/i_think_im_getting_the_hang_of_this/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is Matcha tea possibly the healthiest drink in the world?", "selftext": "Theres been lots of studies showing regular green tea drinking reduces the risk of prostate cancer by 50%, breast by 30 or so and so many more benefits. Matcha is a step further, has way more antioxidants and also has a higher egcg content and amino acids like l theanine. Do you think if there was ever a long term study there could be shocking good results? I doubt there would be right now because I dont really think enough people have drank matcha everyday for 10 years which the green tea study involved.. because of the cost and also I believe more people see it as a delicacy.", "url": "https://www.reddit.com/r/healthyeating/comments/fkytfr/is_matcha_tea_possibly_the_healthiest_drink_in/", "created_utc": 1584571332.0, "score": 48, "author": "westanbritney", "num_comments": 11, "permalink": "/r/healthyeating/comments/fkytfr/is_matcha_tea_possibly_the_healthiest_drink_in/", "html_title": "Reddit - The heart of the internet"}
{"title": "The way I drink water has changed my life", "selftext": "I had no idea that drinking water before meals/snacks can be so life changing. I’m not the only one who didn’t know ab this before. I wasn’t paying attention to how ur supposed to drink water so I was eating and taking sips to make the whole process of enjoying food easier and I suffered of gerd (aka hiccups and heartburn after eating anything). \nSwitching to drinking my water few minutes before eating has made me feel a lot better. No more hiccups and heartburn to be seen. Also besides that I avoid drinking any liquids immediately after as well. Only a tiny sip if my mouth be feeling really dry, but other than that no liquids two hours after finishing the meals. I recommend this method to anyone who’s suffering of heartburn and any other stomach issues. \nScience behind it is simple. Drinking water together with ur food dilutes the digestive juices and you end up having too much acidity in ur stomach. This is when things get bad. So do this trick to let the digestive system do it’s job and you’re good to go. Hope this helps!", "url": "https://www.reddit.com/r/healthyeating/comments/rrpild/the_way_i_drink_water_has_changed_my_life/", "created_utc": 1640829942.0, "score": 44, "author": "None", "num_comments": 7, "permalink": "/r/healthyeating/comments/rrpild/the_way_i_drink_water_has_changed_my_life/", "html_title": "Reddit - The heart of the internet"}
{"title": "What happens to your body when you eat more Whole Foods, vegetables, fruits, and healthy sources of protein?", "selftext": "", "url": "https://www.reddit.com/r/healthyeating/comments/g08fg9/what_happens_to_your_body_when_you_eat_more_whole/", "created_utc": 1586738737.0, "score": 49, "author": "lovesadventures32", "num_comments": 7, "permalink": "/r/healthyeating/comments/g08fg9/what_happens_to_your_body_when_you_eat_more_whole/", "html_title": "Reddit - The heart of the internet"}
{"title": "Struggling to Quit Soda/Pop? Try this!", "selftext": "I loved the experience of drinking pop, so much that I'd drink one litre daily. Pepsi and Coca Cola were my favorite drinks and I always looked forward to them. Eventually, I decided that I wanted to quit, and it proved to be quite difficult as I missed the sound of cracking open cans, and the carbonation as well. I also loved the flavor.\n\nIt took a long while but what I discovered is that as my overall sugar intake decreased, my ability to control myself improved. I began eating more fruit as a healthy source of sugar, but my silver bullet is dark chocolate. I eat 4 blocks of it most days, always 70%, and combined with fruit I no longer require pop but I still drink it occasionally if I need a boost. I mostly drink water, peppermint tea, and flavored sparkling water such as Bubbly. It has no sugar or sugar substitutes, just carbonated water and \"natural flavor\". These drinks combined with dark chocolate and fruit have changed my diet for the better. I'm 6'1\" and I went from 240 pounds down to about 205 and I look and feel a lot better. Hopefully, this will help out a person or two as I know it can be quite a challenge to quit pop.", "url": "https://www.reddit.com/r/healthyeating/comments/ko6z0x/struggling_to_quit_sodapop_try_this/", "created_utc": 1609484281.0, "score": 48, "author": "BoardgameExplorer", "num_comments": 3, "permalink": "/r/healthyeating/comments/ko6z0x/struggling_to_quit_sodapop_try_this/", "html_title": "Reddit - The heart of the internet"}
{"title": "Kinda proud of myself today", "selftext": "So I'm really trying to work on my eating habits... My tendency is to not be very hungry during the day and then eat a lot in the evening... And often unhealthy food.  Sometimes though I do get hungry during the day at work and I usually run out and grab a sandwich or something... Which isn't terrible but I think I could do better.  And just letting myself get so hungry that I make bad decisions later in the day I think has been a contributing factor to my weight gain.\n\nI bought a small whiteboard which I stuck to the inside of my front door at home... And it just has a little note to myself to make sure I take my gym clothes, bottle of water, and healthy snacks with me to work.  That way I always have something healthy to snack on, water to drink so that I more easily avoid soda, and clothes to make sure I have no excuse for not going to the gym after work.\n\nToday I leveled up even further though. I went to the grocery store during the work day and stocked up on healthy snacks that I can keep in the office.  Most of it is stuff that won't go bad quickly... Some Lean cuisine individual pizzas, rice cakes, peanut butter, 100 calorie fruit and nut packages, cheese sticks, and raisins.  I'll probably also get in the habit of buying things like apples each week and keep those in the office too...but I didn't want to do that today considering it's a Friday and I won't be there all weekend.  \n\nOf course, sometimes when I have food on hand it's not appealing...but just having something so I don't get famished I think will be very helpful.  There is still cake and Christmas cookies in my office from the holidays... So having some snacks in the office made it easier to avoid those.\n\nAnyways just wanted to share a little triumph.", "url": "https://www.reddit.com/r/healthyeating/comments/ejok3b/kinda_proud_of_myself_today/", "created_utc": 1578097646.0, "score": 48, "author": "cass2769", "num_comments": 7, "permalink": "/r/healthyeating/comments/ejok3b/kinda_proud_of_myself_today/", "html_title": "Reddit - The heart of the internet"}
{"title": "Buying produce is intimidating because I don't know what I'm doing.", "selftext": "This post is a little embarrassing. I am 28 years old and I feel like I should know these things by now but I don't so here I am approaching internet strangers to teach me the basics I probably should have learned growing up.\n\nMy parents weren't the healthiest of eaters. Sometimes we had grapes, or tomatoes we grew in our back yard, but most often we got our veggies from cans or frozen bags at the grocery store. I have always been a picky eater. It's hard for me to find any fruits or vegetables that I can tolerate, but as I'm getting older I realize how important it is to change my habits. I think I was lucky to grow up with a high metabolism and a somewhat active lifestyle, but after having my son two years ago I haven't been in the best shape and health as I would like and I also want to instill a healthier lifestyle for him.\n\nMy question is rather broad. I'm wondering how you guys choose your fruits and vegetables, and how you wash them, and store them? What stays in the fridge? What can be left out? How long are things good for? What should I look for when buying various fruits and veggies? I know these are probably dumb questions, but sometimes I'm too intimidated to buy produce because I don't know what to do with them once I get them home, and this is why I feel stupid. Give me your best tips!\n\nTL;DR - How you choose (any) fruits and vegetables and how do you care for them once you bring them home?", "url": "https://www.reddit.com/r/healthyeating/comments/ejj9y7/buying_produce_is_intimidating_because_i_dont/", "created_utc": 1578075337.0, "score": 49, "author": "Llama_Llama_", "num_comments": 14, "permalink": "/r/healthyeating/comments/ejj9y7/buying_produce_is_intimidating_because_i_dont/", "html_title": "Reddit - The heart of the internet"}
{"title": "Ultra-processed foods are linked with chronic diseases and a higher risk of early death", "selftext": "*I'm an editor at The Washington Post and we just published a story about ultra-processed foods.* \n\n*Health columnist,* [Anahad O'Connor](https://www.washingtonpost.com/people/anahad-oconnor/) *writes:*\n\n\"Dozens of large studies, scientists have found that ultra-processed foods are linked to higher rates of obesity, heart disease, hypertension, type 2 diabetes, and [colon cancer](https://www.bmj.com/content/378/bmj-2021-068921). A recent study of more than [22,000 people](https://www.bmj.com/content/378/bmj-2022-070688) found that people who ate a lot of ultra-processed foods had a 19 percent higher likelihood of early death and a 32 percent higher risk of dying from heart disease compared with people who ate few ultra-processed foods.\n\nSo how do we break our dependence on ultra-processed foods? You can start by learning which foods in your diet count as ultra-processed. You don’t necessarily have to give them up. But once you know how to spot an ultra-processed food, it’s easy to find a less-processed substitute.\n\nAt their core, they are industrial concoctions containing a multitude of additives: salt, sugar and oils combined with artificial flavors, colors, sweeteners, stabilizers and preservatives. Typically they’re subjected to multiple processing methods that transform their taste, texture and appearance into something not found in nature. Think Frosted Flakes, Hot Pockets, doughnuts, hot dogs, cheese crackers and boxed macaroni & cheese.\n\nResearch shows that our bodies seem to react differently to ultra-processed foods compared with similar foods that are not so highly processed.\"\n\n*You can read the full story* [*here*](https://www.washingtonpost.com/wellness/2022/09/27/ultraprocessed-foods/?utm_source=reddit&utm_medium=social&utm_campaign=aviva)  \n*There's no paywall, although you may be asked to register for a free account.*", "url": "https://www.reddit.com/r/healthyeating/comments/xpl65o/ultraprocessed_foods_are_linked_with_chronic/", "created_utc": 1664295471.0, "score": 45, "author": "AvivaLoeb", "num_comments": 7, "permalink": "/r/healthyeating/comments/xpl65o/ultraprocessed_foods_are_linked_with_chronic/", "html_title": "Reddit - The heart of the internet"}
{"title": "Just starting to try and eat healthy, feels like 99.9% of the stuff at the grocery store is bad for me in some way", "selftext": "Trying to come up with a healthy diet but it seems like the only things at the grocery store that are actually healthy is bags of brown rice, lentils, and frozen vegetables.\n\nLooking at canned vegetables, anything in the frozen food section aside from veggies, or any of the dry boxed meals/sides, they all have 60% - 120% of the DV of sodium. Go through the produce aisle and look at a salad kit, the thing has 45g of added sugar.\n\nMost of the stuff that's marketed as \"healthy\" has crazy high sodium and a lot of the times sugar as well. What the hell is this", "url": "https://www.reddit.com/r/healthyeating/comments/uvnhsq/just_starting_to_try_and_eat_healthy_feels_like/", "created_utc": 1653263772.0, "score": 44, "author": "Laraso_", "num_comments": 11, "permalink": "/r/healthyeating/comments/uvnhsq/just_starting_to_try_and_eat_healthy_feels_like/", "html_title": "Reddit - The heart of the internet"}
{"title": "Am I doing any harm by eating non-breakfast foods for breakfast?", "selftext": "I don’t find traditional breakfasts foods particularly filling or exciting in the morning (ie cereal, toast, oatmeal) - so I’ve been eating foods typically reserved for lunch or dinner (ie: spinach ravioli, chicken salad) for late breakfast (10am). I feel a little naughty doing this, but I don’t really see a reason why it would be bad for me, especially if it’s same calorie count of traditional breakfast and usually less sugar/carbs. Am I doing something wrong? Is there any potential downfalls to this? \n\nThanks!", "url": "https://www.reddit.com/r/healthyeating/comments/go3l5l/am_i_doing_any_harm_by_eating_nonbreakfast_foods/", "created_utc": 1590089755.0, "score": 45, "author": "lacroiii", "num_comments": 21, "permalink": "/r/healthyeating/comments/go3l5l/am_i_doing_any_harm_by_eating_nonbreakfast_foods/", "html_title": "Reddit - The heart of the internet"}
{"title": "Can the health impacts of a bad diet be reversed?", "selftext": " I  don't eat the best (eat mostly sugary snacks throughout the day  especially during quarantine) and thus have been nervous about health  impacts from my god awful diet. I was wondering if eating healthy and  exercising can actually \"reverse\" any damages stemming from years of bad  eating (i.e. any artery damage and plaque buildup being reversed)? Or  rather does it simply stop any further damage from taking effect?", "url": "https://www.reddit.com/r/healthyeating/comments/na092l/can_the_health_impacts_of_a_bad_diet_be_reversed/", "created_utc": 1620748561.0, "score": 42, "author": "boiyo12", "num_comments": 9, "permalink": "/r/healthyeating/comments/na092l/can_the_health_impacts_of_a_bad_diet_be_reversed/", "html_title": "Reddit - The heart of the internet"}
{"title": "What are some of your most favorite \"healthy\" bedtime snacks?", "selftext": "I usually have a decent sized snack before I head to bed. My go to is usually 2 servings of greek yogurt with some creative mix. Sometimes it's berries, sometimes its peanut butter etc. I also like to have like half a cup of cottage cheese. \n\nHow about you guys?", "url": "https://www.reddit.com/r/healthyeating/comments/gzc9b0/what_are_some_of_your_most_favorite_healthy/", "created_utc": 1591663284.0, "score": 43, "author": "SumoDash", "num_comments": 20, "permalink": "/r/healthyeating/comments/gzc9b0/what_are_some_of_your_most_favorite_healthy/", "html_title": "Reddit - The heart of the internet"}
{"title": "How and what should I eat to keep my energy up? I barely have any as it is, but I’ve always lived a sedentary lifestyle", "selftext": "I’m taking on my second job... I work at Jimmy Johns part time, and I’ll be working at Chipotle soon part time. I have no idea how in the world I’m gonna keep my energy up to do chipotle. I work in the mornings at Jimmy Johns, and I’m thinking of working eve shift at chipotle. I get soooo sleepy and tired after Jimmy Johns, and it’s just 3-4 hours!! I’ve had my blood checked and everything, all good. Idk why I stay so drained all the time. I have also been forgetful lately, to the point where I can’t even remember what I was just thinking about doing ... any advice would be appreciated on what I should eat before going into jimmy Johns, so that I can have lasting energy for the day. Thanks!!!!", "url": "https://www.reddit.com/r/healthyeating/comments/gbqihf/how_and_what_should_i_eat_to_keep_my_energy_up_i/", "created_utc": 1588367482.0, "score": 46, "author": "None", "num_comments": 27, "permalink": "/r/healthyeating/comments/gbqihf/how_and_what_should_i_eat_to_keep_my_energy_up_i/", "html_title": "Reddit - The heart of the internet"}
{"title": "When you cut open a watermelon and that texture ain’t right!", "selftext": "I will never be the same after figuring this out. It is rare that a watermelon is just right, but I found a solution to repurpose the melon you don’t feel like eating. \n\nI know it’s simple and obvious, but I guarantee someone here will start doing this. \n\nBlend it up with some water, and maybe a splash of lemon or lemonade. No need to add anything else at all. Then strain through a fine mesh. Even bad tasting melons make tasty juice! 🍉", "url": "https://www.reddit.com/r/healthyeating/comments/ngo6le/when_you_cut_open_a_watermelon_and_that_texture/", "created_utc": 1621477311.0, "score": 44, "author": "None", "num_comments": 11, "permalink": "/r/healthyeating/comments/ngo6le/when_you_cut_open_a_watermelon_and_that_texture/", "html_title": "Reddit - The heart of the internet"}
{"title": "I need help finding recipes for healthy breakfasts, lunch and dinner and snacks. That uses light salt, light sugar, and that doesn't make me extremely full, but leaves me satisfied. I want to eat healthy just dont know where to start.", "selftext": "", "url": "https://www.reddit.com/r/healthyeating/comments/g5780z/i_need_help_finding_recipes_for_healthy/", "created_utc": 1587437728.0, "score": 45, "author": "None", "num_comments": 18, "permalink": "/r/healthyeating/comments/g5780z/i_need_help_finding_recipes_for_healthy/", "html_title": "Reddit - The heart of the internet"}
{"title": "How is one able to cut back on sweets and junk food?", "selftext": "I want to start eating healthier but whenever I go grocery shopping I always find myself getting a couple things that are chocolate and cookies and what not. Im just looking for help", "url": "https://www.reddit.com/r/healthyeating/comments/f91ei8/how_is_one_able_to_cut_back_on_sweets_and_junk/", "created_utc": 1582591008.0, "score": 41, "author": "None", "num_comments": 33, "permalink": "/r/healthyeating/comments/f91ei8/how_is_one_able_to_cut_back_on_sweets_and_junk/", "html_title": "Reddit - The heart of the internet"}
{"title": "I managed to get my cholesterol down 😁", "selftext": "It’s not very often I’m kind to myself but I’m in a very good mood today. Had a cholesterol test for the first time since October 2021. \n\nMy total cholesterol was 5.9 then - not dangerously high but certainly more than I would like! I haven’t exactly been dieting since then (my weight has stayed more or less the same) but what I have been doing is making a few substitutes, and including a LOT of Benecol.\n\nI am pleased to say now that my total cholesterol level is now 3.5! Which puts me in a much better position mentally, since I have always been one to worry about extreme scenarios like a heart attack or stroke.\n\nSo yeah, a good day for me 😊", "url": "https://www.reddit.com/r/healthyeating/comments/vslsi8/i_managed_to_get_my_cholesterol_down/", "created_utc": 1657099366.0, "score": 39, "author": "NoUsernameHereNow", "num_comments": 0, "permalink": "/r/healthyeating/comments/vslsi8/i_managed_to_get_my_cholesterol_down/", "html_title": "Reddit - The heart of the internet"}
{"title": "Low calorie late night snack?", "selftext": "Well, at like 1-3 AM I always really want to eat. But been gaining weight despite that I feel like I haven't been eating excessively.\n\nI have a very mild stress eating response, I think, so to some extent I really just want something that's empty but fills my stomach up.", "url": "https://www.reddit.com/r/healthyeating/comments/lkbgpx/low_calorie_late_night_snack/", "created_utc": 1613386941.0, "score": 40, "author": "BibiBrawlerQ", "num_comments": 29, "permalink": "/r/healthyeating/comments/lkbgpx/low_calorie_late_night_snack/", "html_title": "Reddit - The heart of the internet"}
{"title": "I need your most delicious heart healthy recipes.", "selftext": "My MIL just had a quadruple bypass surgery. She is used to a pretty high fat/high sodium diet like most southern women her age. She is really struggling with getting used to heart healthy foods. I know it will take some time for her tastes to adjust but I feel so bad for her. Im caring for her as she recovers and preparing all of her meals. I would love some great recipes to try for her! I have been throwing all the herbs and things I can into each dish but nothing tastes good to her without salt. She is having a really sucky time and I know having a really tasty meal finally would make her feel a lot better.", "url": "https://www.reddit.com/r/healthyeating/comments/fy87v5/i_need_your_most_delicious_heart_healthy_recipes/", "created_utc": 1586492513.0, "score": 36, "author": "bmccravt", "num_comments": 10, "permalink": "/r/healthyeating/comments/fy87v5/i_need_your_most_delicious_heart_healthy_recipes/", "html_title": "Reddit - The heart of the internet"}
{"title": "Help to eat healthy and ‘normal’ after years of extreme dieting.", "selftext": "Plain and simple. I need help. I know eating healthy is common sense. But I can’t seem to figure it out. When I was a teenager I suffered from anorexia and that’s when my extreme dieting started. From there I went into running and lifting weights excessively and went keto to lose more weight. I ended up injuring myself (looking back on it I’m surprised it took as long as it did to get hurt). \n\nAfter that I decided to go vegan for two years. During my two years of veganism I tried raw/living foodist and vegan keto. My doctor told me it was imperative to change my diet. So I made the hard decision to walk away from veganism and went to keto again. At this point I keep swinging between extremes. All junk food and all keto. It’s like as soon as I loosen the reigns I go insane and eat so much. I’ve gained a lot of weight and I’m now classified as overweight. \n\nI need help. Even if it’s someone knocking some sense into me. I have no idea how to  eat a balanced and healthy diet. I’m freaking lost and I feel like I’m constantly being pulled between two extremes. Just. Help. I’m 25, female, 5’ and idk what I weight. I just know it’s classified as overweight and it’s the heaviest I’ve ever been. \n\nThank you to anyone with advice.", "url": "https://www.reddit.com/r/healthyeating/comments/eef7cb/help_to_eat_healthy_and_normal_after_years_of/", "created_utc": 1577073493.0, "score": 39, "author": "sarcasmbunny", "num_comments": 32, "permalink": "/r/healthyeating/comments/eef7cb/help_to_eat_healthy_and_normal_after_years_of/", "html_title": "Reddit - The heart of the internet"}
{"title": "I get gas pains often. What foods will not give gas pain /trapped gas?", "selftext": "It seems like all healthy foods cause trapped gas, any green vegetables cause it. What do you recommend I eat, then to avoid it?", "url": "https://www.reddit.com/r/healthyeating/comments/nbu97y/i_get_gas_pains_often_what_foods_will_not_give/", "created_utc": 1620947648.0, "score": 39, "author": "lemur918", "num_comments": 18, "permalink": "/r/healthyeating/comments/nbu97y/i_get_gas_pains_often_what_foods_will_not_give/", "html_title": "Reddit - The heart of the internet"}
{"title": "What are some cheap, easy meals?", "selftext": "I eat a lot of microwave meals because they're only $1. I want to eat healthier but I need to save up for something. I'm thinking of maybe brown pasta or making potato wedges w/ veggie oil. Any other ideas?", "url": "https://www.reddit.com/r/healthyeating/comments/fleklp/what_are_some_cheap_easy_meals/", "created_utc": 1584641050.0, "score": 39, "author": "TheGreenYoutuber", "num_comments": 14, "permalink": "/r/healthyeating/comments/fleklp/what_are_some_cheap_easy_meals/", "html_title": "Reddit - The heart of the internet"}
{"title": "Over a year of eating healthy (mostly)", "selftext": "So, I posted here about a year ago when I started eating healthily and I just wanted to put out that I'm still eating well! It's been a struggle sometimes because I am an emotional eater and, even though I've got better at that, I am still human.\n\nOverall it's just become more of a habit to build meals around veggies and I notice I feel really 'off' if I eat a lot of processed, low-fibre, high-fat-salt-sugar foods. I'm still working on being successful 90% of the time rather than about 80% but I wanted to celebrate this milestone with others who might understand. \n\nCheers everyone and goodnight, Onions", "url": "https://www.reddit.com/r/healthyeating/comments/wnsruj/over_a_year_of_eating_healthy_mostly/", "created_utc": 1660436628.0, "score": 37, "author": "None", "num_comments": 4, "permalink": "/r/healthyeating/comments/wnsruj/over_a_year_of_eating_healthy_mostly/", "html_title": "Reddit - The heart of the internet"}
{"title": "I think I am addicted to eating sugar and I do t know how to stop", "selftext": "Hello, I am sorry if this has been asked before but this is something that is really starting to worry me. \n\nI feel I’ve developed a major sugar addiction. I’ve been unable to go two weeks without eating anything without sugar in it—I don’t mean naturally occurring sugars, like in fruits, I’m talking eclairs, cake, croissants, chocolate, you get the gist. Worst is, when shops close near me, I hope onto Uber Eats to get myself a dessert, so I’m wasting tons of money on this too. \n\nI am not sure how to stop. I’ve tried quitting cold turkey and it doesn’t work as I end up giving to my cravings. I’ve tried “treating” myself after 3 days of no processed sugars/foods and end up going overboard so the cycle starts again. I have Type 2 diabetes in my family on both my mother and father’s side so I’m definitely at risk of developing this too. So, please, any tips or suggestions would be more than welcome and I’m open minded to give everything a go at this point. \n\nThanks so much in advance.\n\nEdit: sorry, typo in the title. It’s meant to say *don’t.", "url": "https://www.reddit.com/r/healthyeating/comments/looa1m/i_think_i_am_addicted_to_eating_sugar_and_i_do_t/", "created_utc": 1613879347.0, "score": 36, "author": "None", "num_comments": 9, "permalink": "/r/healthyeating/comments/looa1m/i_think_i_am_addicted_to_eating_sugar_and_i_do_t/", "html_title": "Reddit - The heart of the internet"}
{"title": "I reached a new weight mark!", "selftext": "Not a post about foods or anything, but I'm just excited! I was 278 last Monday and today I weighed myself before heading to work and I'm officially 269! I'm out of the 270 mark!!! So I'm so damn happy and proud of myself.... it was a tough first week to completely change my eating habits and to add in a little daily exercise... but I'm doing it, and it's showing the results c:\n\nThank you to everyone on here who's helped with recommendations, wise words, and just words of encouragement in general! Yall are amazing!", "url": "https://www.reddit.com/r/healthyeating/comments/kvtjfa/i_reached_a_new_weight_mark/", "created_utc": 1610464531.0, "score": 35, "author": "JewishPiickle", "num_comments": 1, "permalink": "/r/healthyeating/comments/kvtjfa/i_reached_a_new_weight_mark/", "html_title": "Reddit - The heart of the internet"}
{"title": "Advice on Anti-Inflammatory diet to help manage Auto-Immune Disease?", "selftext": "Hello! It's my first time posting here and I was really hoping to get some advice about my diet. \n\nFor a little backstory, ten years ago I was diagnosed with a rare vascular autoimmune disorder. I get a monthly infusion of an immunosuppressive drug (among other meds) to control it but I've recently decided to turn to a (mostly) clean, anti-imflammatory diet in an attempt to control my symptoms. So far it seems to be working pretty well, but since I'm new to clean/healthy eating, I was hoping to get some constructive criticism or advice on other foods I can incorporate. I've found that eating the same thing every day seems to work for me but I worry I'm not getting enough variety. I'll give a rundown of my diet below:\n\nNote: I am a pescatarian and currently trying to gain weight\n\nBreakfast: a cup of green tea with a bowl of chia pudding (chia seeds, almond milk, and vanilla extract) topped with a sliced banana, unsweetened shredded coconut, and dark chocolate chips\n\nLunch: usually something egg based for protein. A slice of spinach and swiss quiche or a veggie frittata with some kind of fruit on the side (usually an apple, grapes, or pineapple) Sometimes I'll do tuna or egg salad made with avocado instead of mayo with salt and vinegar kale chips (made with apple cider vinegar)\n\nDinner: a quinoa bowl with roasted brussel sprouts, sweet potato, and sauteed mushrooms, onion, and garlic. A few nights a week I'll do a tuna/salmon filet in the place of mushrooms\n\nBedtime Snack: pistachios, dried cherries/blueberries, grapes, and a few slices of red pepper cheddar that I get from a local smokehouse. \n\n&#x200B;\n\nThat's pretty much the gist of it, with a little variation. A few night a week I also make \"golden milk\" which is basically coconut milk with tumeric, ginger, and cinnamon with organic maple syrup to sweeten. I also eat sourdough toast with olive oil and za'atar occasionally but try not to too often because I'm doing my best to avoid gluten/wheat (I'm sensitive to it)\n\n&#x200B;\n\nAny advice is welcome!! Especially from those who have successfully used diet to help manage autoimmune issues!", "url": "https://www.reddit.com/r/healthyeating/comments/ge1uol/advice_on_antiinflammatory_diet_to_help_manage/", "created_utc": 1588698934.0, "score": 37, "author": "BobLoblaw_AttyAtLaw", "num_comments": 11, "permalink": "/r/healthyeating/comments/ge1uol/advice_on_antiinflammatory_diet_to_help_manage/", "html_title": "Reddit - The heart of the internet"}
{"title": "Sugar addiction/ detox", "selftext": "\nHas anyone gone through a sugar detox? I’ve currently tried quitting sugar and it lead me to binge eat so many times. It’s very hard as it’s in everything and the more you stray away from it the worse the cravings get. (Apparently it’s 8 times more addicting than cocaine?) \n\nAfter looking into it, I’ve learned a lot about sugar and currently I’m not headed towards a right path. Any tips on quitting sugar (processed carbs)?", "url": "https://www.reddit.com/r/healthyeating/comments/g24tv1/sugar_addiction_detox/", "created_utc": 1586998375.0, "score": 37, "author": "kevinkai1207", "num_comments": 32, "permalink": "/r/healthyeating/comments/g24tv1/sugar_addiction_detox/", "html_title": "Reddit - The heart of the internet"}
{"title": "Do skinny girls actually have slow metabolisms from eating too little?", "selftext": "My gf is around 95 pounds and she is quite skinny,from what i calculated she should intake around 1450 calories,but i barely see her eating more than 250 per meal.And i hardly believe she goes over 1000\nShe also walks an hour daily.\nCan her low calorie diet slow her metabolism down?\nEDIT:U guys asked for height its 163 cm ,5'4\n\n(A lot of comments mentioned anorexia but i don't think she has an eating disorder considering she's been this skinny since she was a kid)", "url": "https://www.reddit.com/r/healthyeating/comments/hs73ff/do_skinny_girls_actually_have_slow_metabolisms/", "created_utc": 1594894676.0, "score": 35, "author": "bbosev14", "num_comments": 6, "permalink": "/r/healthyeating/comments/hs73ff/do_skinny_girls_actually_have_slow_metabolisms/", "html_title": "Reddit - The heart of the internet"}
{"title": "Snacking ?", "selftext": "Hello doing market research project on healthy snacking. It would of great help if you could take this survey it will only take 2-3 minutes . Just questions on snacking habits \n\nhttps://docs.google.com/forms/d/e/1FAIpQLSdFqcZjlcfEoQAwx-but5c5oOUg4cXzMUKNLG-LgpRW760xFg/viewform?usp=sf_link\n\nEdit : Thank you for all the responses it is greatly appreciated. I will now be closing my survey as I have collected enough responses due to yere help thank you!", "url": "https://www.reddit.com/r/healthyeating/comments/fadb4p/snacking/", "created_utc": 1582815670.0, "score": 38, "author": "semiobscureninja", "num_comments": 28, "permalink": "/r/healthyeating/comments/fadb4p/snacking/", "html_title": "Reddit - The heart of the internet"}
{"title": "Avoiding Cravings", "selftext": "Hello! I’ve recently gained a lot more weight than I should have and I’m wondering if there’s any tricks to avoid unhealthy cravings and snacking habits. My biggest problem comes from not being able to stay out of the kitchen, even when I’m not hungry. Any thoughts?", "url": "https://www.reddit.com/r/healthyeating/comments/eobjnl/avoiding_cravings/", "created_utc": 1578954424.0, "score": 35, "author": "mllebells", "num_comments": 16, "permalink": "/r/healthyeating/comments/eobjnl/avoiding_cravings/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to stop food anxiety and calorie counting?", "selftext": "For the new year, I’m trying to leave some of my unhealthy eating behaviors in 2020 with the rest of the bad shit that happened this year. Stress has made me hyper aware of what I’m eating, and I often have crying spells about food. I’m afraid of gaining weight. I’m trying to be better about loving myself and my body, and getting rid of the negative thoughts. I’m not overweight, and happy with my body, but I think I’m addicted to calorie counting. How can I “wean myself off” of calorie counting and eat like a normal human being again without the stress?", "url": "https://www.reddit.com/r/healthyeating/comments/klcsv4/how_to_stop_food_anxiety_and_calorie_counting/", "created_utc": 1609107467.0, "score": 34, "author": "Carly1377", "num_comments": 12, "permalink": "/r/healthyeating/comments/klcsv4/how_to_stop_food_anxiety_and_calorie_counting/", "html_title": "Reddit - The heart of the internet"}
{"title": "The Definite List of High Volume/Low Calorie Foods and Snacks", "selftext": "Hey everyone,\n\nI'm creating a free master list of all the best volume foods and calorie friendly snacks (and soon recipes) for the community. Take a quick look at my progress. It's still a very early rough draft. I'm adding the type of food/product, calories, rating, and soon I will add recipe tags. Full list here: [https://www.notion.so/Feed-Me-Best-Volume-Foods-List-c65682fea2294716a414d69246ef063e](https://www.notion.so/Feed-Me-Best-Volume-Foods-List-c65682fea2294716a414d69246ef063e)\n\n Let me know what you think so far", "url": "https://www.reddit.com/r/healthyeating/comments/kcdi8y/the_definite_list_of_high_volumelow_calorie_foods/", "created_utc": 1607876958.0, "score": 34, "author": "bfc5084", "num_comments": 3, "permalink": "/r/healthyeating/comments/kcdi8y/the_definite_list_of_high_volumelow_calorie_foods/", "html_title": "Reddit - The heart of the internet"}
{"title": "Want to change my diet in response to Christmas/uni weight gain. Any advice on changing this diet?", "selftext": "After being away at uni for 3 years and coming home this June, I’ve put on more weight than I’m pleased with. I know this all comes from my bad diet - which is primarily something chocolatey at least once a day. Here’s my usual day:\n\nBreakfast - chocolatey cereals and milk\n\nLunch - sandwich with usually cheese or tuna or salmon in unless I’m out (in which case it’s usually pizza or mcDs or some crap like that)\n\nDinner - if my family don’t all sit down together (where I have no control over the food), I usually have something like burgers/sausages and chips, or scrambled egg/omelette. \n\nSnacks. - I think the issue is here. I tend to get snacks and eat a lot of whatever’s in the house. Biscuits, crisps, chocolate, mince pies. You name it. Especially late at night when I’m the only one awake. \n\nI’m going to - starting this morning - try to change my breakfast up for Yoghurt, and also try to get more bananas/oranges in the house to snack on instead of chocolate, but does anyone have any advice for improving my lunches or any other snacks I could have that are healthier? I guess berries are a good investment?\n\nE: and also how do I tell my parents, who I still live with, that I want to make these changes?", "url": "https://www.reddit.com/r/healthyeating/comments/ekrjt8/want_to_change_my_diet_in_response_to/", "created_utc": 1578301286.0, "score": 35, "author": "Celestial_Blu3", "num_comments": 14, "permalink": "/r/healthyeating/comments/ekrjt8/want_to_change_my_diet_in_response_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "After Eating Healthy, My Gut Cannot Handle Crap Food", "selftext": "Has anyone else noticed this?  Or even experienced it?\n\nAbout February I downloaded a calorie counting app and began eating way, way healthier. I've lost 20 lbs so far (woop woop) and have been going good. Haven't touched candy, soda, or even bread since starting.\n\nYesterday was my fathers birthday (he passed last November), and we decided to celebrate his birthday by eating what he would have eaten. This included: Spaghetti, toasted French bread, Pepsi, and peanut MnM's afterwards. \n\nWe had a smaller bowl of the spaghetti, only 1 piece that wasn't big of the French bread, half the 16oz Pepsi bottle and maybe 10 MnM's. We ate that, watched his favorite shows as we did, and got ready for bed. \nAbout an hour after eating dinner, both my mother and I (we're both on this health journey together) got a really bad stomach ache. I was able to fall asleep, but kept waking up with bad indigestion. She couldn't sleep at all, it was so bad. We both also began getting really bad bowel movements. \n\nNow it's 5am, I've only gotten 4 hours of broken sleep while she's got less than 1, both of our stomachs hurt like hell, we have bad indigestion and our bowel movements are horrible. \n\nWe're never eating that stuff again. Or at least, not without a salad or something to counterbalance the crap.", "url": "https://www.reddit.com/r/healthyeating/comments/vi4202/after_eating_healthy_my_gut_cannot_handle_crap/", "created_utc": 1655900758.0, "score": 32, "author": "ImBonkingTired17", "num_comments": 9, "permalink": "/r/healthyeating/comments/vi4202/after_eating_healthy_my_gut_cannot_handle_crap/", "html_title": "Reddit - The heart of the internet"}
{"title": "Food behaviors", "selftext": "Do any other young adult girls out there go through phases (other than mensural cycle) where they just can NOT stop eating and NOTHING will satisfy their appetite?? \nIt’s annoying especially because I’m trying so hard to be healthy", "url": "https://www.reddit.com/r/healthyeating/comments/nuoyj9/food_behaviors/", "created_utc": 1623103491.0, "score": 33, "author": "stevebyushemi", "num_comments": 15, "permalink": "/r/healthyeating/comments/nuoyj9/food_behaviors/", "html_title": "Reddit - The heart of the internet"}
{"title": "Eating almost no bread/ low carb diet. Need help to not lose anymore weight/ how to gain weight in a healthy way.", "selftext": "I want to stay away from junk and carbs regularly. But I just keep losing weight and am too thin right now. Need guidance for healthy ways to put on weight", "url": "https://www.reddit.com/r/healthyeating/comments/lj4e5b/eating_almost_no_bread_low_carb_diet_need_help_to/", "created_utc": 1613235859.0, "score": 31, "author": "siennasolo", "num_comments": 37, "permalink": "/r/healthyeating/comments/lj4e5b/eating_almost_no_bread_low_carb_diet_need_help_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "Realized I’m obese today.....now depressed", "selftext": "I’m a 41 year old male that had major success around 14 years ago on the South Beach diet.  I went from 235 down to 170.  I now weight 255 pounds and I’m depressed about it. I’m trying the Lose It app as well as the my fitness pal app and while I lost two pounds at first my weight has started to go back up and I’m eating exactly as it says. How can I lose weight?  I’m very upset with myself.", "url": "https://www.reddit.com/r/healthyeating/comments/k87rp8/realized_im_obese_todaynow_depressed/", "created_utc": 1607308406.0, "score": 32, "author": "ProtectedByFire", "num_comments": 22, "permalink": "/r/healthyeating/comments/k87rp8/realized_im_obese_todaynow_depressed/", "html_title": "Reddit - The heart of the internet"}
{"title": "What are some snacks I can eat a shitton of?", "selftext": "I have a pretty active lifestyle, I run multiple miles daily and play soccer, and my diet is very healthy, mainly fruits nuts veggies and good proteins. I usually watch my calories, however sometimes I just want to eat a fuck ton of food with little consequence. Obviously too much of anything is bad, but what snacks can I eat a bunch of?", "url": "https://www.reddit.com/r/healthyeating/comments/hqt1ny/what_are_some_snacks_i_can_eat_a_shitton_of/", "created_utc": 1594693289.0, "score": 31, "author": "bigboi62049", "num_comments": 25, "permalink": "/r/healthyeating/comments/hqt1ny/what_are_some_snacks_i_can_eat_a_shitton_of/", "html_title": "Reddit - The heart of the internet"}
{"title": "Lauras Lean Beef Jerky has anyone tried it? I have had their ground beef before and it was amazing. It says gluten-free has anyone with gluten allergies tried it to verify?", "selftext": "", "url": "https://store.meyernaturalfoods.com/product/original-beef-jerky", "created_utc": 1551198904.0, "score": 33, "author": "thechristmasguys", "num_comments": 2, "permalink": "/r/healthyeating/comments/av1eef/lauras_lean_beef_jerky_has_anyone_tried_it_i_have/", "html_title": "404 Not Found\n – Meyer Market"}
{"title": "Started eating healthy and now I can’t tolerate ANY junk food", "selftext": "After years of having a medium/relatively bad diet (lots of alcohol and junk food) I decided to start eating healthy. This was about a Month and a half ago. I quit dairy, gluten, processed foods, refined sugars and alcohol. Yesterday I had a sandwich for the first time and I felt really sick immediately after but I thought maybe it was because I haven’t had deli meat/bread for a while now. But today I went out had 2 small slices of pizza and like 5 pieces of loaded nachos chips and I came home hours later and threw it all up. I’m so unbelievably sick from the food. My stomach hurts, I couldn’t keep it down at all and I want to know if this is normal/ happened to anyone else and if someone can give me some science behind it? Does this mean I have to swear off tasty treats forever? Cuz now I’m scared of anything that isn’t “cleaner” :(", "url": "https://www.reddit.com/r/healthyeating/comments/y2r31s/started_eating_healthy_and_now_i_cant_tolerate/", "created_utc": 1665641425.0, "score": 32, "author": "Lwff_", "num_comments": 5, "permalink": "/r/healthyeating/comments/y2r31s/started_eating_healthy_and_now_i_cant_tolerate/", "html_title": "Reddit - The heart of the internet"}
{"title": "Hard time transitioning from the “typical” American diet", "selftext": "So I was raised on a high sugar, high salt and high fat diet with very VERY little vegetables. Now, as an adult, I’m having a really hard time eating a variety of vegetables which is frustrating because I want nothing more than to eat a whole foods diet and cut out greasy, fried foods. This might seem like a ridiculous question, but if you were in my position once, what did you do to get yourself to eat more vegetables/stop eating garbage? Did you just force yourself into it? I’m just so picky and pretty addicted to sugar and it’s really irritating", "url": "https://www.reddit.com/r/healthyeating/comments/ussjt0/hard_time_transitioning_from_the_typical_american/", "created_utc": 1652925358.0, "score": 32, "author": "DependentTable666", "num_comments": 15, "permalink": "/r/healthyeating/comments/ussjt0/hard_time_transitioning_from_the_typical_american/", "html_title": "Reddit - The heart of the internet"}
{"title": "I've been trying to portion my meals, but my family doesn't think I'm eating enough. I've resorted to counting my calories, but I'd still like to lose weight and keep my calorie intake to a minimum as to lose weight faster. I'm 33 years old, 6'1, 282lbs, and walk about 2-4 miles/day.", "selftext": "I guess I'm just not sure what my calorie intake should be without essentially going into what I've heard called \"survivor mode.\" I haven't seen a calculator that gives you a minimum calorie intake for your daily intake. TDEE calc says 2,734 to maintain, but that seems like a lot and obviously, I don't want to maintain. And so I just want to shoot for an amount that is less than this? I'm thinking 1500-1750/day...?", "url": "https://www.reddit.com/r/healthyeating/comments/o0bjne/ive_been_trying_to_portion_my_meals_but_my_family/", "created_utc": 1623754454.0, "score": 32, "author": "None", "num_comments": 16, "permalink": "/r/healthyeating/comments/o0bjne/ive_been_trying_to_portion_my_meals_but_my_family/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is there a comprehensive list of good and bad vitamin/mineral pairings?", "selftext": "As I try to make my diet healthy I keep on reading things, and there seems to be quite a bit of \"if you eat X with Y it'll absorb better, but if you eat it with Z it won't absorb at all\" kind of info. Is there a list that shows things what should be eaten together to maximize benefits and which pairings to avoid?", "url": "https://www.reddit.com/r/healthyeating/comments/ilm4s3/is_there_a_comprehensive_list_of_good_and_bad/", "created_utc": 1599104731.0, "score": 32, "author": "renox92", "num_comments": 8, "permalink": "/r/healthyeating/comments/ilm4s3/is_there_a_comprehensive_list_of_good_and_bad/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is it healthy to drink bug milk?", "selftext": "We go outside and catch we many bugs as possible\n\n in the blender with water in tastes so bad and gives me the worst diarrhea ever and even my turtle drinks it and vomits it back up\n\n I thought bugs are healthy but the more bugs I drink the worse I feel", "url": "https://www.reddit.com/r/healthyeating/comments/1hj2tip/is_it_healthy_to_drink_bug_milk/", "created_utc": 1734757700.0, "score": 33, "author": "Constructivpinapl", "num_comments": 8, "permalink": "/r/healthyeating/comments/1hj2tip/is_it_healthy_to_drink_bug_milk/", "html_title": "Reddit - The heart of the internet"}
{"title": "Can a 38 y change her life to be physically fit?", "selftext": "Hey everybody, \n\nI am looking for positive stories and experience. I am 38 f and I am so out of shape. I have been obese most of my life. I am not morbid obese but I am 50 pounds overweight. I did diet and my weight fluctuate a lot. \n\nNow I want to change my life around. I am seeing dietician I want to eat healthy and exercise. I am also seing therapist to help improve mental health.\n\nBut I am wondering , is it too late to be physically fit? Not running marathon but like be really in shape ? Basically is the damage on my body are reversable?\n\nThanks. \n\n", "url": "https://www.reddit.com/r/healthyeating/comments/1c1g7r3/can_a_38_y_change_her_life_to_be_physically_fit/", "created_utc": 1712845042.0, "score": 32, "author": "None", "num_comments": 25, "permalink": "/r/healthyeating/comments/1c1g7r3/can_a_38_y_change_her_life_to_be_physically_fit/", "html_title": "Reddit - The heart of the internet"}
{"title": "You Now Have High Cholesterol and Here’s What You Can Eat if You Don’t Want to Die", "selftext": "I’m imagining a website called something like “You Now Have High Cholesterol and Here’s What You Can Eat if You Don’t Want to Die” and it’s an idiot-proof list foods you can and can’t eat. Does this exist?\n\n-\tAvocado YES\n-\tBacon NO\n-\tChicken YES\n-\tEggs YES\n-\tFrench fries NO\n-\tLettuce YES\netc.", "url": "https://www.reddit.com/r/healthyeating/comments/syxgdl/you_now_have_high_cholesterol_and_heres_what_you/", "created_utc": 1645561707.0, "score": 33, "author": "bk_whopper", "num_comments": 7, "permalink": "/r/healthyeating/comments/syxgdl/you_now_have_high_cholesterol_and_heres_what_you/", "html_title": "Reddit - The heart of the internet"}
{"title": "What did you notice after cutting out junk food and sugar?", "selftext": "I gained a lot of weight during COVID lockdown along with losing all motivation to look after my body. Now with my wedding at the end of the year I am determined to reclaim my health and improve my fitness too. I’m 70 days into my own challenge to do 100 days of exercise (weights and passive exercise on ‘rest’ days, such as yoga or walking). \n\nFor the last 30 days I’d like to cut out sugar (as in the type in chocolate, lollies, cake, juice etc) and junk food so that I can curb my bad cravings and also hopefully improve my diet overall since that has seemed to be my downfall. \n\nFor those of you who have done the same in the past, what tips do you have (namely for getting over the cravings I will undoubtedly get) and what changes did you notice to your mood, sleep, body etc after cutting out the nasties?!", "url": "https://www.reddit.com/r/healthyeating/comments/mxguk3/what_did_you_notice_after_cutting_out_junk_food/", "created_utc": 1619258078.0, "score": 31, "author": "vw97", "num_comments": 11, "permalink": "/r/healthyeating/comments/mxguk3/what_did_you_notice_after_cutting_out_junk_food/", "html_title": "Reddit - The heart of the internet"}
{"title": "House bound for 12 days post spinal surgery. How to eat healthy and not binge!", "selftext": "Hello everyone, I will be housebound on Monday for 12 days post spinal surgery. I will also only be allowed to lay down or stand. No exercise, driving or extended periods of sitting. \n\nI am already nervous as I know I will binge eat! When I get bored (and I know I’ll be bored, there is only so much sleep and Netflix one can do in 12 days) all I do is binge eat. \n\nWhat are some helpful tips or advice I can use throughout this period?\n\nThank you in advanced!", "url": "https://www.reddit.com/r/healthyeating/comments/lsyde8/house_bound_for_12_days_post_spinal_surgery_how/", "created_utc": 1614348452.0, "score": 32, "author": "Unsureofthesure", "num_comments": 9, "permalink": "/r/healthyeating/comments/lsyde8/house_bound_for_12_days_post_spinal_surgery_how/", "html_title": "Reddit - The heart of the internet"}
{"title": "The best foods to feed your gut microbiome", "selftext": "*Hello, I'm an editor at The Washington Post. I wanted to share our latest story from nutrition writer* [Anahad O'Connor](https://www.washingtonpost.com/people/anahad-oconnor/https://www.washingtonpost.com/people/anahad-oconnor/)*. Here's a gift link with no paywall to read the full story.* [*https://wapo.st/3BTGK0g*](https://wapo.st/3BTGK0g)\n\nAnahad wrote about the importance of feeding your gut bacteria.\n\n\"Gut bacteria can even affect your mental state by producing mood-altering neurotransmitters like dopamine, which regulates pleasure, learning and motivation, and serotonin, which plays a role in happiness, appetite and sexual desire. Some recent studies [suggest](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6779243/) that the composition of your gut microbiome can even play a role in how well you sleep.\"\n\nYou can feed yours by eating a wide variety of plant foods every day.\n\nHere's a sample menu that can help you get 30 varieties in one week\n\n* One day, start your morning with a bowl of plain yogurt topped with sliced bananas and strawberries, a dash of cinnamon powder, and a handful of mixed nuts (containing almonds, pecans, cashews, hazelnuts and peanuts). *Meal tally: 8 plant foods*\n* Another day, eat a leafy salad with at least two mixed greens, tomatoes, carrots, broccoli and peppers. Add herbes de Provence, a seasoning that typically contains six herbs, to grilled chicken or fish. *Meal tally: 12 plant foods*\n* Later in the week, eat chicken seasoned with pesto (it contains basil, pine nuts and garlic) and enjoy a bowl of brown rice with onions and kidney beans and a side of stir-fried veggies with green and yellow squash, mushrooms and shallots. *Meal tally: 10 plant foods\"*", "url": "https://www.reddit.com/r/healthyeating/comments/xja4ek/the_best_foods_to_feed_your_gut_microbiome/", "created_utc": 1663683638.0, "score": 31, "author": "AvivaLoeb", "num_comments": 5, "permalink": "/r/healthyeating/comments/xja4ek/the_best_foods_to_feed_your_gut_microbiome/", "html_title": "Reddit - The heart of the internet"}
{"title": "I have saved close to 100k+ calories by tracking my drinks", "selftext": "I am a female in in my upper 20s and gained close to 20+ pounds during the first year of the pandemic. I work a very stressful job and would pacify my anxiety admittedly with alcohol. I came across an ad on Instagram that said \"track your drinks\".  I thought l I could record everything in MyFitnessPal, right? But at point I wasn't even tracking calories so of course I didn't track my drinks and ignored the ad. One day after a really big drinking night I signed up for the drink tracking app, Sunnyside and haven't looked back since.  I hit 365 days of tracking with Sunnyside this weekend. Regardless if I stuck to my weekly plan or not, I tracked every single day. I can't believe I am saying this  in such a public space,  but I have saved over 100,000 calories by being aware of my drinking. I wanted to share here because this can be a sensitive topic to talk about with friends & family.  For anyone who feels like alcohol is holding them back in achieving their health goals  and would want to try the same thing I did, go here to do the same thing I did  [http://ctbk.co/Abby2](http://ctbk.co/Abby2)", "url": "https://www.reddit.com/r/healthyeating/comments/vm43pd/i_have_saved_close_to_100k_calories_by_tracking/", "created_utc": 1656359161.0, "score": 30, "author": "ok-mindful", "num_comments": 6, "permalink": "/r/healthyeating/comments/vm43pd/i_have_saved_close_to_100k_calories_by_tracking/", "html_title": "Reddit - The heart of the internet"}
{"title": "Can anyone recommend an egg white recipe that's not spongy?", "selftext": "I've gotten tired of choking down scrambled egg whites, so I recently tried making an egg white frittata by adding low-fat cottage cheese. I've heard it can make eggs more luxurious. (People claim that it's one of the reasons the sous vide egg white bites at Starbucks are so good.) It was somewhat better, but still not great, even with lots of veggies in it. It's got that spongy, almost squeaky texture that isn't super appetizing.\n\nIt may be related to my cooking methods, but I think I'm pretty good at keeping my eggs somewhat moist. I'm OK with a little bit of runniness if it means moister eggs.\n\nWithout adding much fat, does anyone have a recipe or technique to make egg whites more appetizing?\n\nThanks.", "url": "https://www.reddit.com/r/healthyeating/comments/l2tfmu/can_anyone_recommend_an_egg_white_recipe_thats/", "created_utc": 1611339170.0, "score": 30, "author": "FaithNoMoar", "num_comments": 10, "permalink": "/r/healthyeating/comments/l2tfmu/can_anyone_recommend_an_egg_white_recipe_thats/", "html_title": "Reddit - The heart of the internet"}
{"title": "Eating right 6 days a week but having 1 cheat meal?", "selftext": "I'm 28 and I was beginning to have slight chest pains, so I decided to change the way I eat. I used to eat frozen meals, fast food etc.... I haven't had soda since August (yay me lol) but since Saturday (Jan 2nd) I've been eating better... berries, nuts, 1 cheese stick, 2-3 small pieces of jerky, carrots.... and for breakfast (5:30 am) I have a premier protein shake. I've cut back on portions and have been eating better dinners.... shrimp, Tilapia, chicken, Quinoa, etc.... been doing good and feeling good, now my big thing....\n\nMy wife and I love going to our favorite BBQ joint on Saturdays, I usually get their Bexar burger (ground brisket patty, topped with brisket, 1 slice of cheese and BBQ sauce) its amazing and I really don't want to give it up.... is it OK to eat once a week if I cut out the buns and have no other meal that day? We usually eat it at noon, if I only drink water the rest of the day and nothing else, will it effect my weight loss? I'm not used to eating healthy so I'm just wondering.... I gave up a lot of unhealthy habits, but I do not want to give up my favorite BBQ joint. \n\nThank you all in advance!!!", "url": "https://www.reddit.com/r/healthyeating/comments/krmxd1/eating_right_6_days_a_week_but_having_1_cheat_meal/", "created_utc": 1609936005.0, "score": 28, "author": "JewishPiickle", "num_comments": 28, "permalink": "/r/healthyeating/comments/krmxd1/eating_right_6_days_a_week_but_having_1_cheat_meal/", "html_title": "Reddit - The heart of the internet"}
{"title": "I HATE that feeling of Guilt", "selftext": "Im a pretty healthy person in general, balanced diet and fitness 6 days out of 7. However I use to have orthorexia mainly due to body image issues as a teen. Although I'm much better now, my orthorexia still occasionally manifests itself. Mainly as a strong feeling of guilt especially when I over indulge in unhealthy habits. I usually hit rock bottom during my time of the month when my hormones go awol and im craving all types of junk. Like right now...\n\nI just ate a full large pack of crisps and lightly salted peanuts. Granted they were the healthy quinoa crisps, baked and no cholesterol type. I still ate the whole LARGE pack. I feel awfully guilty about the amount of sodium, fat and carbs consumed. I hate it but In the same way (and this might sound depressing) I don't really want to get rid of the guilt as it keeps me from over indulging the next time I eat... \n\nIts kinda like a toxic relationship. Can anybody else relate? How would you prevent yourself from overindulging ?", "url": "https://www.reddit.com/r/healthyeating/comments/iv3kcj/i_hate_that_feeling_of_guilt/", "created_utc": 1600424847.0, "score": 31, "author": "None", "num_comments": 3, "permalink": "/r/healthyeating/comments/iv3kcj/i_hate_that_feeling_of_guilt/", "html_title": "Reddit - The heart of the internet"}
{"title": "Finally starting to eat healthy again!", "selftext": "So I have some mental health issues and it’s hard for me to eat healthy, especially when I’m depressed. So I talked with a dietician today and I’m going to be starting out strong, I do have about 20 or so pounds to loose.. if y’all have any advice, let me know! Thanks in advance!", "url": "https://www.reddit.com/r/healthyeating/comments/ftbe0b/finally_starting_to_eat_healthy_again/", "created_utc": 1585784428.0, "score": 30, "author": "None", "num_comments": 4, "permalink": "/r/healthyeating/comments/ftbe0b/finally_starting_to_eat_healthy_again/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is there something wrong if I drink a lot of water?", "selftext": "I am 24, female. I exercise about 4-5h a week, but other than that and going shopping everyday I don't do much physical activity. On a regular day I drink more than 3l, without counting coffee or soups. I do tend to crave and eat salty foods, but I am not sure if I eat much more than the recommended amount. I kind of eat potato chips every day, but I usually pick those who have less than 2g of salt/100g. I don't force myself to drink that much water, that is how much I crave. I don't do much cardio, but I sweat quite easily.\n\nToday I noticed that in the past 24h I finished 3 2l bottles which made me to think if I am doing something wrong. My blood pressure is usually normal.", "url": "https://www.reddit.com/r/healthyeating/comments/lohwh7/is_there_something_wrong_if_i_drink_a_lot_of_water/", "created_utc": 1613858695.0, "score": 30, "author": "emab2396", "num_comments": 17, "permalink": "/r/healthyeating/comments/lohwh7/is_there_something_wrong_if_i_drink_a_lot_of_water/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is drinking water a healthy breakfast rule?", "selftext": "Some people say that you can't drink and eat at the same time.", "url": "https://www.reddit.com/r/healthyeating/comments/gjnhaw/is_drinking_water_a_healthy_breakfast_rule/", "created_utc": 1589466804.0, "score": 28, "author": "Alexpotapff", "num_comments": 10, "permalink": "/r/healthyeating/comments/gjnhaw/is_drinking_water_a_healthy_breakfast_rule/", "html_title": "Reddit - The heart of the internet"}
{"title": "Downsides of snacking (too much) on almonds and pistachios ?", "selftext": "Hello everyone !\n\nSo... a couple months ago, I finally started to take care of my body a little bit more.\n\nCompletely stopped smoking and started exercising again (running for cardio and push-ups, abs for muscle mass). At 29 yo and starting to have a 30's crisis, it was damn time.\n\nOne issue remaining, my alimentation... I'm French and as a typical French, I'm addicted to cheese. Good ol' *tartines de fromage* are life, that and some fine-ass smoothies, that was (and kinda still is) the basis of my snacks.\n\nBut now, I'm really trying to stop to have the healthiest lifestyle possible. Ideally, one should totally stop snacking between meals, I know, but things seldom go ideally. And better swapping unhealthy snacks with healthier ones rather than going from all to nothing.\n\nI've decided to go for nuts, mainly almonds and pistachios after my work-out and jogging routines. Still, I'm not the kind of guy that easily manages to do things halfway and I eat a lot of them.\n\nFrom all I know, they are among the healthiest things to snack on, but as with everything else in life, there's probably a \"too much\" limit to them.\n\nSo... keeping in mind I eat much less at my regular meals (and try to have them as healthy and vegetably/fibery as possible), what are the main downsides of snacking too much on nuts between meals ?\n\nThanks in advance for the replies ! ;)", "url": "https://www.reddit.com/r/healthyeating/comments/g9oy42/downsides_of_snacking_too_much_on_almonds_and/", "created_utc": 1588086650.0, "score": 27, "author": "Triskan", "num_comments": 17, "permalink": "/r/healthyeating/comments/g9oy42/downsides_of_snacking_too_much_on_almonds_and/", "html_title": "Reddit - The heart of the internet"}
{"title": "Greatly increased my fiber intake and am STARVING. Ate 4000+ kCal today and I’m still hungry. What’s happening to my body?", "selftext": "Hey everyone. I’m a healthy, active 22 year old male who’s looking to improve my digestive health and microbiome. I’ve been increasing my fiber intake lately and today I more than tripled it. Before, I counted an average daily intake of 22g/day and today my goal was to increase it to 50g by adding wheat bran and powdered oatmeal to my breakfast smoothie.\nI expected to feel fuller longer, but instead I’ve been ravenous. I’ve been constantly hungry, snacking on fruits, vegetables, and whole grains in an attempt to mitigate the calories. Towards the end of the day my nutrition tracker read an astonishing 4156 kCal and my fiber content was 81g. My usual kCal consumption is between 2500 kCal and 3000 kCal for bodybuilding. Is the insane amount of fiber preventing my body from absorbing nutrients or am I just losing my mind? Any explanation is welcome. Thanks!", "url": "https://www.reddit.com/r/healthyeating/comments/ff80bv/greatly_increased_my_fiber_intake_and_am_starving/", "created_utc": 1583644683.0, "score": 29, "author": "wearingsauce", "num_comments": 10, "permalink": "/r/healthyeating/comments/ff80bv/greatly_increased_my_fiber_intake_and_am_starving/", "html_title": "Reddit - The heart of the internet"}
{"title": "Hard to get back on track", "selftext": "It's my sister's birthday weekend so I kind of figured I would relax a little.  We went out for Italian last night with the fam and I had chicken parm.  Way too many rolls.  And I ate some cookies afterward.  Then I came home and had a snack lol.... Apple, low calorie popcorn, and some sweet potato chips.\n\nSo of course today I'm like \"let's get back on track\"... Though I know I'm doing dinner with my sister again (this time with friends) tonight - sushi and Korean BBQ.  Again I figured that I'm just going to be lenient tonight... But make sure I work out and eat healthy up until then.\n\nThe problem is that I wake up after a meal like that last night and I feel more hungry than I usually would.  Like I'm itching for donuts or pancakes or eggs....\n\nI know the answer here.  Eat something healthy - maybe fruit or a salad - go to the gym like I planned - and then enjoy myself tonight (and then be ready to jump back on the bandwagon on Monday).\n\nThis is just me whining about it being hard.  But always appreciate any advice for getting back on track.  I know I'm never going to live a 100% clean eating life... And that's how I prefer it... But I do have weight loss goals and want to make sure I get better at not letting one evening or one day throw me off my goals.", "url": "https://www.reddit.com/r/healthyeating/comments/fbxn7s/hard_to_get_back_on_track/", "created_utc": 1583085027.0, "score": 28, "author": "cass2769", "num_comments": 6, "permalink": "/r/healthyeating/comments/fbxn7s/hard_to_get_back_on_track/", "html_title": "Reddit - The heart of the internet"}
{"title": "My 53 yro brother had an aortic dissection, open heart surgery and some strokes last week and it has freaked me out!", "selftext": "My lifestyle is not as unhealthy as his, but I definitely don't eat very healthy. Especially not over the past year as I've gone through some stressful life changes, including a big relocation and job change. \n\nBut, it's been a year since my life was uprooted and my (younger) brother's situation has freaked me the hell out! It's time to take this as a clue to get myself back on track, starting with an eating plan and getting back into an exercise routine. \n\nAnyway, no real questions, unless anyone has any advise on how to get started. I'm just looking forward to reading everyone's posts on this channel. Thanks!", "url": "https://www.reddit.com/r/healthyeating/comments/evykto/my_53_yro_brother_had_an_aortic_dissection_open/", "created_utc": 1580353350.0, "score": 28, "author": "balanceandpeace", "num_comments": 6, "permalink": "/r/healthyeating/comments/evykto/my_53_yro_brother_had_an_aortic_dissection_open/", "html_title": "Reddit - The heart of the internet"}
{"title": "Unhealthy eating habits", "selftext": "I have found that I only eat Protein and Carbs and a lot of them. My metabolism is really high which allows me to eat a ton of food and currently not worry about the consequences and I am concerned that in the long run, this isn't the best thing. I don't like the taste of most fruits or vegetables, the ones I do eat on occasion are corn, mashed or baked potato, and olives. My daily eating is somewhat as follows\n\nBreakfast- Either nothing or a sausage egg biscuit\n\nLunch- Terraki Chicken with rice\n\nDinner- Chicken Tenders, or a burger\n\nI want to start eating better but don't know where to start, any help would be great. Thanks!", "url": "https://www.reddit.com/r/healthyeating/comments/eo4vpr/unhealthy_eating_habits/", "created_utc": 1578926069.0, "score": 28, "author": "bobbynewman9", "num_comments": 6, "permalink": "/r/healthyeating/comments/eo4vpr/unhealthy_eating_habits/", "html_title": "Reddit - The heart of the internet"}
{"title": "Dealing with increased appetite starting exercise regimen", "selftext": "Hi all, I have not been a consistent exerciser throughout my life (28f). I played a sport for 2 years in high school and my appetite increased so much, I'd eat the lunch my mom packed and then buy a second one. Now that I have started exercising again, I am noticing a similar trend, but since I am older now, I can't really \"burn off\" all the food that my body is craving. How do I get past this? Should I eat when my body tells me, or ignore it? What can I eat instead of \"second lunch\"? If you have had a similar experience, how long did it take before your appetite normalized again?", "url": "https://www.reddit.com/r/healthyeating/comments/ecoino/dealing_with_increased_appetite_starting_exercise/", "created_utc": 1576731937.0, "score": 29, "author": "redifredi", "num_comments": 5, "permalink": "/r/healthyeating/comments/ecoino/dealing_with_increased_appetite_starting_exercise/", "html_title": "Reddit - The heart of the internet"}
{"title": "I've been back at eating much healthier and wow I feel such a big difference", "selftext": "I don't even care of part of it could be a placebo or whatever but I feel pretty good. Not like jumping up and down amazing, but I feel more like a normal person. \n\nI have PTSD, anxiety, depression and it makes it hard to function each day because of the incredible fatigue I've always felt but after my honeymoon, I decided to start eating better again. \n\nI had to file bankruptcy earlier last month and felt so embarrassed by it, I gained 20 pounds over a couple months. Finally now that I'm married and things have settled down I decided I'd eat better like I did in college. \n\nJust by adding flaxseed to my diet along with my fiber gummies (10g a day plus the 8g of flaxseed minimum) has made my GI problems almost disappear! I'm not nearly as bloated, I don't have as much trapped gas or cramps. I've never been so happy to not have diarrhea anymore either or going to the bathroom constantly! It's great. \n\nWhen I was younger I was overweight and I just ended up starving myself by having soda in the morning to suppress my appetite, a bag of chips in the afternoon, and dinner at home. I've definitely carried a lot of those bad habits into my young adulthood, but I just turned 25 a couple days ago. I feel way too old to be feeling this way about food when I genuinely love fruit and vegetables. \n\nI've been watching a lot of healthy minded YouTubers which helps because I wish I knew how to have a better relationship with food than I do. \n\nToday I was so proud of myself, I went to pick up the rest of our groceries at Sam's and I got some delicious free samples. I got to order a frozen yogurt and I got a soda for my husband. I had a little bit of soda and was not tempted to drink all of it. I also stopped eating my frozen yogurt when I was full and didn't want anymore. \n\nI even got some treats today and I haven't been tempted to eat them all- I had a couple pieces but after I didn't want anymore I stopped! I feel like I can truly enjoy food and not feel miserable after eating. \n\nI'm really hoping I can keep it up.", "url": "https://www.reddit.com/r/healthyeating/comments/x3oka4/ive_been_back_at_eating_much_healthier_and_wow_i/", "created_utc": 1662082203.0, "score": 29, "author": "avt2020", "num_comments": 6, "permalink": "/r/healthyeating/comments/x3oka4/ive_been_back_at_eating_much_healthier_and_wow_i/", "html_title": "Reddit - The heart of the internet"}
{"title": "Healthy sweet/salty foods?", "selftext": "I always get the munchies and end up overeating a whole bunch of candy and chips and stuff. Sometimes I’ll even order fast food.\n\nAnyone have any healthy(ish) foods that satisfy the sweet/salty craving? Doesn’t have to be super healthy, just not complete junk food.", "url": "https://www.reddit.com/r/healthyeating/comments/llaqh1/healthy_sweetsalty_foods/", "created_utc": 1613501622.0, "score": 28, "author": "olive9819", "num_comments": 27, "permalink": "/r/healthyeating/comments/llaqh1/healthy_sweetsalty_foods/", "html_title": "Reddit - The heart of the internet"}
{"title": "Which foods shocked you the most on how many calories was in the product?", "selftext": "I just found out one sleeve of Ritz Crackers are 2,800 calories", "url": "https://www.reddit.com/r/healthyeating/comments/kkynq8/which_foods_shocked_you_the_most_on_how_many/", "created_utc": 1609049716.0, "score": 27, "author": "JayJayJorden", "num_comments": 20, "permalink": "/r/healthyeating/comments/kkynq8/which_foods_shocked_you_the_most_on_how_many/", "html_title": "Reddit - The heart of the internet"}
{"title": "How can i kick my sugar addiction?", "selftext": "I’m drinking a ton of water to stop the cravings. But even if I have like vitamin gummies that are sugar I start craving more sugar. I need to get my cholesterol down, I eat sugary things everyday before I took my last cholesterol test. \nIt’s just not cute anymore to be eating the way I am.", "url": "https://www.reddit.com/r/healthyeating/comments/jduiqq/how_can_i_kick_my_sugar_addiction/", "created_utc": 1603079001.0, "score": 28, "author": "None", "num_comments": 16, "permalink": "/r/healthyeating/comments/jduiqq/how_can_i_kick_my_sugar_addiction/", "html_title": "Reddit - The heart of the internet"}
{"title": "How do I make chia seeds more palatable?", "selftext": "I've been trying to eat chia seed pudding in the morning. It makes me feel great, but damn if I can't get past the taste. I've tried making them more flavorful with sugar, peanut butter, nuts, spices, etc. But I just find the taste gross and I can barely get it down. Are there other good ways to eat chia seeds?", "url": "https://www.reddit.com/r/healthyeating/comments/g47jfl/how_do_i_make_chia_seeds_more_palatable/", "created_utc": 1587302374.0, "score": 27, "author": "zenandshine", "num_comments": 14, "permalink": "/r/healthyeating/comments/g47jfl/how_do_i_make_chia_seeds_more_palatable/", "html_title": "Reddit - The heart of the internet"}
{"title": "What dip tastes good with cucumber?", "selftext": "Let me know your suggestions :). I'm trying to snack on veggies instead of junk and cucumbers are so cheap. I dont like eating them plain. Thanks everyone!", "url": "https://www.reddit.com/r/healthyeating/comments/frejhf/what_dip_tastes_good_with_cucumber/", "created_utc": 1585520304.0, "score": 28, "author": "momtoeli", "num_comments": 35, "permalink": "/r/healthyeating/comments/frejhf/what_dip_tastes_good_with_cucumber/", "html_title": "Reddit - The heart of the internet"}
{"title": "i want to quit fast food", "selftext": "hi yall i wanna quit fast food. i dont eat a whole lot as it is, usually one meal and snacks on work days. i am also a full time student and work full time. i have definitely not made good eating choices lately and one surgery later, im in worse shape than i was before. my generally poor health makes it tough to exercise sometimes but i have committed to do some every day. i have carved out time for it. i do also love healthy food but it seems the unhealthy stuff is so much more acessible\n.please help!\nstats:\n26/f/150lbs/4'10", "url": "https://www.reddit.com/r/healthyeating/comments/f5jc0s/i_want_to_quit_fast_food/", "created_utc": 1581988193.0, "score": 26, "author": "miichan4594", "num_comments": 17, "permalink": "/r/healthyeating/comments/f5jc0s/i_want_to_quit_fast_food/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to get enough nutrients despite severely low appetite?", "selftext": "I've been struggling with severely low appetite for months now.\n\nToday it really hit me that I can't go on eating bread and crackers all the time cause today I realised I haven't had a single vegetable or fruit in at least a week. \n\nI'm already very deficient in iron and it's been getting worse according to my blood tests.\n\nBut whenever I try to eat I just feel like I'm going to throw up. Now I'm really starting to dread having to eat. \n\nI'm a college student so I have a fairly small budget. \n\nHow can I get myself to eat more? And if that doesn't work, what are ways to eat more nutrient dense food? \n\nI'm very grateful for any and all replies.", "url": "https://www.reddit.com/r/healthyeating/comments/euuz2l/how_to_get_enough_nutrients_despite_severely_low/", "created_utc": 1580161335.0, "score": 30, "author": "suwiika", "num_comments": 42, "permalink": "/r/healthyeating/comments/euuz2l/how_to_get_enough_nutrients_despite_severely_low/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is it healthy to drink bat milk?", "selftext": "Hi,\n\nI was recently reading about all the different alternatives to cow milk and their nutritional value: goat milk, almond milk, oat milk, etc. But I couldn't find any information on whether or not it's healthy to drink bat milk.\n\nI really admire Batman and would prefer to drink bat milk over all those other boring milks if possible.", "url": "https://www.reddit.com/r/healthyeating/comments/10h81dl/is_it_healthy_to_drink_bat_milk/", "created_utc": 1674248484.0, "score": 29, "author": "None", "num_comments": 8, "permalink": "/r/healthyeating/comments/10h81dl/is_it_healthy_to_drink_bat_milk/", "html_title": "Reddit - The heart of the internet"}
{"title": "What is the benefit of replacing white sugar with maple syrup, coconut sugar, etc?", "selftext": "I’ve been seeing all these refined-sugar free recipes online that replace white sugar with other natural sweeteners. But other things I read say “sugar is sugar” and it’ll have the same effect on the body. \n\nSo can anyone educate me on why these natural sugars are better to use in place of white sugar? :) in cooking, baking, etc.", "url": "https://www.reddit.com/r/healthyeating/comments/qc7t4d/what_is_the_benefit_of_replacing_white_sugar_with/", "created_utc": 1634755343.0, "score": 26, "author": "None", "num_comments": 5, "permalink": "/r/healthyeating/comments/qc7t4d/what_is_the_benefit_of_replacing_white_sugar_with/", "html_title": "Reddit - The heart of the internet"}
{"title": "Unexpected low mood on healthier diet", "selftext": "I've been eating a healthier diet for 17 days now. Think many more veggies and fruit (on average 3 portions of veg and 2 of fruit per day) and less or no crisps, sweets, chocolate, chips, and fizzy drinks. This is the longest I've ever been able to stick to a healthier eating programme and I'm actually really proud of that!\n\nSo. I began to feel better in myself around the 12/13 day mark and noticed clearer skin, a more balanced mood, and my clothes were just a smidge less tight. However, the last couple of days I've been really irritable and grumpy. I just feel a little 'meh' and down in myself. The only thing I can think of is my new change in eating habits. Can anyone relate? Am I going crazy? What's up with me? \n\nThank you for reading and your thoughts are welcomed.", "url": "https://www.reddit.com/r/healthyeating/comments/p602mo/unexpected_low_mood_on_healthier_diet/", "created_utc": 1629190991.0, "score": 27, "author": "None", "num_comments": 12, "permalink": "/r/healthyeating/comments/p602mo/unexpected_low_mood_on_healthier_diet/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is eating too much fruit bad for you?", "selftext": "I’m really freaking myself out because I eat an insane amount of fruit most days because I just love it. I’ve always been kind of nervous about this since I started eating much healthier a year and a half ago or so and planning ahead and making my meals tomorrow I’ve realized just how much I really eat. Tomorrow In my meals I’ve planned I’m going to eat a banana, a Granny Smith apple, and a Greek yogurt parfait in a big bowl of strawberries, blueberries, and raspberries. Including even an entire 6 ounce package of raspberries in the bowl for my parfait because they always seem to go bad and get mushy after a day so I like to just eat them the day after when I get them every week or so. My family has a history of diabetes and I know that fruit has lots of natural sugar and carbs, but because they have so much fiber and because I’ve seen articles from trusted sources like Healthline before saying eating too much fruit is not really possible and doesn’t have a proven link to diabetes I’ve kind of never worried about it. I just enjoy fruit a lot and have made it a big part of my diet since I’ve started a healthier lifestyle. I’m still just a teenager and work out for an hour in the morning 6 days a week + go on a 20 or so minute walk every night, but things like this really worry me and I often stress myself out with fears of diabetes and things like that and it’s a struggle when it comes to food. If anyone can help me out with their advice and if they believe what I’m doing is fine or suggestions otherwise I would greatly appreciate it. Thank you", "url": "https://www.reddit.com/r/healthyeating/comments/oigbmu/is_eating_too_much_fruit_bad_for_you/", "created_utc": 1626050196.0, "score": 28, "author": "GoM4vs1", "num_comments": 12, "permalink": "/r/healthyeating/comments/oigbmu/is_eating_too_much_fruit_bad_for_you/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is it bad if I skip dinner to go to bed?", "selftext": "I work late and by the time I get home, I’m too tired to do anything let alone find something to eat.", "url": "https://www.reddit.com/r/healthyeating/comments/nb8fcy/is_it_bad_if_i_skip_dinner_to_go_to_bed/", "created_utc": 1620880279.0, "score": 27, "author": "unemira", "num_comments": 10, "permalink": "/r/healthyeating/comments/nb8fcy/is_it_bad_if_i_skip_dinner_to_go_to_bed/", "html_title": "Reddit - The heart of the internet"}
{"title": "I have a gag reflex when trying veggies and really need to get my act together", "selftext": "Hi, I'm 40 y/o and I have never eaten a salad.  Not even one.\n\nI've tried different veggies over the years but whenever it hits my tongue, instant gag reflex.  If it happens more than two or three times I will vomit.  I eat plain cheeseburgers and sandwiches, and the bigger the better.  When we go to restaurants and I get the biggest burger they have (usually the most expensive) and ask for it plain I really get some looks.  My wife and I cant even really eat at the same places.\n\nI'm getting on in years and it's really time that I start eating like an adult and not my kids.  I eat whatever is convenient, fast food mostly, just complete trash in general.  I actually just had labs done and my cholesterol was only \"slightly high\".\n\nSuggestions?", "url": "https://www.reddit.com/r/healthyeating/comments/mzruvh/i_have_a_gag_reflex_when_trying_veggies_and/", "created_utc": 1619539587.0, "score": 27, "author": "jtparton", "num_comments": 33, "permalink": "/r/healthyeating/comments/mzruvh/i_have_a_gag_reflex_when_trying_veggies_and/", "html_title": "Reddit - The heart of the internet"}
{"title": "What's your healthy alternative to pizza?", "selftext": "I think pizza is the thing I crave more than anything else.  When I'm craving pizza but want to stay on track I usually make a pizzadilla. Just a quesadilla with low carb Tortilla,  mozzarella,  then bell peppers, red onion, turkey pepperoni and black olives. Then I'll dip it in a marinara. \n\nBut I'm curious to see what other good pizza subs are out there?", "url": "https://www.reddit.com/r/healthyeating/comments/mcpn15/whats_your_healthy_alternative_to_pizza/", "created_utc": 1616645612.0, "score": 28, "author": "coolthumbfolks", "num_comments": 18, "permalink": "/r/healthyeating/comments/mcpn15/whats_your_healthy_alternative_to_pizza/", "html_title": "Reddit - The heart of the internet"}
{"title": "Are there any healthy drinks I can get at the store other than water?", "selftext": "I'm away at university right now, living in my apartment and when I'm here I'll buy one carton of of chocolate milk and one carton of juice every time I get groceries, just so I have something to drink every couple of meals that's not water.\n\nBut now I want to start avoiding them because I'm trying to improve my diet. The typical fruit juices are super sugary and chocolate milk can't be that great for you either. Are there other kinds of juices and shit that I could get instead at the store that are healthier? I'm just getting tired of drinking straight water all the time. I like drinking water but I'd also like something with a little flavour to it every now and then.", "url": "https://www.reddit.com/r/healthyeating/comments/l5lhib/are_there_any_healthy_drinks_i_can_get_at_the/", "created_utc": 1611689313.0, "score": 26, "author": "Reudn", "num_comments": 20, "permalink": "/r/healthyeating/comments/l5lhib/are_there_any_healthy_drinks_i_can_get_at_the/", "html_title": "Reddit - The heart of the internet"}
{"title": "Alternatives to soda ??", "selftext": "does anybody know any good, healthy alternatives to soda? i drink soda almost everyday, and i want to start quitting. this has been going on for almost my entire life (i'm 21 yrs old).", "url": "https://www.reddit.com/r/healthyeating/comments/i6bp3e/alternatives_to_soda/", "created_utc": 1596939760.0, "score": 26, "author": "ced14986", "num_comments": 58, "permalink": "/r/healthyeating/comments/i6bp3e/alternatives_to_soda/", "html_title": "Reddit - The heart of the internet"}
{"title": "Forks over Knives", "selftext": "So, after definitely being diagnosed with HBP and having a jamaican parent constantly against vegetarian/plant based, ive decided to try out Forks over Knives plant based diet. I’m so excited. There are definitely two types of vegan, there’s plant-based vegan then there’s the packaged high sodium, highly processed food vegan. 😳 When I learned that there’s over 66% of your daily value of SODIUM when eating the vegan nuggets I almost cried. \nI hope to use this reddit community as support as well to post the meals I make while in college!!! I’m 21 and definitely want to change my life and body before it’s too late.  No matter the exercise, it’s what goes in that matters. I’ve reviewed forks over knives book and it’s awesome!", "url": "https://www.reddit.com/r/healthyeating/comments/hxv1dt/forks_over_knives/", "created_utc": 1595714141.0, "score": 27, "author": "strivingforlove", "num_comments": 11, "permalink": "/r/healthyeating/comments/hxv1dt/forks_over_knives/", "html_title": "Reddit - The heart of the internet"}
{"title": "It's time to start eating healthy, where do I start?", "selftext": "I'm 25 years old and I have never ate vegetables, and the only fruit I ever eat is Bananas. \n\nI'm starting to get worried about my health and what to try to start eating healthy. Where do I start? I tried eating cucumber the other day but I instantly gagged at the texture, I couldn't force myself to eat it. I really need help, any pointers on where to start?", "url": "https://www.reddit.com/r/healthyeating/comments/h7es2d/its_time_to_start_eating_healthy_where_do_i_start/", "created_utc": 1591939799.0, "score": 26, "author": "indieburgerz", "num_comments": 36, "permalink": "/r/healthyeating/comments/h7es2d/its_time_to_start_eating_healthy_where_do_i_start/", "html_title": "Reddit - The heart of the internet"}
{"title": "Best Cheese for a Grilled Peach Salad?", "selftext": "Hey guys.  I'm looking at going vegetarian (for health reasons; my dietitian said it might be easier on my body to do that for a while).  Right now I'm looking at eating a ton of salads because I like cheesy and fruity salads.  I want to make a grilled peach salad with grilled peaches, mixed greens, walnuts, and some kind of cheese.  I think of it as a creamy cheese, almost sweet, but I don't know enough about cheeses to pick the best one.  What do you guys suggest?", "url": "https://www.reddit.com/r/healthyeating/comments/gwi987/best_cheese_for_a_grilled_peach_salad/", "created_utc": 1591280133.0, "score": 27, "author": "TalaLeisu2", "num_comments": 13, "permalink": "/r/healthyeating/comments/gwi987/best_cheese_for_a_grilled_peach_salad/", "html_title": "Reddit - The heart of the internet"}
{"title": "Daily Water Intake", "selftext": "Hey Guys,\n\nSo Im a pretty healthy eater but after some guildence from a health guru, I realized that I really need to concentrate on my daily water intake. I do drink water every day but probably only, at most, about half that I truly need. She had said that this is one of the things that can significantly help your health (physically and mentally,) which Im all about!\n\nBecause of my weight,  I need to drink around 60 ounces a day. So since Saturday, Ive been doing that, its alot easier then I thought just refilling a 24 ounce bottle 3 times, puts me a little over what I need. Ive been peeing alot more obviously, which is... annoying but whatever. XD\n\nNow here is my thing, I know I JUST started and I guess my body is just readjusting to this but I dont necessarly feel any better. In fact, my body kind of feels crappy, just like slightly bloated, specifically when I wake up. I get or hope its just in shock but when will this get better? Should I drink less and slowly drink more over time? Or is this completely normal and will take a week or two or more to get comfortable?", "url": "https://www.reddit.com/r/healthyeating/comments/fwm3i0/daily_water_intake/", "created_utc": 1586272043.0, "score": 25, "author": "CaptKirky", "num_comments": 16, "permalink": "/r/healthyeating/comments/fwm3i0/daily_water_intake/", "html_title": "Reddit - The heart of the internet"}
{"title": "Maintaining healthy eating with no available refrigeration.", "selftext": "Hi all - first ever post - looking for some advice\n\nSoon I’ll be commuting roughly an hour each day to study, and my class times vary each day. At this stage, I haven’t seen anywhere that I’ll be able to store food and keep it hygienic, I doubt that I’ll be able to anyway. \n\nFor those in similar situations, I’m wondering two things: What foods you generally take to maintain a healthy diet and also how you go about making sure it stays safe to eat, especially if you consume meats and other susceptible foods? I’m looking to avoid buying food where possible as well. \n\nThanks everyone, anything is helpful!", "url": "https://www.reddit.com/r/healthyeating/comments/ep0qqh/maintaining_healthy_eating_with_no_available/", "created_utc": 1579084916.0, "score": 27, "author": "Crudds", "num_comments": 18, "permalink": "/r/healthyeating/comments/ep0qqh/maintaining_healthy_eating_with_no_available/", "html_title": "Reddit - The heart of the internet"}
{"title": "Down a dress size 15 days after Quitting Sugar", "selftext": " Last week I weighed myself and found I had lost 5 pounds after quitting the absolutely ridiculous amount of added sugar I was consuming every day. I have been looking at the sugar content of all the food and drink I'm consuming recently, and my old sugar habit was even worse than I thought. I am so embarrassed to even admit this, but on average I was ingesting OVER 200 GRAMS of sugar each day!!!!! That's 780 calories a day, or 5500 a week. I always knew, somewhere in the back of my mind that I really do not eat very much, volume wise. I also knew the food I eat is fairly healthy. I knew that being borderline obese was SOLEY down to the sugary drinks I existed on. But I didn't expect the weight/inch loss to be this immediate.\n\nAs I have mentioned before, I do not trust the scales much. But I couldn't find my tape measure. Well earlier on, I tried on this beautiful silk designer maxi skirt that I bought from a thrift store a while ago but have only worn a couple of times due to it being so small, it's size 14 AUS (18 USA). When I bought it, it went on, but I had to wear the band very high up so the zip would close. But now it fits just right and stops the perfect length just 3cms from the ground now it isn't hoiked up.\n\nI immediately searched all my drawers and cupboards, found my tape measure and was delighted to find that my hips now measure 41.3 inches, instead of the 43 they were just two weeks ago! Omg!!!! This is in just TWO WEEKS!!!! :O Crazy! I am officially a size 14 again (in most stores), and I will be able to shop anywhere without worrying if they will have my size available. I am so happy I have done this. It's very easy to not eat sugar any more, but I have just given up smoking as well, so of course I am worried that might make me gain. I will just stick to my old motto of 'if you don't buy it, you won't try it', and maybe start going to the gym if absolutely necessary. I will check back in in a few more weeks to update on my slimming progress :)", "url": "https://www.reddit.com/r/healthyeating/comments/dqlyv9/down_a_dress_size_15_days_after_quitting_sugar/", "created_utc": 1572709750.0, "score": 27, "author": "__Hmm_", "num_comments": 8, "permalink": "/r/healthyeating/comments/dqlyv9/down_a_dress_size_15_days_after_quitting_sugar/", "html_title": "Reddit - The heart of the internet"}
{"title": "U.S. food additives banned in Europe: Expert says what Americans eat is \"almost certainly\" making them sick", "selftext": "", "url": "https://www.cbsnews.com/news/us-food-additives-banned-europe-making-americans-sick-expert-says/", "created_utc": 1677119653.0, "score": 27, "author": "rdvw", "num_comments": 2, "permalink": "/r/healthyeating/comments/119ly4n/us_food_additives_banned_in_europe_expert_says/", "html_title": "U.S. food additives banned in Europe: Expert says what Americans eat is \"almost certainly\" making them sick - CBS News"}
{"title": "Higher dietary fibre intake is associated with increased skeletal muscle mass and strength in adults aged 40 years and older", "selftext": "Paper link: [https://pubmed.ncbi.nlm.nih.gov/34585852/](https://pubmed.ncbi.nlm.nih.gov/34585852/)", "url": "https://www.reddit.com/r/healthyeating/comments/q1c67o/higher_dietary_fibre_intake_is_associated_with/", "created_utc": 1633373623.0, "score": 26, "author": "mlhnrca", "num_comments": 6, "permalink": "/r/healthyeating/comments/q1c67o/higher_dietary_fibre_intake_is_associated_with/", "html_title": "Reddit - The heart of the internet"}
{"title": "My brother has been suggesting that drinking sparkling water or water with unsweetened True Citrus packets should only be done in moderation, but I've been consuming them relatively frequently. He seems like a purist and I'm just trying to be healthier by avoiding regular or diet soda... thoughts?", "selftext": "", "url": "https://www.reddit.com/r/healthyeating/comments/ohvapu/my_brother_has_been_suggesting_that_drinking/", "created_utc": 1625967280.0, "score": 27, "author": "None", "num_comments": 29, "permalink": "/r/healthyeating/comments/ohvapu/my_brother_has_been_suggesting_that_drinking/", "html_title": "Reddit - The heart of the internet"}
{"title": "trying to eat healthy but doesn't seem to be working", "selftext": "I have a food app that I input my meals in to see if I'm getting the daily recommended vitamins and such. I always have really high sat fat and sodium and low everything else. I've made changes to my diet. I don't know what else to do. I know I can eat more fruits and veg for some of the vitamins, but how do I lower the sat fat and sodium? I can't even eat a salad without my sodium level going over.", "url": "https://www.reddit.com/r/healthyeating/comments/msym84/trying_to_eat_healthy_but_doesnt_seem_to_be/", "created_utc": 1618691901.0, "score": 26, "author": "kbsths99", "num_comments": 17, "permalink": "/r/healthyeating/comments/msym84/trying_to_eat_healthy_but_doesnt_seem_to_be/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to actually start?", "selftext": "This question has probably been posed thousands of times before, however, I didn't see anything in my preliminary search.\n\nMy wife and I have terrible diets. We eat way more than our fair share. We cut out all sugary drinks, energy drinks and alcohol back on Halloween and only started allowing ourselves a weekly allowance of 50 oz. My main question is where do we start to curb out eating habits? I am usually a one meal a day sort of person. I eat once and I am usually not hungry again but I eat again whenever she says she is hungry.\n\nDo people actually cook every single night? That is what burdens me and keeps me from doing it. I don't understand how to buy groceries for that sort of thing. I don't know how to cook perfect quantities so we don't end up with 5 sets of left overs in the fridge that go bad and end up in the trash can.  Do people just eat the same thing every week so that its easier to shop they just buy the same things? These questions sound so trivial but they keep me from fixing my diet so.\n\nAny advice is welcome, and I appreciate your time.", "url": "https://www.reddit.com/r/healthyeating/comments/k4dd1j/how_to_actually_start/", "created_utc": 1606795963.0, "score": 26, "author": "herpderp7yearsago", "num_comments": 21, "permalink": "/r/healthyeating/comments/k4dd1j/how_to_actually_start/", "html_title": "Reddit - The heart of the internet"}
{"title": "What healthy foods can I eat during this lockdown ?", "selftext": "\nSo most of us by now are stuck at home and barely going out to get groceries. I really want to eat healthy but I just end up eating processed food like canned goods or frozens.  And I don’t know how to cook food and making a healthy one would be more of a challenge. What would you guys suggest for me to eat or any healthy food that will be easy to cook for someone like me ?", "url": "https://www.reddit.com/r/healthyeating/comments/gmm7jm/what_healthy_foods_can_i_eat_during_this_lockdown/", "created_utc": 1589885232.0, "score": 26, "author": "KingTommmmy", "num_comments": 14, "permalink": "/r/healthyeating/comments/gmm7jm/what_healthy_foods_can_i_eat_during_this_lockdown/", "html_title": "Reddit - The heart of the internet"}
{"title": "Help with family's eating habits", "selftext": "Part rant, part request for advice.\n\nI have a family member that always comments on my healthy eating with things like \"why dont you like pizza anymore?\" \"Why cant you just eat what's here?\" \"You smell like a vegetable\" And \"I think we have enough of whatever YOU PEOPLE eat.\" When I get irritated, they backpedal and claim they were \"just joking.\" This happens a few times a month.\n\nWhat's more, when we travel together I encourage them to eat fruit fiber and healthy proteins to help with our family's genetic digestive issues. Then they're AMAZED when they feel so much better after eating healthy things. I started my healthy eating about 8 years ago and we have the same digestive issues, so i truly feel that I have a lot of good information to offer.\n\nThis person subsists on chips, microwave meals, cheese, and other snack food. Theyll eat 2 pancakes and nothing else for the rest of the day,so by the time they feel hungry, they're so nutrient-deprived, they reach for whatever is there.\n\nTheyve just recently started to eat yogurt and fruit for breakfast but constantly complain about how gross it is. They hate cooking so that doesnt help at all. \n\nTheyve been trying for years to eat healthy and know they need to. They fall off the wagon and it takes MONTHS for them to get back on. I try not to pressure them too much because they're an adult. But I get frustrated and tend to come off as judgy when they start talking about how awful and fat they feel (their words, not mine).\n\nHow do I shake off the negative comments and truly help with their healthy lifestyle changes, and stop acting like a judgemental asshole?", "url": "https://www.reddit.com/r/healthyeating/comments/eh9mzd/help_with_familys_eating_habits/", "created_utc": 1577645140.0, "score": 25, "author": "Thefoodwoob", "num_comments": 5, "permalink": "/r/healthyeating/comments/eh9mzd/help_with_familys_eating_habits/", "html_title": "Reddit - The heart of the internet"}
{"title": "How poor sleep can wreck your eating habits", "selftext": "*I'm an editor at The Washington Post and we just published a story about the correlation between sleep and nutrition.* \n\n*Health columnist, Anahad O'Connor writes:* \n\nPeople who are sleep deprived experience changes in their brain activity. Studies show that when a person misses out on sleep, the region of the brain involved in pleasure-seeking and reward [responds more strongly to junk foods](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3883872/) such as candy, doughnuts and pizza, creating more powerful urges to indulge in fattening foods. And sleep loss [causes decreased activity](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6344438/) in other parts of the brain that regulate food intake, making it [harder for people to exercise self-control](https://www.nature.com/articles/ncomms3259). \n\nOne trial found that when people slept just [5½ hours a night over a two-week period they consumed an extra 300 calories a day](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2615460/), mostly from snacks such as pretzels, cookies, chips, ice cream and candy. St-Onge analyzed many of these trials and concluded that, on average, people eat between 300 and 550 calories more on days when they are sleep deprived compared with when they could sleep seven hours or more. \n\n**You can read the full story here: There's no paywall, although you may be asked to provide an email address.** [**https://www.washingtonpost.com/wellness/2022/09/13/eating-lab-sleep-food-weight-loss/**](https://www.washingtonpost.com/wellness/2022/09/13/eating-lab-sleep-food-weight-loss/)", "url": "https://www.reddit.com/r/healthyeating/comments/xdf16g/how_poor_sleep_can_wreck_your_eating_habits/", "created_utc": 1663094466.0, "score": 25, "author": "AvivaLoeb", "num_comments": 3, "permalink": "/r/healthyeating/comments/xdf16g/how_poor_sleep_can_wreck_your_eating_habits/", "html_title": "Reddit - The heart of the internet"}
{"title": "Is drinking 750ml per day of vegetable smoothie okay ?", "selftext": "So I started doing smoothies with vegetables everyday because its fast and I didn't eat any vegetables before. My smoothies mainly contain spinach, kiwi, cucumber sometimes, green pepper, chia, arugula, green grapes and bananna/dried berries/honey(one of the 3) for sweetening. The recipe varies of course, I don't include always all of those. When I add 2 cups of water it gets around 750ml-1L of smoothie. I drink it throughout the day.", "url": "https://www.reddit.com/r/healthyeating/comments/mgdvbg/is_drinking_750ml_per_day_of_vegetable_smoothie/", "created_utc": 1617103945.0, "score": 25, "author": "hillsong1", "num_comments": 19, "permalink": "/r/healthyeating/comments/mgdvbg/is_drinking_750ml_per_day_of_vegetable_smoothie/", "html_title": "Reddit - The heart of the internet"}
{"title": "Switch from processed foods to healthy is messing with my health", "selftext": "For several months now I have been eating healthy and exercising as usual, I have always been thin and slim. Half a year ago I stopped eating processed foods, I never had issues with my blood work until recently.I now have high cholesterol and am deficient now in terms of vitamins. I’ve never had issues when I only ate fast food and frozen foods.🤨", "url": "https://www.reddit.com/r/healthyeating/comments/m1m2u2/switch_from_processed_foods_to_healthy_is_messing/", "created_utc": 1615340257.0, "score": 24, "author": "applebottomjeans2000", "num_comments": 13, "permalink": "/r/healthyeating/comments/m1m2u2/switch_from_processed_foods_to_healthy_is_messing/", "html_title": ""}
{"title": "I've been eating one/two meals a day for a while and I never felt better. Is there any reason for that?", "selftext": " I would've expected to feel fatigued by eating less, but I have a lot of energy and generally feel more healthy. Can somebody explain why that is?", "url": "https://www.reddit.com/r/healthyeating/comments/js5xng/ive_been_eating_onetwo_meals_a_day_for_a_while/", "created_utc": 1605091128.0, "score": 25, "author": "CaterpillarOk9962", "num_comments": 10, "permalink": "/r/healthyeating/comments/js5xng/ive_been_eating_onetwo_meals_a_day_for_a_while/", "html_title": ""}
{"title": "Free tool to help customers with food restrictions dine safer", "selftext": "Hi!  I'm part of a team has developed software to help those who have particular dietary restrictions dine more safely in restaurants.\n\nHere's the workflow:\n\n1. Restaurants create an account and are given a custom QR code to print out (and place on menus, or another spot).\n2. They input their menu on the platform and add tags to each menu item that violates certain dietary restrictions.  For example, if I added \"Peanut Butter & Jelly Sandwich\"  as a dish, I would include the tag \\[contains nuts\\]. If I inputed \"Cheeseburger\" I would include the tags \\[non-vegetarian\\], \\[dairy\\], etc on the platform.\n3. Customer can then scan the QR code and simply input their dietary restrictions. The platform will  display the menu items they can and can't have!\n\nWe already have several restaurants onboard ready for our launch date on Monday. We would love for others on this subreddit to also implement our system so we can together help customers have better dining experiences. Please PM me if you are interested. I'd love to talk and have this help you run your restaurant.\n\nNOTE: It's all free. We just want to help :)", "url": "https://www.reddit.com/r/healthyeating/comments/hew1a1/free_tool_to_help_customers_with_food/", "created_utc": 1592981030.0, "score": 26, "author": "aairfan", "num_comments": 3, "permalink": "/r/healthyeating/comments/hew1a1/free_tool_to_help_customers_with_food/", "html_title": ""}
{"title": "Does sodium intake effect fat loss or just the number on the scale?", "selftext": "I’ve been counting calories trying to get my weight to a more preferable number. I’ve noticed while I seem to be staying in my recommended limits on everything else quite easy, my sodium intake is normally cutting it close or above recommended and I’m wondering if this just effects retaining water weight or if it is genuinely going to hold me back from my goals. Thanks in advance!", "url": "https://www.reddit.com/r/healthyeating/comments/g8xvlq/does_sodium_intake_effect_fat_loss_or_just_the/", "created_utc": 1587981407.0, "score": 26, "author": "CactusJackkkk", "num_comments": 3, "permalink": "/r/healthyeating/comments/g8xvlq/does_sodium_intake_effect_fat_loss_or_just_the/", "html_title": ""}
{"title": "Confused as to lack of weight loss on my current diet.", "selftext": "I eat what by any standard I can find should be a healthy, low calorie, healthy-levels-of-fat diet. I've counted my calories, the amount of unsaturated and saturated fat in my diet and I usually eat little to no sugar at all on most days. I should be getting close to the ideal amount of unsaturated fat, carbs, vitamins and minerals, according to any source have found. I've started excercising again too, I do 80-100 squats wearing a 30kg weighted vest at least twice a week.  \n\n\nI have around:  \n30g sunflower seeds.  \n30g chia seeds.  \n30g brazil nuts.  \n75g gluten free rice, cooled after cooking to make the carbs complex.  \n100g sun-dried tomatoes (they some with sunflower oil but I drain most of it).  \n100g spinach.  \nand 400g chicken with a dash or two of extra-virgin olive oil.\n\nThis should add up to around 1900 calories, much less than the 2500 apparently required to stay at the same weight for a man, and yet I'm still overweight and have been since Christmas. I'm hoping the reason I'm not losing weight is because of muscle gain, any thoughts?  \n\n\nWhen I do have sugar, I must admit it's more than the recommended amount, but I only do that once or twice a week, and even then it's not ridiculously more than the recommended amount. I know the recommended max is like 9 teaspoons of sugar, I might have twice as much as that only one day of the week, the rest is generally much less per day.  \n\n\nIs that one day of the week really preventing me from losing weight entirely in spite of everything else I'm doing? Because, I might have self control, but cutting out sugar entirely is hard to fathom in the long term.", "url": "https://www.reddit.com/r/healthyeating/comments/fd46kz/confused_as_to_lack_of_weight_loss_on_my_current/", "created_utc": 1583280357.0, "score": 26, "author": "AnOddFad", "num_comments": 12, "permalink": "/r/healthyeating/comments/fd46kz/confused_as_to_lack_of_weight_loss_on_my_current/", "html_title": ""}
{"title": "Trying to cut back on sodium intake and overall eat healthier", "selftext": "I came to a realization today that my digestive problems and overall feeling unwell may be due to way too much sodium in my diet. I know I sometimes have days where I indulge in comfort foods like ramen or salty snacks such as chips, cheezits, crackers etc. but I try to make healthy meals most of the time. However, even if these meals are so called “healthy” I’ve realized they may be loaded with sodium. For example, I’ll make eggs or avocado toast for breakfast and add salt or everything bagel seasoning, the other day I made a delicious homemade chicken stock for soup which obviously had salt, I make a lot of asian meals which call for soy sauce or something similar. I just love that salty taste in everything but I know I need to cut back. How can I still make my favorite foods taste good with much less sodium? Will it just take getting used to?", "url": "https://www.reddit.com/r/healthyeating/comments/ehfhf9/trying_to_cut_back_on_sodium_intake_and_overall/", "created_utc": 1577671851.0, "score": 26, "author": "None", "num_comments": 11, "permalink": "/r/healthyeating/comments/ehfhf9/trying_to_cut_back_on_sodium_intake_and_overall/", "html_title": ""}
{"title": "Trying to explain to my family that you don’t need to be rich to eat healthy. (See rest of post for desperate cry for help lol)", "selftext": "I’ve been real adamant about this stuff to them because I love them, we have a pretty good relashonship. Except for some tiny things I won’t get into here but. They always say we can’t afford it. Meanwhile I see Doritos, cakes etc luckily I got us off soda *somehow*. When I ever I search online it always “oh yea healthy eating is great, I shop at Whole Foods” first off there isn’t a Whole Foods around me also feeding a family of 5 or 6 off Whole Foods isn’t ideal. Or the horrible advice of just eat from a giant bag of beans. We are culturally a family that enjoys food. Maybe to much. I’m not saying we dont need to enjoy it. Just not seed oil filled horseshit. Please understand I’m not hating on the searches I got since, well the world is around me. We only have about $100-$200 maybe $300USD. The thing that bothers me is people say we have to be rich to eat good. While spending 15 dollars on 4 bags of Doritos. I’m watching them and myself slowly dying. Im trapped in my body. I can barely work my psychical job, I’m not at the 600lb life yet. If you saw me you would think I’m not concerned about it. Im only slightly spry because I’m young. Once I loose some more weight I can work out more. Since my job is killing me at this current weight. Anyway any Advice on what to, it dosent even have to exactly fit this post.  ILL TAKE ANYTHING.  I can’t sit around and watch my family eat themselves to death. It’s hard enough have a couple bucks and being able to eat whatever I want. (Possible eating disorder not blaming that since I’m feeding the myself the cheeseburger, im giving context and also I’m saying if we all support as a family we can get better) I’m sorry for the rant but I wanted to give as much info as possible, I still let out some. Feel free to comment or dm I’ll do my best thank you! \nAlso grammer im on my phone.", "url": "https://www.reddit.com/r/healthyeating/comments/z89l69/trying_to_explain_to_my_family_that_you_dont_need/", "created_utc": 1669763828.0, "score": 24, "author": "None", "num_comments": 15, "permalink": "/r/healthyeating/comments/z89l69/trying_to_explain_to_my_family_that_you_dont_need/", "html_title": ""}
{"title": "Learning to eat healthy", "selftext": "My wife and I need to go on a heart healthy diet and also lose some weight. All the recipes I find call for fresh foods. Can we eat heart healthy and still used canned and frozen items? Fresh is a little expensive.", "url": "https://www.reddit.com/r/healthyeating/comments/oow4ym/learning_to_eat_healthy/", "created_utc": 1626892822.0, "score": 24, "author": "PM_ME_UR_STRBX", "num_comments": 7, "permalink": "/r/healthyeating/comments/oow4ym/learning_to_eat_healthy/", "html_title": ""}
{"title": "Why when I drink wine my veins stick out?Whenever I drink wine my veins stick out in both sides of my forehead and lasts for 2,3 days..this doesn't seem to happen when drinking other beverages, only if it's too much.", "selftext": "https://fi.realself.com/545/57fc337e5271bdd8f8e9948c161abf5e/c/6/2/userimage-2343486.JPG", "url": "https://www.reddit.com/r/healthyeating/comments/nzp2o4/why_when_i_drink_wine_my_veins_stick_outwhenever/", "created_utc": 1623683702.0, "score": 24, "author": "Original_Ad_2995", "num_comments": 15, "permalink": "/r/healthyeating/comments/nzp2o4/why_when_i_drink_wine_my_veins_stick_outwhenever/", "html_title": ""}
{"title": "Meal prepping hacks, anyone?", "selftext": "Hi guys, can you share your meal prepping tips and tricks? Usually what I do is prepare fresh, raw vegetables for the next two to three days. I thoroughly clean and put in air tight containers: salad, brocolli, carrots, cauliflower, fennel, etc. And when the time comes I just take what I need. It takes some time but it saves me some time.", "url": "https://www.reddit.com/r/healthyeating/comments/mht5vb/meal_prepping_hacks_anyone/", "created_utc": 1617276103.0, "score": 23, "author": "rdvw", "num_comments": 10, "permalink": "/r/healthyeating/comments/mht5vb/meal_prepping_hacks_anyone/", "html_title": ""}
{"title": "Struggling to find time to eat healthily?", "selftext": "I am trying to put more effort into having a healthy lifestyle, including eating well. My main reason is so that I want to have more energy and just generally feel better.\n\nHere’s the problem I am finding. To make a healthy meal from scratch is taking me 20-30 minutes. But the main issue for me is how long it takes me to eat the meal. Chewing through lots of vegetables and chicken and other healthy foods can mean it takes me 30+ minutes to actually eat the meal. So from start to finish that is over an hour just for one meal. Multiply that by three and a large part of my day has gone just on eating. Does anyone have any suggestions on what I can eat that doesn’t take as long? Thanks", "url": "https://www.reddit.com/r/healthyeating/comments/mh6x3c/struggling_to_find_time_to_eat_healthily/", "created_utc": 1617199761.0, "score": 24, "author": "None", "num_comments": 17, "permalink": "/r/healthyeating/comments/mh6x3c/struggling_to_find_time_to_eat_healthily/", "html_title": ""}
{"title": "Wanting a better relationship with my food. What actually works?", "selftext": "I love food, but I also demonize it sometimes. I eat what I would consider healthy most of the time, but I realized that I have this idea that some foods are \"good\" and some are \"bad\". I really dislike this because I know all food is food, and I'm not \"bad\" for eating \"bad\" foods. Has anyone been in my shoes? What helps to eating foods that I want to eat, not because they are \"good\" or \"bad\"?", "url": "https://www.reddit.com/r/healthyeating/comments/jxu97s/wanting_a_better_relationship_with_my_food_what/", "created_utc": 1605895991.0, "score": 25, "author": "barelyyellow88", "num_comments": 9, "permalink": "/r/healthyeating/comments/jxu97s/wanting_a_better_relationship_with_my_food_what/", "html_title": ""}
{"title": "Tips to improve my self-control/willpower", "selftext": "I have a snacking problem. Pretty much my whole childhood my mother loved to buy our family unhealthy snacks like chips, cookies, candy, soda, etc. As a result I was quite a chunky kid. I was able to kick the unhealthy snacking when I was about 13-ish solely due to a desire to lose weight. Once I went to college and started grocery shopping for myself I made it an effort to never buy unhealthy snacks so unhealthy snacking was never an option for me in the first place.\n\nFast forward to today. I've been living with my fiance for the first time for about a month now. She, unlike me, loves chips, sweets, etc., and has wonderful self control and doesn't over indulge. She tends to do a majority of our grocery shopping and even buys healthier snack options for me, but because my willpower is garbage I always gravitate to the unhealthy options first. Since we have moved in together I have already gained 5lbs.\n\nAny tips or suggestions would be appreciated 😓", "url": "https://www.reddit.com/r/healthyeating/comments/ioi8n8/tips_to_improve_my_selfcontrolwillpower/", "created_utc": 1599519974.0, "score": 24, "author": "dwilker", "num_comments": 6, "permalink": "/r/healthyeating/comments/ioi8n8/tips_to_improve_my_selfcontrolwillpower/", "html_title": ""}
{"title": "How bad is subway for you ?", "selftext": "So i'm trying to lose weight and i have lost about 20 pounds sense march.  On my days off from work instead of cooking i eat subway. I remember hearing about that guy who lost a bunch of weight on subway and i was wondering how healthy it could be.  I get a honey oat whatever kind of meat i feel like getting , swizz and shredded cheese , lettuce , tomato and bbq sauce.  So i was wondering if that was decently healthy or maybe i should start getting something else ??", "url": "https://www.reddit.com/r/healthyeating/comments/hp7g9o/how_bad_is_subway_for_you/", "created_utc": 1594461033.0, "score": 23, "author": "needalife94", "num_comments": 24, "permalink": "/r/healthyeating/comments/hp7g9o/how_bad_is_subway_for_you/", "html_title": ""}
{"title": "Anyone have any advice on how not to over eat late at night?", "selftext": "", "url": "https://www.reddit.com/r/healthyeating/comments/hope8a/anyone_have_any_advice_on_how_not_to_over_eat/", "created_utc": 1594389495.0, "score": 24, "author": "None", "num_comments": 15, "permalink": "/r/healthyeating/comments/hope8a/anyone_have_any_advice_on_how_not_to_over_eat/", "html_title": ""}
{"title": "Healthy alternative for flavored coffee creamer?", "selftext": "I only have one cup of coffee a day but really love adding creamer. My favorite is Coffee Mate French Vanilla. I'm trying to find a flavorful alternative that isn't as bad for you. Any ideas?\n\nEDIT: You all are gems - thank you!", "url": "https://www.reddit.com/r/healthyeating/comments/gr2cnm/healthy_alternative_for_flavored_coffee_creamer/", "created_utc": 1590516939.0, "score": 24, "author": "nycblr", "num_comments": 18, "permalink": "/r/healthyeating/comments/gr2cnm/healthy_alternative_for_flavored_coffee_creamer/", "html_title": ""}
{"title": "Any tips on to lose weight", "selftext": "I’m 17 and graduated high school. I plan on going to a technical college to get my welding certification but after college I want to join the military it’s always been a goal of mine but I’m mostly afraid to enlist since my body weight is big. Is there any tips to lose weight during corona virus and after to help me get in shape?", "url": "https://www.reddit.com/r/healthyeating/comments/gkwpf2/any_tips_on_to_lose_weight/", "created_utc": 1589643727.0, "score": 24, "author": "TheRichGamer815", "num_comments": 13, "permalink": "/r/healthyeating/comments/gkwpf2/any_tips_on_to_lose_weight/", "html_title": ""}
{"title": "Will Halo Top and other sugar substitutes cause a gain in belly fat?", "selftext": "Today I found [this article](https://www.google.com/amp/s/info.dralexrinehart.com/articles/sugar-substitutes-weight-gain-mechanisms%3fhs_amp=true) after enjoying a pint of light ice cream. It fit in my macros and calories, so I assumed there’s no harm, and i’ve been eating these for a few months now (about one a week). I’m 6’ 1” and weigh 140lbs, and moderately active. This article kinda frightened me a bit, especially because I have a stock of 4 more Halo Tops in the freezer. Any help?", "url": "https://www.reddit.com/r/healthyeating/comments/ga0125/will_halo_top_and_other_sugar_substitutes_cause_a/", "created_utc": 1588123099.0, "score": 24, "author": "rslashIcePoseidon", "num_comments": 7, "permalink": "/r/healthyeating/comments/ga0125/will_halo_top_and_other_sugar_substitutes_cause_a/", "html_title": ""}
{"title": "How to eat 3 meals a day", "selftext": "I have been dieting for a month now and have lost about 8 pounds. However, I only eat two light meals a day and feel like I am losing weight the wrong way. Does anyone have any tips on how to eat three meals a day.", "url": "https://www.reddit.com/r/healthyeating/comments/g7cxhg/how_to_eat_3_meals_a_day/", "created_utc": 1587750433.0, "score": 22, "author": "buckrun13", "num_comments": 9, "permalink": "/r/healthyeating/comments/g7cxhg/how_to_eat_3_meals_a_day/", "html_title": ""}
{"title": "How do I break the cycle?", "selftext": "I have realized that I'm stuck in an endless cycle. I will start aggressively eating healthy and cutting way back on food consumption. This usually works well for a little while and I don't crave unhealthy stuff that much during part of this cycle. I can usually keep that up for 1-2 weeks, but then I gradually return to my old bad habits over another 1-2 weeks. I stay on the old habits for a week or so until I realize what I've done and use my failure as motivation to force myself to eat healthy again. How do I break the cycle and stay in the healthy phase forever?", "url": "https://www.reddit.com/r/healthyeating/comments/s67en7/how_do_i_break_the_cycle/", "created_utc": 1642435428.0, "score": 23, "author": "me_gusta_helado", "num_comments": 14, "permalink": "/r/healthyeating/comments/s67en7/how_do_i_break_the_cycle/", "html_title": ""}
{"title": "How can I get used to eating healthy foods I dislike?", "selftext": "I (13 afab) hate trying new foods and I want to get healthier because I joined an after school sports club and I want to play on the teams next year. (My hate of trying new foods probably started when my nan forced 8-9 year old me to try broccoli.)\n\nI've tried bananas,raspberries and apples and disliked all three of them and I'd always choose a slice of cake over fruit or vegetables and I want to change that.\n\nAny help is wanted.", "url": "https://www.reddit.com/r/healthyeating/comments/ma4i3c/how_can_i_get_used_to_eating_healthy_foods_i/", "created_utc": 1616356132.0, "score": 25, "author": "UndertaleDood", "num_comments": 15, "permalink": "/r/healthyeating/comments/ma4i3c/how_can_i_get_used_to_eating_healthy_foods_i/", "html_title": ""}
{"title": "Water and bloating", "selftext": "Hi guys. I am a pretty healthy person besides the fact that I don’t drink enough water. Up until last week I probably averaged only 20-40oz of water a day. (It’s not that I drink soda because I don’t. I just don’t drink much of anything) \n\nLast week I bought a 40oz water bottle and have been drinking at least 80-100oz per day. I’ve gained like 2 lbs and feel bloated all the time. Is this normal? What can I do to reduce bloating? I’m on day 10 of drinking more water 😂", "url": "https://www.reddit.com/r/healthyeating/comments/lxtpkm/water_and_bloating/", "created_utc": 1614888031.0, "score": 23, "author": "kis1692", "num_comments": 3, "permalink": "/r/healthyeating/comments/lxtpkm/water_and_bloating/", "html_title": ""}
{"title": "What inspired you to start cooking for yourself?", "selftext": "Hi everyone! I’m planning on building a meal planning app for my final year project. The app aims to help people find recipes and personalize their meal plans to maintain healthy eating habits. \n\nIf you have the time, I’d really appreciate it if you could fill out this survey! I’m trying to understand what motivated everyone to start cooking :) \n\n[https://forms.gle/KTV3YrskC168PTbz9](https://forms.gle/KTV3YrskC168PTbz9)", "url": "https://www.reddit.com/r/healthyeating/comments/lro6eo/what_inspired_you_to_start_cooking_for_yourself/", "created_utc": 1614203985.0, "score": 23, "author": "junehua", "num_comments": 4, "permalink": "/r/healthyeating/comments/lro6eo/what_inspired_you_to_start_cooking_for_yourself/", "html_title": ""}
{"title": "Fallen back on the junk food wagon", "selftext": "I was eating so healthy for a solid month and I've fallen back into eating cookies and pudding cups every day for the last week 🤦‍♀️ who's got tips to get back to eating healthy again??", "url": "https://www.reddit.com/r/healthyeating/comments/jt13o5/fallen_back_on_the_junk_food_wagon/", "created_utc": 1605208738.0, "score": 22, "author": "atliticus98", "num_comments": 11, "permalink": "/r/healthyeating/comments/jt13o5/fallen_back_on_the_junk_food_wagon/", "html_title": ""}
{"title": "One meal per day", "selftext": "Hi all, since I’ve been able to work from home for a while now I’m eating significantly less during the day. (I chalk it up to eating while bored at work). I’ve lost about 30 pounds over the last 2-3 months and the lack of snacking would appear to be a pretty big factor. I only really eat a small breakfast and a large dinner now. I’m wondering if moving to one extra large meal per day would have a negative impact on my overall health or the progress I’ve made so far. Thanks in advance for any advice!", "url": "https://www.reddit.com/r/healthyeating/comments/hpu11q/one_meal_per_day/", "created_utc": 1594558866.0, "score": 23, "author": "hockeyguyak", "num_comments": 2, "permalink": "/r/healthyeating/comments/hpu11q/one_meal_per_day/", "html_title": ""}
{"title": "Does cauliflower rice store well in the freezer/more than 2 days in the fridge etc? Would just experiment but don't want to end up wasting any.", "selftext": "Hi, I have a lot of cauliflower. I like to make cauliflower rice and put it in my springrolls, but because I am low on time and springrolls are cold anyway, I don't want to go through the process of cooking it every day. I usually make one portion to eat, and one extra for the next day. \n\nAre there any people here who know from experience how long you can keep cauliflower rice (cooked and/or raw?) in the fridge, and if it freezes well (cooked or raw?). Does freezing it make the texture/taste different?\n\nI don't want to end up wasting any by ruining it or letting it go funky, but the internet seems to not be sure about this, so I wanted some opinions from real people who have dealt with this before. Thanks!", "url": "https://www.reddit.com/r/healthyeating/comments/hapjtd/does_cauliflower_rice_store_well_in_the/", "created_utc": 1592394159.0, "score": 22, "author": "None", "num_comments": 3, "permalink": "/r/healthyeating/comments/hapjtd/does_cauliflower_rice_store_well_in_the/", "html_title": ""}
{"title": "Is it okay to have 2 meals in the day instead of 3 meals? (Same amount of food overall)", "selftext": "This might of been asked before, but I was just wondering if it is unhealthy or not to have a regular breakfast meal and then combining lunch and dinner into one big meal? The food will all be with healthy ingredients and should still total out to the same caloric intake I normally have. I don't know if there are any potential negative effects from doing this, and just want to be sure if it's fine!\n\nThanks for your time, cheers!", "url": "https://www.reddit.com/r/healthyeating/comments/h90ryf/is_it_okay_to_have_2_meals_in_the_day_instead_of/", "created_utc": 1592165450.0, "score": 22, "author": "None", "num_comments": 9, "permalink": "/r/healthyeating/comments/h90ryf/is_it_okay_to_have_2_meals_in_the_day_instead_of/", "html_title": ""}
{"title": "Awkward eater trying to get healthy", "selftext": "I'm trying to live a healthier lifestyle but I have really weird sensitive taste buds. I know that I need to eat healthier other wise later on life it's going to come back and bite me! \n\nSo I'm after some good tasty meal suggestions that I can use to incorporate more veg in my diet. \n\nI don't have any allergies. (but my boyfriend is allergic to tomatoes, chillies and peppers so I tend to keep those out of my diet for his sake)\n\nHere is a list of some veg that I know I do like \n\n\\- carrots (especially raw)\n\n\\- potatoes\n\n\\- sweet potatoes \n\n\\- parsnips \n\n\\- broccoli (hit and miss, i don't really like it but CAN eat it if it's in my food..)\n\n\\- butternut squash\n\n\\- all kinds of herbs like rosemary, thyme, mint, coriander etc..\n\n\\- shallots \n\n\\- cabbage (if it's in the right form) \n\n\\- garlic / ginger / other things like this that add taste \n\n&#x200B;\n\nand that's about all i can think of.. \n\nI am a massive fan of all kinds of fruit so I try to eat those often but obviously they're not enough on their own. I also take supplements for iron and multivitamins where I can but I know that they're not enough on their own. \n\nSo please, Reddit, can you help with some meal ideas, or apps, websites that can help me explore?! \n\nI'm always open to suggestions of a new random type of veg that I might not have tried before..\n\nThank you in advance folks x", "url": "https://www.reddit.com/r/healthyeating/comments/ft0b2e/awkward_eater_trying_to_get_healthy/", "created_utc": 1585749654.0, "score": 23, "author": "teadawg1", "num_comments": 6, "permalink": "/r/healthyeating/comments/ft0b2e/awkward_eater_trying_to_get_healthy/", "html_title": ""}
{"title": "What’s your life-changing food hack?", "selftext": "I’m a sucker for the high-calorie sauces, including ranch and sour cream. \n\nI discovered mixing a bit of a ranch dry seasoning pack with Greek yogurt has blown my mind. It’s way less calories, and a lot higher in protein! And as for sour cream, straight up Greek yogurt. I can’t tell the difference! It’s made such a huge difference for me.", "url": "https://www.reddit.com/r/healthyeating/comments/10qcix8/whats_your_lifechanging_food_hack/", "created_utc": 1675204064.0, "score": 21, "author": "CardioCupcake", "num_comments": 5, "permalink": "/r/healthyeating/comments/10qcix8/whats_your_lifechanging_food_hack/", "html_title": ""}
{"title": "I do not know where to start.", "selftext": "What is a good beginning guide to healthy eating that won’t be overwhelming to understand.", "url": "https://www.reddit.com/r/healthyeating/comments/o9rrwe/i_do_not_know_where_to_start/", "created_utc": 1624909337.0, "score": 21, "author": "bassoonmonkey182", "num_comments": 10, "permalink": "/r/healthyeating/comments/o9rrwe/i_do_not_know_where_to_start/", "html_title": ""}
{"title": "Any tips when it comes to proportions?", "selftext": "Grown man if it matters. I'm not overweight or anything but I'm trying to tone up a bit and I'm confident my diet isn't perfect. Been buying \"healthier\" foods at the store lately and that can be easy. Water over juice, no junk food, etc. But currently I'm worried about the proportions I'm giving myself. Especially when it comes to foods like pasta or rice where it's easy to just pile it on. I can muck too when I want to, so I can eat a mountain of pasta or chicken and not think much of it.\n\nHow can I gauge proportions better, so I don't overeat during a meal? I remember seeing my mom actually weigh her meals and count calories but I think that's a little overkill for me. Anything simple tips I can keep in mind instead?", "url": "https://www.reddit.com/r/healthyeating/comments/lgg8uz/any_tips_when_it_comes_to_proportions/", "created_utc": 1612912647.0, "score": 22, "author": "Reudn", "num_comments": 10, "permalink": "/r/healthyeating/comments/lgg8uz/any_tips_when_it_comes_to_proportions/", "html_title": ""}
{"title": "Finding realistic food plans", "selftext": "So I'm 27F overweight because of having a baby and getting lazy. I'm trying to focus on healthier foods but need foods that keep me full longer. I try to eat 4-6 times a day with smaller meals but am struggling because I'm still hungry. Like yeah cereal is easy but I'm hungry an hour later.", "url": "https://www.reddit.com/r/healthyeating/comments/h7mupp/finding_realistic_food_plans/", "created_utc": 1591975917.0, "score": 22, "author": "CassieAllen92", "num_comments": 12, "permalink": "/r/healthyeating/comments/h7mupp/finding_realistic_food_plans/", "html_title": ""}
{"title": "Am I drinking too much juice? (Craving sweet things)", "selftext": "Hi, I’m new here.\n\nI love sweets so it is my guilty pleasure to drink juice everyday. I used to drink soda so this felt like progress but I am afraid that maybe it is not that healthy either. Every day I drink about 400 ml (almost 2 cups) of a store bought juice made from concentrates of multiple fruit (grapes, pineapple, apple and orange, listed in proportion of highest to lowest amount). It has 9 grams of sugar per 100 ml.\n\nIs 400ml of store bought juice too much? Should I drink more water instead? Or perhaps get a juicer and make homemade juices without added sugar? Or am I overreacting and this is perfectly normal?\n\nDiabetes runs in my family so I’m kind of afraid that too of a high sugar and fat intake might increase my chance to get it.", "url": "https://www.reddit.com/r/healthyeating/comments/gkec0f/am_i_drinking_too_much_juice_craving_sweet_things/", "created_utc": 1589566408.0, "score": 21, "author": "lactosefreemilkyway", "num_comments": 15, "permalink": "/r/healthyeating/comments/gkec0f/am_i_drinking_too_much_juice_craving_sweet_things/", "html_title": ""}
{"title": "This may be a weird question, but how much snacking is a healthy amount and are snacks ever really worth it?", "selftext": "Everytime a debate comes up about eating crisps or a piece of cake, the argument is made that \"one time won't hurt you\" and though I believe that that's a saying for people who do it more than once, I start to wonder, are snacks ever worth it? Should I decline everytime somebody hands me a cookie or something that has been fried? If so that would mean that every bite I take of unhealthy food would mean a, though very small, loss for my health and personal well-being.", "url": "https://www.reddit.com/r/healthyeating/comments/ek9w9z/this_may_be_a_weird_question_but_how_much/", "created_utc": 1578209577.0, "score": 22, "author": "None", "num_comments": 12, "permalink": "/r/healthyeating/comments/ek9w9z/this_may_be_a_weird_question_but_how_much/", "html_title": ""}
{"title": "Eating healthy seems overwhelming", "selftext": "Tw: weight, maybe disordered eating?  \n\nI have trouble with eating. I eat a five year old's dream diet basically - mostly involving buttered noodles, choccy milk, sweets, and toast. Sometimes I cook simple meals (spaghetti, quesadillas) or sometimes my partner cooks for us (I can't always eat their food due to sensory issues). \n\nBut mostly I live on 'white foods.' I especially struggle to get enough veggies and fruit, and to limit my intake of unhealthy food. I also am always dehydrated as I don't like plain water. \n\nI need to lose weight due to being at high risk of type 2 diabetes and having high cholesterol. However, I am limited in what I can eat as I have sensory issues (no complex or 'big' flavours, or spicy or mushy things) and I really struggle to cook anything complex or anything that takes a long time. Even just looking at those healthy food diagrams and pyramids feels overwhelming, let alone meal planning, grocery shopping, cooking, eating, cleaning up... \n\nDoes anyone have tips for a disabled (mental health stuff and probably autism) person to start eating healthier and maybe lose some weight?", "url": "https://www.reddit.com/r/healthyeating/comments/ybflh4/eating_healthy_seems_overwhelming/", "created_utc": 1666525473.0, "score": 21, "author": "None", "num_comments": 13, "permalink": "/r/healthyeating/comments/ybflh4/eating_healthy_seems_overwhelming/", "html_title": ""}
{"title": "advice on how to get all my nutrients while on a strict budget? it’s turning out to be much harder than it seems!!", "selftext": "title is pretty self explanatory. i live in a major city where the cost of living is way higher than where i grew up, and now that i’m an adult i’m needing to figure out my own way financially. I’ve always been relatively healthy and balanced eater but i’m finding that to be incredibly difficult while spending my own money on food (currently between jobs so that isn’t helping either!)… I feel like i’m becoming malnourished but I don’t know how to help myself. It seems like whenever i buy fruits and vegetables not only does the grocery bill add up, a lot of them tend to go bad before i can make my way to them! does anyone have any tips on getting my fruit/vegetable fill while not blowing my bank account?\n\nedit for typos", "url": "https://www.reddit.com/r/healthyeating/comments/p12p8r/advice_on_how_to_get_all_my_nutrients_while_on_a/", "created_utc": 1628519786.0, "score": 21, "author": "sunnybear18", "num_comments": 6, "permalink": "/r/healthyeating/comments/p12p8r/advice_on_how_to_get_all_my_nutrients_while_on_a/", "html_title": ""}
{"title": "Filling Healthy Foods?", "selftext": "Most of my childhood, i drank a lot of both Milk and Soda. Now that I'm an adult, who is trying is hardest to not eat to much unhealthy stuff, its easy to see in retrospect what was so appealing to these two drinks besides their tatste: they are two of the most filling things you can consume. I like the taste of salads, but anytime i try to order a salad from a place, as far as how my stomach feels, it feels like i literally ate nothing. and i am likely to try and eat a whole second meal or pair it with some kind of fattening drink in the name of getting rid of the feeling of being hungry. What actually healthy, or at least better for me foods are known to make you feel like you are full.", "url": "https://www.reddit.com/r/healthyeating/comments/oizo7e/filling_healthy_foods/", "created_utc": 1626121686.0, "score": 20, "author": "silversymbiote219", "num_comments": 6, "permalink": "/r/healthyeating/comments/oizo7e/filling_healthy_foods/", "html_title": ""}
{"title": "A couple questions, I'm 33 years old, 6\"1', 275lbs, and walk 3-5 miles/day. My brother owns a gym and has been my go to advice on losing weight. He says I should shoot for 1500 calories/day, but sometimes I feel that's too much. Any guidance?", "selftext": "I was losing quit a bit just cutting back and not calorie counting, but bc of his advice I am calorie counting now and aiming for 1500 cal/day, but it seems like the last few days I haven't lost any weight whereas I was losing .5 to .75 a day before. \n\nHe also believes I should try to proportion 40/30/30 carbs, proteins, fats, with 40g or less sugar. Thoughts?", "url": "https://www.reddit.com/r/healthyeating/comments/o5klow/a_couple_questions_im_33_years_old_61_275lbs_and/", "created_utc": 1624360412.0, "score": 21, "author": "None", "num_comments": 11, "permalink": "/r/healthyeating/comments/o5klow/a_couple_questions_im_33_years_old_61_275lbs_and/", "html_title": ""}
{"title": "Does coold water make you gain weight?", "selftext": "I e drank cold water all my life and recently my coworkers who immigrated from Africa get mad at me whenever I drink cold water or eat ice. They say it makes you gain weight but water is just water right, it ends up in the kidneys and passes as urine out the bladder. Is there  any scientific evidence to prove their right?", "url": "https://www.reddit.com/r/healthyeating/comments/nt12tz/does_coold_water_make_you_gain_weight/", "created_utc": 1622914896.0, "score": 21, "author": "vaultdweller501", "num_comments": 14, "permalink": "/r/healthyeating/comments/nt12tz/does_coold_water_make_you_gain_weight/", "html_title": ""}
{"title": "How much meat is enough?", "selftext": "We hear this fake news that the Biden administration wants to restrict meat consumption to one hamburger a month and 4 lbs a year. But that got me thinking, how much is enough beef? \n\nI probably eat that amount or less already but I’m still wondering what’s a reasonable amount.\n\nEdit from OP: I mean how much is considered fine before it becomes considered too much. I know that zero is always fine too.", "url": "https://www.reddit.com/r/healthyeating/comments/n38a83/how_much_meat_is_enough/", "created_utc": 1619968174.0, "score": 22, "author": "BTenders", "num_comments": 20, "permalink": "/r/healthyeating/comments/n38a83/how_much_meat_is_enough/", "html_title": ""}
{"title": "Teaching your children", "selftext": "Hey there,\n\nI (26M) want to have a discussion about passing down healthy habits to our next generation. \n\nMy childhood was an average Canadian middle class experience, but with added twists of peer abuse, trauma, and unhealthy eating patterns (it was a cycle). It wasn’t until the beginning of last year I really made a change in what I put into my body, and ever since then I feel way better. My girlfriend and I went plant based, cut down a lot of carbs and only hit a drive thru once every couple of weeks. I take on the grunt of the meal planning, prepping and cooking, and I love this new lifestyle. I actually love coming home from work everyday to properly nourish my body.\n\nWhat I have learned in the last year and a bit is that a lot of my old eating habits stem from childhood trauma, but most importantly, I ate what my parents bought and kept in the house. It wasn’t their fault totally, they were marketed these high sugar, high carbohydrate, death in a wrapper foods. I am happy that I broke that cycle, but my question is:\n\nHow do you as a parent pass these values on to your kids without any guilt trips? \n\nFor instance, if your kid is at school eating their ziploc bag full of dehydrated apricots, and their friend whips out a package of fruit gushers. When I was a kid, I’d be like “give me some of does damn gushers!”\n\n* I don’t have any kids yet, but my gf and I plan on it soon. Just curious about this topic.", "url": "https://www.reddit.com/r/healthyeating/comments/mbvmfv/teaching_your_children/", "created_utc": 1616553819.0, "score": 21, "author": "Hankbank94", "num_comments": 10, "permalink": "/r/healthyeating/comments/mbvmfv/teaching_your_children/", "html_title": ""}
{"title": "Mediterranean Thanksgiving Stuffing Idea", "selftext": "Speaking of healthy eating this November, I'm excited to share this Thanksgiving stuffing recipe with you all. Turned out bomb, so I hope you enjoy! Here are the steps:\n\nIngredients\n\n* 1 Loaf of Sourdough or French Bread Any crusty bread will do the trick\n* 3-4 Cloves of garlic\n* ½ Large onion finely diced\n* 8 oz Chopped mushrooms\n* 10 oz Chopped or baby spinach\n* 1 tbsp Salt\n* 3 tsp Pepper\n* 1 tbsp Dried oregano\n* 2 tsp Dried basil\n* 8 oz Sun-dried tomatoes packed in olive oil\n* 3 tbsp Capers\n* 6 oz Crumbled goat cheese\n* ¼ cup Pumpkin seeds\n* 4 tbsp Olive oil For greasing baking pan and for sautéing vegetables\n* 1 cup Vegetable Broth Can also use chicken broth/stock\n\nInstructions\n\n* Preheat your oven to 375° and oil a 11×13 baking dish\n* Slice bread into small cubes and place bread into baking dish.\n* Finely mince garlic and onion and sauté in large pan with olive oil until translucent. Add chopped mushrooms and sauté until slightly brown. Add spinach and cover for 3-4 minutes until cooked down. Uncover and stir until liquid has evaporated. Season with salt, pepper, oregano and basil.\n* Transfer to a large mixing bowl. Add sun-dried tomatoes (setting olive oil in jar aside), capers goat cheese, pumpkin seeds and mix.\n* Pour broth over bread ensuring each slice is covered. Add vegetable mixture over bread slices, making sure to evenly spread the mixture and place in between the bread slices.\n* Cover with foil or lid and bake for 40 minutes, removing the foil at 30 minutes. Drizzle with olive oil from sun-dried tomatoes and serve. Enjoy!\n\nIf you're a visual person, you can always see beautiful photos and other instructions on [www.nestandnature.com](http://www.nestandnature.com/)", "url": "https://www.reddit.com/r/healthyeating/comments/jq43km/mediterranean_thanksgiving_stuffing_idea/", "created_utc": 1604803923.0, "score": 23, "author": "kunav", "num_comments": 4, "permalink": "/r/healthyeating/comments/jq43km/mediterranean_thanksgiving_stuffing_idea/", "html_title": ""}
{"title": "Intro (need advice) (teen)", "selftext": "Hi. My name is Andrew.\nI am 14 years old at the time of writing this. (will be 15 in november)\nBefore you start judging or anything, dont look at this post, I am looking for advice.\nI know that I am still considered a kid, and I am, but yall need to give me advice on this :)\nSo I am 14 years old, 5'7 (174cm) and 169 pounds (77kg)\nRecently I had gained a lot of weight. In the span of 2 years I have gained 20 pounds ( a lot for me) so i was about 150lbs.\nI didnt notice this that much, because everyone says im tall and that they dont see that im fat or anything.\nBut I see my body and I see that I am overweight.\nI also calculated my bmi and it says that its 26.9 which is considered a little overweight.\nMy goal is to get to my original weight (150 pounds).\nI just need your guys' help and advice, possibly an eating and exercise plan, I already made one but I don't think it's really good.\nAnd I just want to know, in what timespan can I get to my goal. Can it possibly be 1 year? If not, how many?\nI do have motivation, I'm ashamed of my stomach and body, and I have seen a lot of bad things about diabetes etc..\n\nIf someone could help me it would be appreciated.\n\n\nThanks in advance, Andrew.", "url": "https://www.reddit.com/r/healthyeating/comments/ir02tk/intro_need_advice_teen/", "created_utc": 1599861001.0, "score": 21, "author": "EmrahGangster", "num_comments": 22, "permalink": "/r/healthyeating/comments/ir02tk/intro_need_advice_teen/", "html_title": ""}
{"title": "When you live in a small village, without big, popular supermarkets it harder to keep a good diet, right? Let me explain myself.", "selftext": "Disclaimer: I am not from US. \n\nWhenever i go to my local supermarket (pretty much the only one when i live) to buy something even remotely healthy but tasty, it's hard do pick anything. It's one of the most popular ones in my country, pretty big, yet sucks at the same time. Most of the stuff i've already ate like hundred times, or they're just not good enough to be satisfied with, so i'll usually go for some frozen junk food. I don't have a driver license, so i can't drive to the bigger town to buy some better groceries. I know i can always buy some chicken breasts and frozen (or fresh) vegies and make something healthy out of it, but the options are really limited (at least in my head, lol). I feel like they have everything and nothing at the same time. Cooking everyday something, only for myself seems exhausting (maybe i'm just lazy). Do you have any ideas what to do? Maybe some easy recipes?", "url": "https://www.reddit.com/r/healthyeating/comments/i70tv4/when_you_live_in_a_small_village_without_big/", "created_utc": 1597047002.0, "score": 20, "author": "None", "num_comments": 8, "permalink": "/r/healthyeating/comments/i70tv4/when_you_live_in_a_small_village_without_big/", "html_title": ""}
{"title": "Eating disorder + diet change + unhealthy digestion + possible hemorrhoids = Please Help!!!", "selftext": "Hi! 19 F here. \n\nQuick background, normally I had healthy eating habits despite my eating disorder (bulimia), but due to circumstances starting April I had to move in with another family for all of summer. I owe a great deal to them for taking me in at a tough time for little to no rent and with 10 kids of their own to feed. \n\nThe parents hardly have any time for cooking and most of my meals tend to be frozen meals. Things such as sausages, frozen pasta, lasagna, corn dogs, and just overall hardly anything homemade or any veggies. \n\nI'm also struggling with finding motivation to work out since being inside is probably not helping my body, but I have been trying to regulate my eating. \n\nMy healthy options right now are oats, popcorn, eggs, and occasionally just a lettuce salad. Usually I eat the above foods in healthy quantities, then due to bulimia I will binge eat the unhealthy lunch/dinner (out of both satisfaction and stress) then force myself to vomit it out. \n\nI used to be able to poop daily but the past two months I'm lucky if I get to poop once every three days. I have recently started to bleed when pooping and I assume its hemorrhoids. \n\nGiven I'm jobless because of corona, what are some quick, healthy and cheap meal options I can make for myself? I don't want to occupy the kitchen too much as it's a little awkward for me here, but I can place some orders at my local Walmart for some healthier options. \n\nAll and any help is appreciated. Thank you so much for taking the time to read this.", "url": "https://www.reddit.com/r/healthyeating/comments/gq8xd5/eating_disorder_diet_change_unhealthy_digestion/", "created_utc": 1590403753.0, "score": 21, "author": "RevengingSloth1", "num_comments": 13, "permalink": "/r/healthyeating/comments/gq8xd5/eating_disorder_diet_change_unhealthy_digestion/", "html_title": ""}
{"title": "Practicing Mindfulness While Eating", "selftext": "How do you practice mindfulness while eating?\n\nWhen do you tend to have your last meal of the day by?", "url": "https://www.reddit.com/r/healthyeating/comments/glq1b8/practicing_mindfulness_while_eating/", "created_utc": 1589758456.0, "score": 20, "author": "None", "num_comments": 8, "permalink": "/r/healthyeating/comments/glq1b8/practicing_mindfulness_while_eating/", "html_title": ""}
{"title": "Does MyPlate over-recommend dairy?", "selftext": "I recently checked with the USDA's nutrition application, MyPlate, to see what my recommended daily servings were of the various food groups. You can do the same on [this site.](https://www.choosemyplate.gov/resources/MyPlatePlan) After inputting my gender, age, current weight, and activity level, it suggested a 2600-calorie diet to slowly work toward a healthier weight---seems a little high, but I don't know.\n\n[These are MyPlate's recommendations for my daily portions.](https://www.choosemyplate.gov/resources/MyPlatePlan/MyPlatePlan_2600cals_Age14plus) One of the most surprising things I noticed was that they suggested 3 cups of dairy each day. That *seems* like a lot to me.\n\nI'd once heard a conspiracy theory that the USDA over-recommends dairy in order to prop up the US dairy industry. While I seriously doubt that's the case, is this meal plan poorly proportioned? If so, is there a different utility I could use to come up with daily portions?\n\nThanks in advance!", "url": "https://www.reddit.com/r/healthyeating/comments/g38hup/does_myplate_overrecommend_dairy/", "created_utc": 1587150964.0, "score": 19, "author": "Iestwyn", "num_comments": 6, "permalink": "/r/healthyeating/comments/g38hup/does_myplate_overrecommend_dairy/", "html_title": ""}
{"title": "I just want to eat healthy!", "selftext": "I have tried, and tried again. But I cannot get myself to go back on the keto diet. \n\nRight now, I am eating healthy. Cut the sugar, only eat carbs in the form of vegetables, healthy grains and fruit. But, I’m having stomach issues. Sometimes I get gassy, sometimes constipated, and sometimes, loose stools. It’s actually pretty consistent that my stomach is rumbling. \n\nAs much as I love my new healthy grains (oatmeal, whole grain bread) it may be the culprit. I don’t know if I should try gluten free to see if this is the cause or just completely get rid of grains. \n\nI’m not sure it’s gluten though. I can eat a croissant, piece of pizza, etc and be totally fine.", "url": "https://www.reddit.com/r/healthyeating/comments/fqvegf/i_just_want_to_eat_healthy/", "created_utc": 1585438904.0, "score": 21, "author": "None", "num_comments": 10, "permalink": "/r/healthyeating/comments/fqvegf/i_just_want_to_eat_healthy/", "html_title": ""}
{"title": "Questions for a newbie with healthy eating, and fat burning.", "selftext": "Hi everyone, thanks for taking the time to read this and respond to me I really appreciate it. I just started a lot of lifestyle changes this past month and was looking for advice , a lot of articles are read are overwhelming confusing. So I was hoping to get some help here.\n\nA little about me first : I'm 29, Ive had a crazy metabolism my entire life, which allowed me to eat whatever I Wanted and seriously not gain any weight. (That has changed now.) I smoked for 12 years (Today is 2 months nicotine free.) I exercised a lot as a kid, and then for about 6 years, I dont think I exercised at all. ( I now run 2 or 3 days a week, do at home small workouts and play basketball at least once a week.)  over the past year, I developed a \"Pouch\" on my waist, and I absolutely hate it. So now that I've quit smoking, I've decided the next step is to eat healthy.  \n\nWhat I've Done  : I'm soda free and Junk food free as of 2 weeks ago. I've been eating a lot of protein. (Chicken, Peanut butter, etc.) I've replaced the junk food snacking with either kiwi, apples, bananas, carrots, etc. I've changed my every day work lunch from taco bell to either a salad with chicken, bacon and cheese(Thousand island dressing.) Or chicken and brown rice. For dinner sometimes its eggs, wheat toast and a protein shake, sometimes its the healthy choice meals i can get from the grocery store with a banana and a protein shake. \n\nMy question: I'm wondering what other advice people would give someone who has no idea how to eat healthy and burn stomach fat. I feel as though I'm taking the correct steps but at the same time I dont want to be doing something wrong and actually gain more weight. Any advice will be really helpful. Thank you so much.", "url": "https://www.reddit.com/r/healthyeating/comments/f5i2ly/questions_for_a_newbie_with_healthy_eating_and/", "created_utc": 1581982855.0, "score": 21, "author": "swiftil", "num_comments": 18, "permalink": "/r/healthyeating/comments/f5i2ly/questions_for_a_newbie_with_healthy_eating_and/", "html_title": ""}
{"title": "Having Anxiety Buying Groceries", "selftext": "Hello, lately I have been struggling to buy groceries. It's not financial, I can afford to get them but it stresses me out. I'm a really picky eater and a lazy cook so every time I buy perishables they end up rotting in my fridge. As a result I end up eating mainly bread, olive oil and pasta. It's starting to lead to a complete crash in my energy levels. How do I get past this?", "url": "https://www.reddit.com/r/healthyeating/comments/uwz8mb/having_anxiety_buying_groceries/", "created_utc": 1653421497.0, "score": 20, "author": "ihavehangnails", "num_comments": 24, "permalink": "/r/healthyeating/comments/uwz8mb/having_anxiety_buying_groceries/", "html_title": ""}
{"title": "Maltodextrin", "selftext": "It took me 2 years of trying to figure out why I was bloating, gassy, had anal bleeding, anal leakage, stomach pain and inflammation of the body.  Went to doctors, they seemed to be stumped. After my colonoscopy I was sure I had colon cancer.  But nope! I was all clear, not even a hemorrhoid!  I kept track of my foods I was eating and finally last night I figured out its Maltodextrin thats the issue!  \n\nHere is a short list of foods that contain this substance that affect me the very next day if not sooner. \n\n* Most chips especially Doritos\n\n*Wheat pasta unless its from Italy ( as far as I know)\n\n*Packaged taco seasoning\n\n*Beer\n\n*Candy\n\n*Bread\n\n*some soft drinks\n\n*everything I love thats delicious. \n\nThese are the main ones, but I’m sure they put that stuff in a lot of things. I’m going to send a bunch of emails to corporations regarding maltodextrin and see if I can get some traction with it. \n\nHope this helps someone realize their health issues.", "url": "https://www.reddit.com/r/healthyeating/comments/p0jdmy/maltodextrin/", "created_utc": 1628445250.0, "score": 21, "author": "Cgtree9000", "num_comments": 4, "permalink": "/r/healthyeating/comments/p0jdmy/maltodextrin/", "html_title": ""}
{"title": "True that too many vitamins in a day is unhealthy?", "selftext": "I switched to gummy adult multi vitamins to curb my junk food cravings. There is a hint of sweetness that keeps me from cookies. But I just noticed that there is a label \"warning: do not exceed recommended dosage.\" \n\nIs there really too much of a good thing w vitamins? Thank you!", "url": "https://www.reddit.com/r/healthyeating/comments/mz1xhp/true_that_too_many_vitamins_in_a_day_is_unhealthy/", "created_utc": 1619455280.0, "score": 19, "author": "discojagrawr", "num_comments": 15, "permalink": "/r/healthyeating/comments/mz1xhp/true_that_too_many_vitamins_in_a_day_is_unhealthy/", "html_title": ""}
{"title": "Solutions to drinking your calories?", "selftext": "I’ve started to break my sugar habit by way of desserts and those carbs, but any sweet drink outside of alcohol is *very difficult to give up*. Any ideas?\n\n[edit: for me it’s mainly sugary coffee and fruit juices. It’s never been into soft drinks or alcohol (since I’m underage), but thank you guys so much!]", "url": "https://www.reddit.com/r/healthyeating/comments/mq3myt/solutions_to_drinking_your_calories/", "created_utc": 1618324899.0, "score": 21, "author": "None", "num_comments": 26, "permalink": "/r/healthyeating/comments/mq3myt/solutions_to_drinking_your_calories/", "html_title": ""}
{"title": "replacement snack for chocolate?", "selftext": "So i’m really trying to cut down on sugar, I already stopped drinking pop but I can’t let go of my chocolate snacks!! What else could I eat? I got fruit and trail mix and that’s been helping but I’m dyingggg for sweets. Suggestions?", "url": "https://www.reddit.com/r/healthyeating/comments/ksl1d9/replacement_snack_for_chocolate/", "created_utc": 1610048839.0, "score": 21, "author": "Meggiemuu85", "num_comments": 19, "permalink": "/r/healthyeating/comments/ksl1d9/replacement_snack_for_chocolate/", "html_title": ""}
{"title": "Changing Eating Habits", "selftext": "Looking to change my years of poor eating habits. (fast food, salts, fats, dairy, etc) Problem is, I feel completely lost when it comes to choosing healthy meals. I'm looking to fill my life with easily accessible, easily prepared and delicious foods that are healthy and satisfying.\n\nAny recommendations for meals that changed your life in that regard?", "url": "https://www.reddit.com/r/healthyeating/comments/klyx76/changing_eating_habits/", "created_utc": 1609189286.0, "score": 20, "author": "None", "num_comments": 13, "permalink": "/r/healthyeating/comments/klyx76/changing_eating_habits/", "html_title": ""}
{"title": "Tips for transitioning to a meatless diet?", "selftext": "Planning to cut out meat! Any tips?\n\nHi everyone! I started my health journey in January of this year by counting macros. I lost 16 lbs by April and I’ve been maintaining by just being aware of what my body needs and making overall healthier choices. Though I’ve been feeling healthier than ever, the carbon footprint of the meat industry has been weighing heavily on me and I like the long-term health benefits of a vegetarian diet. I am hoping to cut out dairy and meat altogether eventually, but I’m planning to just start with meat right now. \n\nI figured doing one step at a time will be more feasible, especially since I’m currently drowning while I finish my master’s during my first year of teaching (which is 10x more work online because of the pandemic, yay me!!), but I still need to get my protein in without too much thought. Do any of you have any advice for switching to a meatless diet? I’d be happy to check out some book recommendations as well :)", "url": "https://www.reddit.com/r/healthyeating/comments/iswgy4/tips_for_transitioning_to_a_meatless_diet/", "created_utc": 1600124946.0, "score": 21, "author": "trivialblues", "num_comments": 33, "permalink": "/r/healthyeating/comments/iswgy4/tips_for_transitioning_to_a_meatless_diet/", "html_title": ""}
{"title": "Are there other side effects of too much fiber consumption?", "selftext": "I've always had an issue with constipation ever since I was a kid. And as I have gotten older I've taken to a giver therapy supplement as well as consuming fiber thin crackers. Lately I've been having issues with my stomach, gas, loss of appetite, back pain (not sure if related) but I was wondering if the loss of appetite and gas could be a result of too much fiber. I haven't had the other issue you would think can come from too much fiber but that's why I'm asking.", "url": "https://www.reddit.com/r/healthyeating/comments/hdxg8m/are_there_other_side_effects_of_too_much_fiber/", "created_utc": 1592849393.0, "score": 21, "author": "None", "num_comments": 6, "permalink": "/r/healthyeating/comments/hdxg8m/are_there_other_side_effects_of_too_much_fiber/", "html_title": ""}
{"title": "Scared to eat meat", "selftext": "Hello I have been a vegetarian for I think 7 years and i decided to become a vegetarian because I was trying to force myself to eat healthier and I’ve been interested in eating meat again but whenever I am standing in the grocery store I get scared to the point it triggers my fight or flight so I was just wondering how I would be able to get over that and how I can start healthily incorporate meat into my diet again because I’ve heard of people going to hard and then getting sick because their body can’t handle it anymore", "url": "https://www.reddit.com/r/healthyeating/comments/hd2du5/scared_to_eat_meat/", "created_utc": 1592722476.0, "score": 20, "author": "LittleRedHood__", "num_comments": 13, "permalink": "/r/healthyeating/comments/hd2du5/scared_to_eat_meat/", "html_title": ""}
{"title": "The issue of olive oil.", "selftext": "So I am aware that some vegans do not eat olive oil because they believe that it is bad for you, and they come with studies to prove it.\n\nBut at the same time other people say that it is good for you and they come with their studies.\n\nHealth can be very confusing sometimes and that is a scary thing because health is very important to the human body.\n\nSo why do you think it is different on the issue of olive oil?", "url": "https://www.reddit.com/r/healthyeating/comments/gpizsq/the_issue_of_olive_oil/", "created_utc": 1590292743.0, "score": 20, "author": "od19g6", "num_comments": 37, "permalink": "/r/healthyeating/comments/gpizsq/the_issue_of_olive_oil/", "html_title": ""}
{"title": "Are there any complex carbs beside oats that you can soak overnight and eat it raw effectively?", "selftext": "", "url": "https://www.reddit.com/r/healthyeating/comments/fzj7gj/are_there_any_complex_carbs_beside_oats_that_you/", "created_utc": 1586639345.0, "score": 18, "author": "Gandalf-te-nej", "num_comments": 3, "permalink": "/r/healthyeating/comments/fzj7gj/are_there_any_complex_carbs_beside_oats_that_you/", "html_title": ""}
{"title": "Should I give up alcohol or sugar?", "selftext": "I'd like to give up these vices. I don't think can do both at the same time, so I'm starting with just one. Looking for input- Would it benefit my mental and physical health more to give up sugar or alcohol? \n\nIn terms of quantity I eat sugar most days (desserts, candy, etc.) and I drink casually 2-3 nights a week.\n\nAlso, I know alcohol is sugar, I'm talking about the habit of eating sugary treats. Thanks everyone!", "url": "https://www.reddit.com/r/healthyeating/comments/fsrufq/should_i_give_up_alcohol_or_sugar/", "created_utc": 1585712112.0, "score": 20, "author": "earthy_tones", "num_comments": 26, "permalink": "/r/healthyeating/comments/fsrufq/should_i_give_up_alcohol_or_sugar/", "html_title": ""}
{"title": "Struggling to plan meals", "selftext": "Hello! I’m a 21 year old female who is really trying to eat healthy. I notice I relapse into eating out if I run out of my one prepped meal or if I don’t want to eat salmon and broccoli /again/. I have a hypothyroid so I struggle to lose weight, but recently I’ve ballooned, and I need to get it under control. \n\nCould y’all drop your /easy/ meals that are healthy and will keep me on track?", "url": "https://www.reddit.com/r/healthyeating/comments/exjp1b/struggling_to_plan_meals/", "created_utc": 1580621522.0, "score": 21, "author": "Simply-Agreeable", "num_comments": 9, "permalink": "/r/healthyeating/comments/exjp1b/struggling_to_plan_meals/", "html_title": ""}
{"title": "Tips on eating healthy while traveling", "selftext": "I'm not the healthiest person but I Atleast try to eat home cooked meals whenever I'm home. But the majority of the time I'm traveling for work with a really chaotic schedule bouncing around city to city state to state alot of times with zero notice. Sometimes I'm somewhere that could be considered civilization but most times I'm far from it for example last week I was 2 hours away from anything and where I was staying had a dollar general a McDonald's and truck stops. Lately I've just gotten sick of basically having to eat fast food and truck stop food while I travel for work. Does anyone have any tips or tricks on what I can do. Keep in mind I never have a kitchen in the hotel and sometimes don't even have a fridge plus schedule constantly changes so if I were to buy a week's worth of food I could end up getting a call while leaving the store and have to immediately leave and get on a plane", "url": "https://www.reddit.com/r/healthyeating/comments/dtxyc7/tips_on_eating_healthy_while_traveling/", "created_utc": 1573316143.0, "score": 21, "author": "iwannastartacountry", "num_comments": 11, "permalink": "/r/healthyeating/comments/dtxyc7/tips_on_eating_healthy_while_traveling/", "html_title": ""}
{"title": "health tips", "selftext": "", "url": "https://i.redd.it/lehux316qb9z.jpg", "created_utc": 1499935954.0, "score": 19, "author": "chalupadraws", "num_comments": 0, "permalink": "/r/healthyeating/comments/6n0evv/health_tips/", "html_title": ""}
{"title": "How to quickly reset stomach after a stressful period of little sleep, eating processed/junk food and not much hydration?", "selftext": "I went through a really stressful period this last week. I barely slept, I was doing lots of work until the early hours of the morning, caffeine, ate very little and only ate quick junk food. Hardly drank any water too, just tea and caffeine.\n\nAs a result, I have a random stomach ache that comes and goes, and I'm also constipated and haven't had a good, substantial \"normal\" bowel movement in days.\n\nIs there anything I can eat to help my gut reset and feel more at ease? I'm thinking of steaming broccoli and eating plain potatoes, maybe with some lemon water to hydrate myself.\n\nAnything else I can do to help my body reset?", "url": "https://www.reddit.com/r/healthyeating/comments/tb11sb/how_to_quickly_reset_stomach_after_a_stressful/", "created_utc": 1646925794.0, "score": 19, "author": "yahaha__", "num_comments": 22, "permalink": "/r/healthyeating/comments/tb11sb/how_to_quickly_reset_stomach_after_a_stressful/", "html_title": ""}
{"title": "how do i tell my parents i need to eat healthier?", "selftext": "hi everyone! i currently live with my parents and with a younger brother and sister. we're a pretty busy family considering that both my sister and i are in soccer and girl scouts. my brother is special needs and goes to therapy twice a week and we're all pretty involved at school. im 15, a tri-sport athlete at my school and i want to know how to ask my parents about eating healthier.\n\nim around 5'7 and i weight 125 pounds, which isn't unhealthy, it's about a 20 bmi however. which is leaning towards the more overweight end of the scale. and i know that weight isn't the only defining factor in health but im not exactly super muscular.\n\nconsidering that we're busy almost every day of the week my family eats a lot of fast food. only on days when we don't have practice or meetings to attend my parents will cook. and still the meals aren't exactly healthy, they're usually packaged and full of saturated fats and unnecessary calories.\n\ni don't really know how to cook for myself and i don't have money to spend on my own food. so id have to ask my parents for money if i was going to buy my own food. however i can't even drive so i would have ask them to buy me food or go shopping by myself.\n\nmy siblings are healthy and fit, however my parents arent. im just wondering if you guys have any tips on how to talk to my parents about health and diet?\n\nthank you so much r/healthyeating <33", "url": "https://www.reddit.com/r/healthyeating/comments/stzo4x/how_do_i_tell_my_parents_i_need_to_eat_healthier/", "created_utc": 1645028018.0, "score": 20, "author": "bubblp0p", "num_comments": 12, "permalink": "/r/healthyeating/comments/stzo4x/how_do_i_tell_my_parents_i_need_to_eat_healthier/", "html_title": ""}
{"title": "Can’t maintain diet and it sucks. Is it worth it eating healthy??only live once", "selftext": "So for about a year or so now I’ve had somewhat of an unhealthy relationship with food. 20 yrs old college student and Let me start by saying growing up , I ate tons and tons of fast food, McDonald’s about a few times a week at least along with sweets.  This still weighs on my brain today and is  one of my theories as to why I’m an overall anxious person and have been- I sometimes feel I have OCD and can’t fathom the damage I just have done to my body for all this years. \nThis continued until I was about 16 and I started working out and eating healthy(healthier). I never overanalyzed during these few years but I did make it a point to avoid eating any sweet but I still usually ate 1 meal a day outside(healthy-ish fast food) the house while eliminating certain fast food while incorporating more homemade meats, fruits and lots of veggies. I also ate till I was 100 percent full- not like those fist sized portion size. \n      This worked out  fine for  a while until COVID hit and it was during the beginning of this that I really started to become paranoid about my health and in general. I began to feel sluggish, probably as a result of my overeating- I admit I’m an emotional eater- and unintentional restriction of healthy carbs and excess protein. Among  other things I became paranoid about my  elevated heart rate and became depressed, a ton of bad stuff. \n    I then became inspired after watching that vegan documentary and became vegan for about a year- later I realized there’s no evidence a vegan diet is any better- and it was at this point that I instantly began having insomnia and it’s never resolved. I eventually switched back to a healthy Whole Foods diet and while I physically felt at my best, the constant feelings of deprivation really began to weigh on me.   Tried cooking for myself in my apartment but food never came out tasty or satisfying. It came to a point where eating 100 percent  healthy came at the expense of truly enjoying life  and a way to boost my self esteem- as a way to feel superior, in a way similar to how I started taking up basketball and working out from what I saw in high school with those really popular athletic kids.  You can quickly begin to see how my entire character is defined by this. \n         At what point is eating completely healthy not worth it. I feel so guilty at time seeing  how ignorant my family and friends are to this while my bum Ass sits  at home eating healthy , thinking all day about it, unable to sleeep. I know for a fact I won’t feel as good if I go back to my old healthy-ish diet , knowing what I know now. But if it comes with  the improved mental health aspect, how worthwhile is it really to adopt a healthy diet?? You only live once and would you really wanna spend all that time being neurotic about how you eat?", "url": "https://www.reddit.com/r/healthyeating/comments/rfp8fx/cant_maintain_diet_and_it_sucks_is_it_worth_it/", "created_utc": 1639427298.0, "score": 19, "author": "Comprehensive-Cod160", "num_comments": 9, "permalink": "/r/healthyeating/comments/rfp8fx/cant_maintain_diet_and_it_sucks_is_it_worth_it/", "html_title": ""}
{"title": "Does drinking 2-3 cans of diet sodas per week increase your risk of developing cancer?", "selftext": "I eat very clean, low carbs, low sugar, and I exercise everyday. I wanted to check if drinking a can of diet pop 2-3 times a week would increase my risk of developing a cancer or a disease. Thanks y'all", "url": "https://www.reddit.com/r/healthyeating/comments/l4e3ds/does_drinking_23_cans_of_diet_sodas_per_week/", "created_utc": 1611542570.0, "score": 19, "author": "bigjake17", "num_comments": 10, "permalink": "/r/healthyeating/comments/l4e3ds/does_drinking_23_cans_of_diet_sodas_per_week/", "html_title": ""}
{"title": "snacking", "selftext": "wtf do you snack on when you get hungry when your trying to be healthy i always seem ti revert to my old ways", "url": "https://www.reddit.com/r/healthyeating/comments/kqjfui/snacking/", "created_utc": 1609798537.0, "score": 19, "author": "willzinoo", "num_comments": 37, "permalink": "/r/healthyeating/comments/kqjfui/snacking/", "html_title": ""}
{"title": "Ways to go meatless", "selftext": "I'm trying to think of a way to make this sound like an easier way to eat less meat and more vegetables. A lot of times, I think of soups. But my favorite soup, French Onion soup, is made with beef broth. I figured if I do a vegetarian version of this, it would encourage me to consume less meat / meat products while also being delicious. Hope it's a decent idea for you guys too, and I'll post a recipe because I believe it can be a good first step, and an encouraging one at that, for someone to make their own vegetarian recipe that tastes incredible:\n\n**Ingredients**\n\n* 5 Large Yellow or Sweet Onions Thinly chopped      into half moons\n* 3 Tbsp Butter\n* 1 Tbsp Olive Oil\n* 5 Cloves of Garlic Minced\n* 3 Tbsp Flour Optional\n* ½ Cup Balsamic Vinegar or Dry Red or White      Wine Can also use Apple Cider Vinegar\n* 2 Tsp Worcestershire\n* 6 Cups Beef or Vegetable Broth/Stock\n* 1½ Cup Lentils Green or Brown\n* 1 Bay Leaf\n* 2 tsp Dried Thyme Can also use Fresh\n* Salt & Pepper to Taste\n* Gruyere Cheese Or Swiss, Gouda, Fontina\n* French Bread Or any crusty Bread\n* 1-3 tbsp of Butter and 1 tsp of fresh minced garlic for      garlic butter ( for bread)\n\n**Instructions**\n\n1. Slice your onions in half. Next cut into thin \"half moon\" slices.\n\n2. Add butter to pan and melt. Now add olive oil and onions and stir. Cook down/caramelize onions for about 30-40 minutes over medium/medium low heat until golden brown. Monitor the onions and be sure to slightly stir for the last 5 minutes to prevent burning.\n\n3. When your onions are about 5 minutes away from being caramelized, add your minced garlic and stir. If you would like to thicken your soup at this point (optional) add 3 tbsp of flour and stir.\n\n4. If you also would like to deglaze pan, add your vinegar or wine to the pan and stir ( making sure to scrape up all the goodies on the bottom of the pan). I highly recommend this step as it helps develop extra flavor for the soup.\n\n5. Now add your stock of choice, Worcestershire, dried thyme, bay leaf and salt and pepper to taste. Be sure to look at how much sodium your stock has before adding extra salt to your soup. Add lentils and bring to a boil.\n\n6. Turn heat down to medium low and cover pot. Cook for 20-30 minutes until lentils have softened.\n\n7. Mix minced garlic and slightly softened butter together in a small bowl. Add to your bread slices. If you do not have oven safe bowls, add bread with garlic butter and sliced cheese onto a baking dish and broil until cheese has melted. Place sliced bread on top of soup in your bowl. If you have oven safe bowls, add bread directly to top of soup in bowl with cheese and add bowl to broiler. Broil until slightly golden and melted. Top with fresh or dried thyme and enjoy! If you're a visual person and prefer a video, it's on NestAndNature. Please enjoy!", "url": "https://www.reddit.com/r/healthyeating/comments/k3l0sv/ways_to_go_meatless/", "created_utc": 1606696411.0, "score": 19, "author": "kunav", "num_comments": 7, "permalink": "/r/healthyeating/comments/k3l0sv/ways_to_go_meatless/", "html_title": ""}
{"title": "Not Eating Out Much", "selftext": "Might be unpopular opinion. I have work to do on my eating but I rarely eat out. I find when I eat out I feel like crap. I work in food service too it is horrible in the kitchens", "url": "https://www.reddit.com/r/healthyeating/comments/jgld8x/not_eating_out_much/", "created_utc": 1603452763.0, "score": 19, "author": "None", "num_comments": 9, "permalink": "/r/healthyeating/comments/jgld8x/not_eating_out_much/", "html_title": ""}
