{"title": "Will you please stay the hell home....?", "selftext": "The home improvement store I manage has reduced its hours due to many of the staff getting sick. We only have one can of Lysol for the entire store to use, and the hand sanitizing station at the front of the store is empty. \n\nOur state in on \"stay-at-home\" orders, but that hasn't stopped people from bringing all six of their kids and their grandparents to our store to get the ever-essential mulch, paint, or whatever the fuck they need to do projects while they are home from work for a week. We are busier than we have ever been at this time of year.\n\nSeriously, people. Just stay the fuck home. Your projects can wait. Unless your water heater has bit the dust, or your bathroom is flooded, you do not need to go to the goddam hardware store.\n\nI can't even disinfect the fucking counters for christsakes. Stop coughing on me and go to fucking bed.\n\nRant over. Sorry.", "url": "https://www.reddit.com/r/HomeImprovement/comments/fpb3r8/will_you_please_stay_the_hell_home/", "created_utc": 1585227697.0, "score": 8758, "author": "Smitetheworldawake", "num_comments": 918, "permalink": "/r/HomeImprovement/comments/fpb3r8/will_you_please_stay_the_hell_home/", "html_title": ""}
{"title": "/r/homeimprovement will be going dark beginning June 12 in protest against Reddit's API changes which will kill 3rd party apps.", "selftext": "", "url": "/r/Save3rdPartyApps/comments/13yh0jf/dont_let_reddit_kill_3rd_party_apps/", "created_utc": 1686018699.0, "score": 3206, "author": "dapeche", "num_comments": 4, "permalink": "/r/HomeImprovement/comments/1420qho/rhomeimprovement_will_be_going_dark_beginning/", "html_title": ""}
{"title": "Flushing the hot water heater", "selftext": "After playing my golf this morning, I decided to do something useful. I have not flushed the sediment from my hot water heater since I bought the house in 2022, so today’s the day. \nI turned off the power (it’s electric - boogie-woogie-woogie), hooked up the hose, put the other end of the hose in the floor drain, turned off the cold water feed, opened the hot water faucet in the nearby utility sink. Once the sink ran cold, I opened the drain valve. It drained nicely. I saw a little discoloration, but nothing major Major. Once it was done draining, I got adventurous and decided to check the anode rod.\nI pried open the plastic cap and dug out the foam insulation with a screwdriver. Once I got down to the rod, I checked the fit of the 11/16” socket it said to use in the manual. It wouldn’t fit. I looked down in the hole, and saw it was definitely bigger than 11/16”. I Googled, and it said many anodes are 1-1/16”. So I went to Home Depot and bought a 1-1/16” socket. It wasn’t until I got home that I realized it wouldn’t fit on my 3/8” socket wrench. Back to Home Depot and bought a $30 1/2” socket wrench. Got home and tried to turn the rod, but the socket wasn’t quite long enough to get enough leverage to turn it. Decided the rod was probably fine. Put the cover back on and cracked a beer.  Now playing some RDR2. \nHope everyone’s having a good weekend. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke22lw/flushing_the_hot_water_heater/", "created_utc": 1746303322.0, "score": 591, "author": "Wm_of_Orange", "num_comments": 101, "permalink": "/r/HomeImprovement/comments/1ke22lw/flushing_the_hot_water_heater/", "html_title": ""}
{"title": "Is $12,000 the 'thanks but no thanks' quote for adding a linen closet? (see pics)", "selftext": "Hi /r/HomeImprovement; I'm hoping to get a rough idea of cost.  The wife and I are looking to add a linen closet into an existing closet ([see pic here for layout, changes in red](https://imgur.com/a/nFcoumQ)).  Here is what needs to be done...\n\nInstall and frame door into wall, build one new wall, add 1 or two outlets to new linen closet, add ceiling light to linen closet, drywall, add some type of flooring (wife and I will be doing the painting).\n\nWe got a quote from the contractor that redid our kitchen but they quoted us $12k for the job... is this a 'no thanks' quote and if so does anyone have ideas of what this job would run?  For reference, we aren't incredibly crunched for time (looking to have it done before the end of the year) and we're located in a fairly large Upper Midwest city.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1keqrkq/is_12000_the_thanks_but_no_thanks_quote_for/", "created_utc": 1746383356.0, "score": 136, "author": "Tacticool_Turtle", "num_comments": 98, "permalink": "/r/HomeImprovement/comments/1keqrkq/is_12000_the_thanks_but_no_thanks_quote_for/", "html_title": ""}
{"title": "Complete house renovation in San Diego", "selftext": "Hi everyone! After years of saving, I've finally decided to move on with a complete house renovation for my old (1970) house in San Diego. And when I say total, I mean from A to Z\n\nI've got a decent budget set aside (turns out those boring index funds my dad wouldn't shut up about actually did something useful over the last decade - who knew :)). But San Diego prices are well, San Diego prices. Everything is so insanely expensive here it's unbelievable. I don't wanna fuck it up cuz it's a very heavy investment. My main goal is to make a complete renovation with modern stuff, but don't lose the vibe of a proper SD house.\n\nAnyone here done major renovations in San Diego specifically by any chance? Looking for contractor recommendations, permit nightmares to avoid, and realistic timelines. Also any general tips are highly welcomed. \n\n\n\nAppreciate it and have a nice week!", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfd4qz/complete_house_renovation_in_san_diego/", "created_utc": 1746455669.0, "score": 122, "author": "Sea_Leopard3953", "num_comments": 11, "permalink": "/r/HomeImprovement/comments/1kfd4qz/complete_house_renovation_in_san_diego/", "html_title": ""}
{"title": "Septic is failing within city limits. Quoted $30k to hook up to city ? Waiting on 3 more quotes.", "selftext": "Could this even be real? I am blown away. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kf04eu/septic_is_failing_within_city_limits_quoted_30k/", "created_utc": 1746409262.0, "score": 86, "author": "Munchr272", "num_comments": 109, "permalink": "/r/HomeImprovement/comments/1kf04eu/septic_is_failing_within_city_limits_quoted_30k/", "html_title": ""}
{"title": "Has anyone installed a Schluter System and have been happy with the results and was it worth the extra expense.", "selftext": "List Pros and Cons please:", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke8j2w/has_anyone_installed_a_schluter_system_and_have/", "created_utc": 1746322584.0, "score": 69, "author": "Ok-Ocelot-7262", "num_comments": 69, "permalink": "/r/HomeImprovement/comments/1ke8j2w/has_anyone_installed_a_schluter_system_and_have/", "html_title": ""}
{"title": "Contractor installed windows upside down. Only noticed months later. What should I do?", "selftext": "We had a contractor install five basement windows a few months ago. Because it was winter, we never opened them until today. When I did, they did not stay in place (the top part drops down because it is supposed to be the bottom). I looked online, and the handles were supposed to be on top, but he installed them on the bottom. He had the instructions in the boxes when he installed them.\n\nI texted him about it but haven’t heard back. Is there anything I can do now? Could I win in small claims court for something like this (Massachusetts)? Thanks in advance for any help.\n\n", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke794y/contractor_installed_windows_upside_down_only/", "created_utc": 1746318318.0, "score": 69, "author": "GasGoesBadTandy", "num_comments": 52, "permalink": "/r/HomeImprovement/comments/1ke794y/contractor_installed_windows_upside_down_only/", "html_title": ""}
{"title": "Finally becoming a homeowner—looking for tool advice!", "selftext": "Hey folks! After 20 years of apartment living, my wife and I are finally on our way to becoming homeowners. I'm pumped to start building out my own collection of tools for all the projects I’ve been dreaming about tackling on our property.\n\nLooking for input from the community on **brands/models you trust** for the following tools. Bonus points for any multi-use or all-in-one recommendations. Also open to any suggestions for **must-have tools** I might be missing.\n\nWould also love your thoughts on **buying new vs. Facebook Marketplace / used**—worth the savings or more hassle than it’s worth?\n\n**Here’s my current list:**\n\n* Air Compressor\n* Nail Gun\n* Drill\n* Pressure Washer\n* Table Saw\n* Circular Saw\n* Paint/Stain Sprayer\n* Miter Saw\n* Clamps\n* Router\n* Tool Cabinets\n* Ladder\n\nAppreciate any help—thanks in advance!", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kej253/finally_becoming_a_homeownerlooking_for_tool/", "created_utc": 1746363026.0, "score": 43, "author": "jacuzzi_jake", "num_comments": 183, "permalink": "/r/HomeImprovement/comments/1kej253/finally_becoming_a_homeownerlooking_for_tool/", "html_title": ""}
{"title": "Did I just become a statistic?", "selftext": "I've read plenty of horror posts about projects quickly escalating into full on demoing renovations just from wanting to install a new electrical outlet. Did I just become one of those people from a simple \"let's recaulk the shower\" idea?\n\nhttps://imgur.com/a/pTzgwZf\n\nhttps://imgur.com/a/wTSAdRt\n\nLots of hidden mold and moisture.\n\nEdit: Whew. I purchased some Mold Armor as suggested and letting that dry overnight. Will be putting down some new GE supreme silicone caulk, also as suggested, tomorrow afternoon. Video was very helpful, thank you! \n\nLet the new homeowner adventures continue!", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke3omn/did_i_just_become_a_statistic/", "created_utc": 1746307777.0, "score": 41, "author": "HolyHellWat", "num_comments": 10, "permalink": "/r/HomeImprovement/comments/1ke3omn/did_i_just_become_a_statistic/", "html_title": ""}
{"title": "I need honest feedback about finishing my basement from people who have been there before.", "selftext": "Ive owned my home for 4 years now. I'm 31, I have 20k in rainy day fund, 120k 401k. \n\nMy house is 1650 square ft. Not bad, it's just that a lot of that sq footage is upstairs where there are 4 bedrooms. The living area is a little cramped downstairs. Most times, I dont notice. Because while i love to entertain, I mainly only entertain large groups in the summer where we make use of the deck/backyard. \n\nHowever, I have my family over for Christmas Eve every year and I host a Friendsgiving every year, with around 15 people. And it is CRAMPED. Like, walking on top of eachother between kitchen and livingroom. And it makes me feel like i want more space so bad. \n\nShort of selling and buying a larger house, I think the easiest way to get more space is beneath my feet. \n\nI have a 500 sq ft unfinished basement. In the basement are the guts of the house (water heater etc) washer and dryer. I wouldn't do anything fancy. Put maybe one to two walls up to keep an unfinished storage section, and then \"finish\" everything else.  My vision is a bit of a man cave. Small bar, cople couches and TV. Maybe a pool table if I can fit it. Just a place to hang out. I wouldn't add a bathroom, no plumbing, I'd just need hvac and electrical to the walls.\n\nMy big bad problem with this is, I want to leave my rainy day fund as is. Is it dumb to take out a loan for this? My thought is, purely financially speaking, at least this would add some value to the house so it's not a completely wasted investment. I do however, really enjoy not having any debt except student loans and my mortgage at the moment. \n\nHas anyone does this, any regrets?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kdtanz/i_need_honest_feedback_about_finishing_my/", "created_utc": 1746279824.0, "score": 35, "author": "Life123456", "num_comments": 102, "permalink": "/r/HomeImprovement/comments/1kdtanz/i_need_honest_feedback_about_finishing_my/", "html_title": ""}
{"title": "My garden spigot doesn’t shut off even when I turn it closed. I have  to shut it in the house Is this something I can diy ?", "selftext": "I just leaks water. There wasn’t a problem last year.  Or is this a plumbing issues in the wall or house ?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kep55r/my_garden_spigot_doesnt_shut_off_even_when_i_turn/", "created_utc": 1746379293.0, "score": 24, "author": "Enough_Possibility38", "num_comments": 18, "permalink": "/r/HomeImprovement/comments/1kep55r/my_garden_spigot_doesnt_shut_off_even_when_i_turn/", "html_title": ""}
{"title": "Should I install Rockwool Safe n' Sound throughout the entire interior of my new build?", "selftext": "So I've heard a lot of great things about Rockwool, but I'm unsure if it would be practical to install between every interior wall and in between the floors of my entire house.\n\nWe have a 2-story ranch style house with a U-shaped staircase down to the basement. The staircase does not have a door at the top or the bottom (open concept design). Would it be an acceptable idea to put rockwool between the entirety of the ceiling in the basement or not since sound would just travel up the staircase anyways? Or should I just focus on insulating the bedrooms/laundry room areas with Rockwool?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kf2lhm/should_i_install_rockwool_safe_n_sound_throughout/", "created_utc": 1746417506.0, "score": 23, "author": "Beezer_MB", "num_comments": 30, "permalink": "/r/HomeImprovement/comments/1kf2lhm/should_i_install_rockwool_safe_n_sound_throughout/", "html_title": ""}
{"title": "Stovetop had wrong regular setting for 5 years", "selftext": "I have no idea what made me think to check after 5 years, but the regulator on our stove top was set for ng not lpg. Always had an oranger flame than I’d like and less variance between low and high, so that explains it. Could this have caused any long term damage or concerns? Or just live and learn?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kdt2qh/stovetop_had_wrong_regular_setting_for_5_years/", "created_utc": 1746279179.0, "score": 19, "author": "krawzyk", "num_comments": 10, "permalink": "/r/HomeImprovement/comments/1kdt2qh/stovetop_had_wrong_regular_setting_for_5_years/", "html_title": ""}
{"title": "What are your best tricks for hanging things level?", "selftext": "No matter what I try, I never seem to be able to get things with multiple installation points to sit level. Now I have to hang 14 ft of curtain rod. Something like five pieces and six brackets. It's my worst nightmare come true. How do you guys do it?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke0xff/what_are_your_best_tricks_for_hanging_things_level/", "created_utc": 1746300176.0, "score": 16, "author": "TechStuffing", "num_comments": 43, "permalink": "/r/HomeImprovement/comments/1ke0xff/what_are_your_best_tricks_for_hanging_things_level/", "html_title": ""}
{"title": "Who do I hire to build an outdoor dog elevator?", "selftext": "Also, where would I find such a builder and any ideas what it would cost?  Any advice/guidance would be appreciated. The dog is a 100lbs Dutch Shepherd with arthritis. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kewirx/who_do_i_hire_to_build_an_outdoor_dog_elevator/", "created_utc": 1746398441.0, "score": 12, "author": "WindyCityChick", "num_comments": 42, "permalink": "/r/HomeImprovement/comments/1kewirx/who_do_i_hire_to_build_an_outdoor_dog_elevator/", "html_title": ""}
{"title": "How bad is this tile job?", "selftext": "My contractor is coming to grout in a couple days but there seems to be massive inconsistencies in the setting of some tiles? There is also a wide range of tile depth where some the edges are higher than tiles next to them.  \n\nPictures: https://imgur.com/a/NQFh0mY\n\n", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kdx90f/how_bad_is_this_tile_job/", "created_utc": 1746290583.0, "score": 15, "author": "bencnelson", "num_comments": 32, "permalink": "/r/HomeImprovement/comments/1kdx90f/how_bad_is_this_tile_job/", "html_title": ""}
{"title": "Thinking about expanding my house", "selftext": "I bought my house three years ago. My family has grown during that time. My wife recently mentioned that we should start looking for a new house, especially since it took us two years to find our current one—lol. We currently have a 2.8% mortgage.\n\nI suggested that we first find out whether it's cheaper to expand our current house or buy a new one. My question is: who do we hire to draw up a floor plan for an expansion without it costing an arm and a leg?\n\nI know one thing my wife doesn't like is the layout—we have two bedrooms on the first floor and two on the second, but there's no bathroom on the second floor.\n\nEdit room upstairs are cape cod style with height waist closet. And we have a tiny kitchen.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kez38h/thinking_about_expanding_my_house/", "created_utc": 1746405999.0, "score": 9, "author": "netsfan549", "num_comments": 21, "permalink": "/r/HomeImprovement/comments/1kez38h/thinking_about_expanding_my_house/", "html_title": ""}
{"title": "How bad are the cheap manually retractable awnings on Amazon?", "selftext": "I've looked at Sunsetter, Marygrove, etc awnings with the motors and sensors, but they're out of my budget for now. I see a bunch of under-$500 hand-retractable awnings on Amazon. I'm assuming this is cheap crap, but the reviews aren't as bad as I would have thought. Anyone ever used these? How long do they last, and are they worth it at all?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfc3cp/how_bad_are_the_cheap_manually_retractable/", "created_utc": 1746452978.0, "score": 9, "author": "macnfleas", "num_comments": 6, "permalink": "/r/HomeImprovement/comments/1kfc3cp/how_bad_are_the_cheap_manually_retractable/", "html_title": ""}
{"title": "Idaho - siding job company won't do the work", "selftext": "Location: This is in Idaho.\n\nBid the project out, and chose a local company that had done some interior and exterior projects for us in the past. Not the lowest bid, but also not the highest. We received a quote that included the 3' metal wrap-around on the bottom and fully reside the house in wood + painting. $30k. They asked for half up front. We paid the half right away. That was last July of 2024.\n\nThey haven't done anything. We've asked every few weeks since we paid them, and they come up with a new excuse every time. \"You're next in line; we'll be there next Monday; our other project went over budget; the rain came earlier than we were expecting.\" many many others.\n\nI'm worried that we are going to lose the $15k we paid last July, and that there may be a statute of limitations issue if we don't take care of this soon.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke800h/idaho_siding_job_company_wont_do_the_work/", "created_utc": 1746320803.0, "score": 5, "author": "FrugalIdahoHomestead", "num_comments": 13, "permalink": "/r/HomeImprovement/comments/1ke800h/idaho_siding_job_company_wont_do_the_work/", "html_title": ""}
{"title": "About to dig 2.5 tons of gravelly dirt for a fire pit area. What should I expect?", "selftext": "It’s been raining for a week so now’s the time to dig. Plan is to spend all day digging and wheelbarrowing to a 3 inch depth so I can put down weed barrier and pea gravel (I’d be buying in bulk, which is why I know how much the dug out ground will weigh).  \n\nWhat can I do to prepare my driveway? (tarp under? Tarp over? There will be too much material to use a tarp?) What other challenges might I expect?  \n\nHow easy/difficult will it be to get someone to take the unwanted material from the front yard?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfdsr9/about_to_dig_25_tons_of_gravelly_dirt_for_a_fire/", "created_utc": 1746457329.0, "score": 6, "author": "UtterDisgrace", "num_comments": 13, "permalink": "/r/HomeImprovement/comments/1kfdsr9/about_to_dig_25_tons_of_gravelly_dirt_for_a_fire/", "html_title": ""}
{"title": "How to approach privacy in yard?", "selftext": "Hi all - my house is a corner lot and the majority of my patio/backyard faces the street. Fence rules are 4 ft and the previous house came with these metal fences. Cost wise, I don't think we want to replace them with wooden fence so wondering what alternative thoughts you guys have? My friends were thinking putting up those privacy planters where the gravel meets the the concrete, a 6 ft bamboo fence tied to the existing fence, or just embrace the openness :c .... any ideas on how I can do this minimally, but also tastefully? \n\n\nThis is a link to the area I'm hoping to make more private. We dislike how little privacy we have when people walk by. \n\nhttps://imgur.com/a/FHigpOc\n", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kf3avl/how_to_approach_privacy_in_yard/", "created_utc": 1746420074.0, "score": 6, "author": "Bomjunior", "num_comments": 12, "permalink": "/r/HomeImprovement/comments/1kf3avl/how_to_approach_privacy_in_yard/", "html_title": ""}
{"title": "What is this on the wall?", "selftext": "House is 1930s but don't know when this was done? The house was redone in the 70s I think.  It's strange there are two arches either side you can see one in the top left corner which is on like a piece of metal attached to the ceiling and wall.\n\nhttps://imgur.com/a/YDJ2swt", "url": "https://www.reddit.com/r/HomeImprovement/comments/1keoexv/what_is_this_on_the_wall/", "created_utc": 1746377443.0, "score": 6, "author": "pronane", "num_comments": 7, "permalink": "/r/HomeImprovement/comments/1keoexv/what_is_this_on_the_wall/", "html_title": ""}
{"title": "Drainage breather pipe in the way to make shower wall flat. What are my options?", "selftext": "People that built my house didn’t do a great job in aligning the breather pipe within the wall. I am debating to either extend the wall out to clear the pipe or break cement and redo pipe to recenter it. Both plans seems overkill so I wanted to get your thoughts. \n\nhttps://imgur.com/a/OsN5Zmj", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke4umq/drainage_breather_pipe_in_the_way_to_make_shower/", "created_utc": 1746311103.0, "score": 7, "author": "freemadc2", "num_comments": 14, "permalink": "/r/HomeImprovement/comments/1ke4umq/drainage_breather_pipe_in_the_way_to_make_shower/", "html_title": ""}
{"title": "Paint overspray on concrete", "selftext": "Hired a paint company to paint my house. Unfortunately they don’t do a good job of taping off the concrete where the siding ends and got overspray on the concrete. (And our outdoor furniture) Lots of neighbors recommended this company which is why we went with them. What is a reasonable ask? Can they even get the over spray off? Should I ask for discount? Am I over reacting? Images: https://imgur.com/a/UKWwRdu ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ke0lob/paint_overspray_on_concrete/", "created_utc": 1746299308.0, "score": 6, "author": "Conscious-Bar-8572", "num_comments": 4, "permalink": "/r/HomeImprovement/comments/1ke0lob/paint_overspray_on_concrete/", "html_title": ""}
{"title": "Fuse keeps blowing", "selftext": "This issue has gotten worse over the 3 years we have lived in the house.\nTwo bedrooms in my house are connected to the same breaker. My house has no central air so window units are what we use during the summer. We used to be able to have the unit in our room going all day for months with no issues, but now it’s gotten to where even plugging it in blows the fuse.\nI’m not sure what to do to fix this as it gets really muggy and hot in the house if we can use it.\nI can’t afford to have an electrician come look at it. \nAny help would be appreciated. House was build in 1913 in PA. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfe9np/fuse_keeps_blowing/", "created_utc": 1746458472.0, "score": 4, "author": "dalliecat", "num_comments": 10, "permalink": "/r/HomeImprovement/comments/1kfe9np/fuse_keeps_blowing/", "html_title": ""}
{"title": "Driveway + sidewalk angle too drastic for car to enter", "selftext": "I have a house with a garage that I cannot park my car into because the incline onto the sidewalk and the decline onto the garage driveway are both very steep. My car would bottom out and seesaw on the peak. I don't know if city code allows for me to redo the pedestrian walk way so a little dip can be designed into get rid of the sharp and drastic change in angle. And excavating the sidewalk and the driveway would also mean the small surrounding retaining walls would need to be redone too. Ugh, any direction from the pros here?\n\nPicture: https://i.imgur.com/HbALbic.jpeg\nCrude side cutaway: https://i.imgur.com/Q7y4HeS.jpeg", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kf2wdi/driveway_sidewalk_angle_too_drastic_for_car_to/", "created_utc": 1746418557.0, "score": 4, "author": "J1L1", "num_comments": 2, "permalink": "/r/HomeImprovement/comments/1kf2wdi/driveway_sidewalk_angle_too_drastic_for_car_to/", "html_title": ""}
{"title": "Garage has extra doors.", "selftext": "My garage has a normal garage door. Up and down, usual. There's less than an inch between the garage door and the extra doors.\n\nThere are two, sliding wooden doors (no wheels) outside on the pavement that also need to be opend. They're like barn doors but nearly 5 inches thick with insulation between roofing construction boards. Taking them off is very evident as the garage concrete is a much darker Grey from the sidewalk/driveway concrete with a 6 inch indent.\n\nI've never seen another house anywhere with pull out doors for the garage. Now that I'm typing it out, I realize everything is thicker than a normal house. \n\nEither way, I was wondering if anyone knows what it could be called so I could build a new one without destroying something. The house was built in the rocky mountains in 1974 if that helps any.\n\nThanks for at least reading and helping if you can.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kezkry/garage_has_extra_doors/", "created_utc": 1746407517.0, "score": 6, "author": "BedHead797", "num_comments": 2, "permalink": "/r/HomeImprovement/comments/1kezkry/garage_has_extra_doors/", "html_title": ""}
{"title": "What can I do to fix the temperature differences between the different floors of my house? Thank you", "selftext": "I live in a post-ww2 urban 1.5 story home in the upper midwest. It is centrally heated and cooled. \n\nThe partially finished basement is always cold. In the winter it stays in the 50s F, in the summer it's around 65 F. The upper half floor is very hot in the summer (in the 80s), and very cold in the winter (in the 50s/60s). I suspect one factor the upstairs is like this because of poor insulation.\n\nWhat are my options or steps for addressing this? My energy company offers home energy audits. Is this something that will be a good step?\n\nThank you", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kez1h2/what_can_i_do_to_fix_the_temperature_differences/", "created_utc": 1746405853.0, "score": 5, "author": "rule34chan", "num_comments": 14, "permalink": "/r/HomeImprovement/comments/1kez1h2/what_can_i_do_to_fix_the_temperature_differences/", "html_title": ""}
{"title": "How to make a covered patio structure/gazebo that can easily convert to sunroom and then have the walls removed again?", "selftext": "Hi all! I'm wondering if anyone here has ideas on how to do this, because I've searched the internet and can't seem to find what I'm looking for. I want to add some kind of gazebo/pergola/covered patio area in our backyard that doesn't have any walls to it, just the pillars to hold it up. There are a million of these you can buy from home depot, costco, and a ton of other online retailers, and these would be great for the summer.\n\nHowever, I would love to be able to extend how much of the year we can be outside by being able to convert it into a sunroom as it starts to get cooler in the fall (or starts to barely warm up in the spring), by having big window panels that I could put up on all four walls and then have a space heater inside, etc. It wouldn't need to be fully sealed—I don't expect to be able to use it in the dead of winter and still be warm in there—but I would like to be able to use it on a chillier fall or spring day and be outdoors more often, without being boiled to death and having it be unusable when it's 100 degrees outside in the summer.\n\nThere are also lots of sunroooms available for purchase that can be assembled in just a day or two, but from what I can tell from my online research, they seem to be designed to not be taken apart once they're built—everything is screwed together pretty permanently and it would be a multi-person, multi-day operation to remove the walls, and possibly would result in damage to the structure.\n\nIs there a product I'm missing, and/or something that we could cobble together? We're moderately handy—can follow any instructions for assembly of stuff, have replaced light fixtures and electrical outlets, have made some basic wood furniture like end tables and stuff, have lots of tools on hand, etc., but I don't know where to really start on something like this. I think my ideal would be something that starts with a basic costco/home depot type structure, then adapting it to be able to have sun wall/windows that can be easily added/removed seasonally as needed. Is that possible? Any ideas on how to approach it? Thinking something between 10-14 ft on one side, and 12-16 ft on the other side (so 10x15, 14x14, etc, could all be in play).", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ket29n/how_to_make_a_covered_patio_structuregazebo_that/", "created_utc": 1746389241.0, "score": 7, "author": "lackstoast", "num_comments": 7, "permalink": "/r/HomeImprovement/comments/1ket29n/how_to_make_a_covered_patio_structuregazebo_that/", "html_title": ""}
{"title": "How to improve or remove these stairs? Screws completely rusted out.", "selftext": "https://imgur.com/a/TYAxZAk\n\nHello all. These old stairs have started to lift and warp. I wanted to remove the bad ones but it seems the screws are basically rusted to the core. Any application of torque and the screw turns to dust. \n\nMy initial plan was to remove a few steps and replace them. Then paint the stairs and add a handrail where it fell off due to wood rot. Now due to fighting these screws for half an hour I am now realizing I won’t be able to get them out. \n\nWhat would my best course of action be? Remove them? If so how? Cut the wood? Or should I simply add more screws to tighten it down and call it a day? Any suggestions would be great. Thanks. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kesyk9/how_to_improve_or_remove_these_stairs_screws/", "created_utc": 1746388975.0, "score": 6, "author": "Ireallydontknowbuddy", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kesyk9/how_to_improve_or_remove_these_stairs_screws/", "html_title": ""}
{"title": "Used Pressure Washer Lightly on Siding - Is this still dirt?", "selftext": "I used a pressure washer very lightly to just rinse my siding. I didn’t go too close because my siding is painted. What are these marks? Just dirty areas? Thank you!\n\nPictures: https://imgur.com/a/KOwdGDj", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kds6ke/used_pressure_washer_lightly_on_siding_is_this/", "created_utc": 1746276511.0, "score": 5, "author": "Frogbull13", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kds6ke/used_pressure_washer_lightly_on_siding_is_this/", "html_title": ""}
{"title": "What type of light bulb for this pendant light?", "selftext": "[Another Image ](https://imgur.com/gallery/VnbAnG7)that shows a GU10(doesn't fit) bulb held up to socket.\n\n[Image link](https://imgur.com/gallery/zIe5PxF)\n\nIs it possible the socket is missing? ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kdrze9/what_type_of_light_bulb_for_this_pendant_light/", "created_utc": 1746275868.0, "score": 6, "author": "MikeTheVike", "num_comments": 6, "permalink": "/r/HomeImprovement/comments/1kdrze9/what_type_of_light_bulb_for_this_pendant_light/", "html_title": ""}
{"title": "UV protection for grout/tile", "selftext": "Hello all,\n\nWe just had our outdoor shower installed and I was wondering if any of you know of a grout sealant that provides some UV protection. Does such a product exist?\n\nThe area gets some decent sun. Building a permanent shade is obviously the best option but I like the idea of having sunlight in the area of there is an option to allow it. Thanks!", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kdr6ip/uv_protection_for_grouttile/", "created_utc": 1746273157.0, "score": 5, "author": "tbm6070", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kdr6ip/uv_protection_for_grouttile/", "html_title": ""}
{"title": "New Blinds Are Stuck", "selftext": "Just got a new place and have blinds like this in three different rooms. All new. All stuck like this. The cords seem to do nothing. Pulling any gives tension like I might break it. Any ideas what might be the issue? \n\nPics: https://imgur.com/a/jDW0sCt", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kdlzys/new_blinds_are_stuck/", "created_utc": 1746251934.0, "score": 6, "author": "OkLibrary4010", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kdlzys/new_blinds_are_stuck/", "html_title": ""}
{"title": "Rant: DIY cordless blinds install with blinds.com", "selftext": "So I recently redid a room with some newly ordered cordless blinds from [blinds.com](http://blinds.com), from the Bali brand. I have to say that the blinds are just fine and I am happy with them, BUT: the supplies that came with the blinds for installation were unacceptably bad. The screws for the headrail latch fixtures had protruding heads, and since the blinds were measured to fit the window frame exactly, they blocked the headrail's entry and I had to go and buy flathead screws to replace them. Also, the plastic clips that came with the valances are useless and have no effective way to fix onto the headrail, so I had to go and buy a set of better plastic valance clips on Amazon. Honestly, I get that I saved money by going DIY and I am still happy with the end result, but man, the company could be better about supplying tools and parts that actually work. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kdlfwa/rant_diy_cordless_blinds_install_with_blindscom/", "created_utc": 1746249730.0, "score": 5, "author": "rhizodyne", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kdlfwa/rant_diy_cordless_blinds_install_with_blindscom/", "html_title": ""}
{"title": "What Home Essentials would you buy if you were to start from 0? e.g. things that give a lot of value in terms of longevity or multiple-usage.", "selftext": "Context: I am moving out into my own place for the first time since being a student and i have the chance to buy my own possessions to use at my new home. \n\nWould love to know what are the home essentials that people are buying to ensure 1. I only need to buy once, 2. I am buying things that have multiple uses (like those screwdriver toolkits that do everything instead of buying multiple different tools) ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjn9g/what_home_essentials_would_you_buy_if_you_were_to/", "created_utc": 1746471232.0, "score": 3, "author": "vkkt", "num_comments": 12, "permalink": "/r/HomeImprovement/comments/1kfjn9g/what_home_essentials_would_you_buy_if_you_were_to/", "html_title": ""}
{"title": "What's the best method for waterproofing plywood under concrete?", "selftext": "We are remodeling our pool deck that's going to be 2.5\" concrete poured over a plywood base. Originally the plan was to treat the wood with sealant and then also lay plastic sheeting over it for an additional barrier. However, the person doing the concrete has advised that it's not a good idea to pour on top of the plastic because it will heat up the concrete and cause it to crack while it's drying.\n\nMy contractor says the sealed plywood should be fine, and offered to also add a paper-based layer if I want. But I'm still worried that the eventually water might get through and rot the plywood.\n\nIs there a better way to do this that my contractor isn't aware of or is just treating the plywood with sealant really the best way to go?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfix7s/whats_the_best_method_for_waterproofing_plywood/", "created_utc": 1746469495.0, "score": 3, "author": "nelisan", "num_comments": 13, "permalink": "/r/HomeImprovement/comments/1kfix7s/whats_the_best_method_for_waterproofing_plywood/", "html_title": ""}
{"title": "Floors before walls or walls before floors?", "selftext": "I am moving in to my first home. Want to get the floors sanded, stained and poly’d and the walls painted before moving in. What is the correct order to do this in and why? Thanks! ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfeog8/floors_before_walls_or_walls_before_floors/", "created_utc": 1746459453.0, "score": 3, "author": "bosoxrox24", "num_comments": 7, "permalink": "/r/HomeImprovement/comments/1kfeog8/floors_before_walls_or_walls_before_floors/", "html_title": ""}
{"title": "Mice detection system", "selftext": "Recently redid our home and looks like more mice are showing up. Any idea of a tech monitoring system for mice. I put lot of trays but don’t know when they get caught. Any idea will be grateful .", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kf5kyk/mice_detection_system/", "created_utc": 1746429431.0, "score": 3, "author": "Important-Try9364", "num_comments": 7, "permalink": "/r/HomeImprovement/comments/1kf5kyk/mice_detection_system/", "html_title": ""}
{"title": "Bathroom ceiling paint: Need a glossy finish?", "selftext": "No ventilation bathroom, had plaster on ceiling repaired, then a primer/sealer coat.  What type of paint for the grand finale (lol)? I have read not a matte:  semi gloss, eggshell, or satin? ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ketuac/bathroom_ceiling_paint_need_a_glossy_finish/", "created_utc": 1746391222.0, "score": 4, "author": "Serious-Benefit-1374", "num_comments": 11, "permalink": "/r/HomeImprovement/comments/1ketuac/bathroom_ceiling_paint_need_a_glossy_finish/", "html_title": ""}
{"title": "Should I be worried about a crooked shower trim / valve?", "selftext": "My mom recently replaced a tub and its plastic bath walls. \n\nThis meant opening the wall, redoing plumbing, replacing trim and etc.\n\nThe trim is crooked. When I asked them to come back and fix it, they said the trim wasn’t tight so they tightened it, and put some silicone around the plate. But it is still crooked.\n\nHere are photos: https://imgur.com/a/AUtS9oJ\n\nI think that there’s something up with the valve. \n\nAnyway, can you please tell me, should I be concerned? Do I need them to rip out the wall and redo the plumbing? A friend mentioned they are concerned that the piping is bent. \n\nI don’t care about the aesthetics, at this point I just want to make sure we’re not at risk for a leak or bigger issue.\n\n\n\nSome background info if it matters:\n\nMy mom was suspicious of their work throughout the process because she had a gut feeling that one guy was training the other, and that they were taking a lot of breaks. They ended up going over the budgeted hours and charged her extra which she said they acknowledge it was their fault. To me, they said there was a leak they needed to fix.\n\nHowever the he said she said is really hard to prove, since I was never there. And it’s not documented (I will ask for documentation). At one point I stepped in to make sure they don’t charge extra hours and now I have been dealing with them. \n\n\n", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfg5n0/should_i_be_worried_about_a_crooked_shower_trim/", "created_utc": 1746462977.0, "score": 2, "author": "CandySuccessful9283", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kfg5n0/should_i_be_worried_about_a_crooked_shower_trim/", "html_title": ""}
{"title": "Removed carpet and concrete floor has terrible odor - what do I do?", "selftext": "Removed carpet and padding in master bedroom with intent to put down vinyl flooring in a few weeks. Has a strong odor, like paint almost or a chemical, even after mopping one time. How do I fix this? Thank you for any help! ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffsub/removed_carpet_and_concrete_floor_has_terrible/", "created_utc": 1746462125.0, "score": 2, "author": "Impossible_Mine_4163", "num_comments": 4, "permalink": "/r/HomeImprovement/comments/1kffsub/removed_carpet_and_concrete_floor_has_terrible/", "html_title": ""}
{"title": "How to sand stairs for refinishing?", "selftext": "Hi there! Recently bought a house that had mostly carpeted stairs. We ripped out the carpet & have started to sand them down with the hopes to refinish them with no carpet or runner. The problem we're running into is getting all of these splotchy spots out and getting the small amount of existing stain off the riser portion in particular ([images here](https://imgur.com/a/Z8o9BLg)).\n\n  \nWe have an orbital sander and have been starting with 50 & 80 grit, but it's not seeming to budge! We also have some scrapers that are working great on getting the old stain off the outer parts of the tread, but not so much the random spots in the middle of the stair (that were under the carpet). Any ideas what might help here?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfb8h4/how_to_sand_stairs_for_refinishing/", "created_utc": 1746450617.0, "score": 2, "author": "Altruistic-Secretary", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfb8h4/how_to_sand_stairs_for_refinishing/", "html_title": ""}
{"title": "What is the best way to remove this stone veneer without completely ripping out the drywall? Or should I just plan on installing new drywall?", "selftext": "https://imgur.com/a/dy0XWI3\n\nEdit: I plan on putting shiplap or some sort of wood paneling after", "url": "https://www.reddit.com/r/HomeImprovement/comments/1keqai4/what_is_the_best_way_to_remove_this_stone_veneer/", "created_utc": 1746382155.0, "score": 2, "author": "CarminSanDiego", "num_comments": 2, "permalink": "/r/HomeImprovement/comments/1keqai4/what_is_the_best_way_to_remove_this_stone_veneer/", "html_title": ""}
{"title": "Dry Air. Please Help!!", "selftext": "The air in my house (I am assuming) is dry. My wife, myself and my 2 young children are struggling to breathe. We are waking up with sore throats and drainage. We were told the filters in the house were changed when we moved in 5 months ago. The problem was still happening then but not as bad. I plan to replace the filters but they still look in new condition almost. \n\n\nWe have one small humidifier in our room. This is becoming a real problem. Any ideas of the problem or a solution?? \n\nI live in Dallas Texas if that helps.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1ken1kc/dry_air_please_help/", "created_utc": 1746373960.0, "score": 2, "author": "Worldly-Chart5257", "num_comments": 9, "permalink": "/r/HomeImprovement/comments/1ken1kc/dry_air_please_help/", "html_title": ""}
{"title": "how standard are the kitchen faucet fittings?", "selftext": "my wife got a mini dishwasher for us to use on the counter top. it hooks up to the faucet.\n\nI went to unscrew the faucet aerator and it just popped off. apparently it was already stripped. so I think I need to buy a new faucet to get the threads needed to hook up the dishwasher. do you know if all faucet sizes are standard is this regard? thanks ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfk284/how_standard_are_the_kitchen_faucet_fittings/", "created_utc": 1746472212.0, "score": 1, "author": "Solar-powered-punch", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfk284/how_standard_are_the_kitchen_faucet_fittings/", "html_title": ""}
{"title": "Sealing my basement.", "selftext": "So i plan on finishing my basement. I came across the moisture problems during my research and the different techniques to address it.\n\nMy question is can I use a liquid moisture barrier around the foundation walls and concrete floor and then install vinyl plank flooring or no?\n\nShould I use 1/2 inch thick pink insulation after sealing it with the liquid vapor barrier on the foundation walls and the frame on top of it?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjzv8/sealing_my_basement/", "created_utc": 1746472059.0, "score": 1, "author": "Shoddy_Being_3833", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfjzv8/sealing_my_basement/", "html_title": ""}
{"title": "Dryer not drying", "selftext": "My dryer has completely stopped drying. The tub spins, but no heat. I replaced the heating element, the thermostat (limit and cycle), thermal cutoff switch, and thermal fuse. The vent line is completely clear (only about 3 feet from dryer to outside. None of that worked, so I got a new dryer, plug it in and same issue. My next thought was the outlet even though it tested fine with the meter I replaced it and nothing. Help please lol", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjz2l/dryer_not_drying/", "created_utc": 1746472011.0, "score": 1, "author": "PirateInteresting914", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfjz2l/dryer_not_drying/", "html_title": ""}
{"title": "Chimney breast removal", "selftext": "Anyone got recent quotes for chimney breast and stack removal? Removal of chimney breast at both floors. Including new goal post frame. In the south west of England. \n\nTIA! ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjwq7/chimney_breast_removal/", "created_utc": 1746471854.0, "score": 1, "author": "Appropriate-Watch737", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfjwq7/chimney_breast_removal/", "html_title": ""}
{"title": "Pressure Treated Deck Refinishing?", "selftext": "Hello!  \n\nI recently moved to a new home that has a pressure treated deck out back that gets sun all day long.  It looked great when we bought it but now all the paint has peeled and the wood is quite cracked with some raised / splitting knots throughout.\n\nAny recommendations on refinishing or does this need replacement?  I thought perhaps flipping the boards as the underside on many seem to be in much better shape and I could pressure wash, sand where needed and oil stain? \n\n\n\n[https://drive.google.com/drive/folders/1bsn7CASmW7\\_K8iod8ry4dr0UapwdLNDm?usp=sharing](https://drive.google.com/drive/folders/1bsn7CASmW7_K8iod8ry4dr0UapwdLNDm?usp=sharing)\n\n  \n[Deck Pics](https://drive.google.com/drive/folders/1bsn7CASmW7_K8iod8ry4dr0UapwdLNDm?usp=sharing)", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjw7m/pressure_treated_deck_refinishing/", "created_utc": 1746471818.0, "score": 1, "author": "islandviewgirls", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfjw7m/pressure_treated_deck_refinishing/", "html_title": ""}
{"title": "Cat Door Staircase Conundrum", "selftext": "Hi all, I'm hoping for some ideas. We just had new doors installed in our house; one at the top of our basement stairs, which do not have a landing (https://imgur.com/a/VH5hLdf). Our contractor put a cat door in for us, but it had to be installed high up in that decorative panel area so it didn't mess with the integrity of the door. Unfortunately, this makes the cat door unusuable--especially for my arthritic cat. Had I known this limitation before, we wouldn't have gone this route (I wasn't there when it was put in).\n\nSo, any ideas for something creative I could do to provide a platform, ramp, or way of getting to the door more easily? I'm thinking of a carpeted platform that's corner shaped, starts where the hinge side of the door meets the basement wall, and comes out to meet the opposite edge of the cat door, positioned right at the bottom of it. That way they can jump from the top step to the platform and come out, and it's out of the way for people going up and down. \n\nAny ideas--explained to me like I'm a toddler--are much appreciated", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjo01/cat_door_staircase_conundrum/", "created_utc": 1746471281.0, "score": 1, "author": "BuffyTheEggPileLayer", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfjo01/cat_door_staircase_conundrum/", "html_title": ""}
{"title": "Outdoor exhaust vent replacement", "selftext": "The vent is about 20 years and has a flap that gets stuck open hence a bird nest in there now. It's a 9in vent cover with I believe a 7in vent pipe. The screws are not accessible without removing siding. Any ideas where to get a replacement and how to remove the old one?\n\nhttps://imgur.com/a/lj9bznq\n", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjf16/outdoor_exhaust_vent_replacement/", "created_utc": 1746470681.0, "score": 1, "author": "jaconsbacon", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfjf16/outdoor_exhaust_vent_replacement/", "html_title": ""}
{"title": "Blinds.com for Roman Shades", "selftext": "I’ve gotten multiple quotes for custom traditional Roman shade installation in my home. I went through a company with Costco who quoted me over 10k for 10 windows. \n\nI’ve since reached out to Blinds.com who have quoted me 70% less and claim their quality is the same. \n\nAnyone out there use Blinds.com? What’s the quality like? Were you happy with process? ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfj8ij/blindscom_for_roman_shades/", "created_utc": 1746470249.0, "score": 1, "author": "Beneficial-Table9497", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kfj8ij/blindscom_for_roman_shades/", "html_title": ""}
{"title": "Is there an app where I can do an architectural drawing?", "selftext": "I want to put a window over my shower and the HOA, in order to approve it, requires a drawing with specs etc. I've called architectural firms and this is way too small for them to want to do it. So, is there something out there that I can use to draw the window and specs to appease the HOA?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfiqzr/is_there_an_app_where_i_can_do_an_architectural/", "created_utc": 1746469091.0, "score": 1, "author": "praguer56", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfiqzr/is_there_an_app_where_i_can_do_an_architectural/", "html_title": ""}
{"title": "Remodeling with new carpet, doors, and paint.  Is this the best order?", "selftext": "I am remodeling areas of my house and want to make sure I am doing these things in the right order.  I have attached a [layout ](https://imgur.com/a/TZmROYe)of the rooms in case it helps visualize.  For starters, there is currently carpet in living room, hall, and master which is all going to be replaced with more carpet.  The hardwood shown in those other two bedrooms is going to stay, but the hardwood does continue under the carpeted areas.  The bathroom has linoleum now but will be replaced with tile.  I mention all this to give an idea of the different levels of flooring.  So first of all, before any flooring is replaced, I am thinking I need to install the new prehung doors.  For the 3 bedrooms, since the hardwood is under everything and will be the same level, that will be easy to just install them all the way down to sit on the hardwood.  With the bathroom (which is being remodeled with tile), I think I need to put in the door before they put in the tile, because If I do it afterwards, the tile in the bathroom will be higher than the hardwood in the hall, so I am not sure how that would work. It seems like I would have to notch something.  Am I correct in installing the door here first so it sits on level ground?\n\n  \nOnce the bathroom is finished, I will paint the living room, hall, and master (the other two bedrooms don't need to be painted), including the ceilings, and not care about making a mess because the carpet will be replaced.  I am going to be putting all new baseboards in so I will remove the old ones before I paint everything, and then once the old carpet is removed and new one in place, I will install new baseboards and finish casing the doors.  I figure to put a coat of paint on the baseboards and trim before installing them, and then touching up the nail holes after I install them.  Does this all sound like the correct order?  Any tips are appreciated.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfipy6/remodeling_with_new_carpet_doors_and_paint_is/", "created_utc": 1746469025.0, "score": 1, "author": "dm7676", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kfipy6/remodeling_with_new_carpet_doors_and_paint_is/", "html_title": ""}
{"title": "Remove trim or keep it.", "selftext": "Remove trim or keep it?\n\n\nRepost to add pictures: https://imgur.com/a/nIJmHhI\n\nFIL and I are debating and are split. I have pvc trim touching the dirt. I’ve read we need clearance to prevent termites and pests, but it is a simple slab behind it and the floor framing starts probably about halfway through the trim. \n\nOn one hand, removing the PVC trim will get us some clearance between the dirt and siding. \n\nBut FIL brought up the fact we may not want to remove it because the base of the framing would be behind that area. So, we would want the trim there protect against water. \n\nUnsure whether to remove trim or just keep it. We’ve removed quite a bit of dirt from this area but cannot remove more without compromising the swale. \n\n\n\nSide note. This area is a slab. Where the trim is absent on the side is the main house, there is a basement below that but not where the trim is ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfihx7/remove_trim_or_keep_it/", "created_utc": 1746468500.0, "score": 1, "author": "SGP_MikeF", "num_comments": 2, "permalink": "/r/HomeImprovement/comments/1kfihx7/remove_trim_or_keep_it/", "html_title": ""}
{"title": "Need a little help", "selftext": "My husband and I are redoing our living room and the floor shakes when you walk on it. My husband and I thought it would be good idea to put down osb plywood since that's what I read on Google and it's cheap but my father-in-law wants us to puts down lauan plywood for the floor and my husband is thinking of just doing what his dad says. I've been reading that it isn't good for what we need it for. Is there a better option out there that my husband and I are not seeing. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfifpj/need_a_little_help/", "created_utc": 1746468357.0, "score": 1, "author": "Living_Alternative87", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kfifpj/need_a_little_help/", "html_title": ""}
{"title": "Converting a wood burning fireplace to a gas one", "selftext": "I recently moved into a place with a wood burning fireplace and want to convert it to a gas one. There is a gas line directly beneath it so it shouldn’t be too hard. What service should I contact to have it done? Would the gas company I use do it or with a local contractor be able to do it?\n\nAny help would be much appreciated ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfick9/converting_a_wood_burning_fireplace_to_a_gas_one/", "created_utc": 1746468153.0, "score": 1, "author": "TonyPerkiss", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfick9/converting_a_wood_burning_fireplace_to_a_gas_one/", "html_title": ""}
{"title": "Do I need an exterminator if I haven't caught any squirrels in my attic?", "selftext": "Prior to us purchasing our home (5 years ago) there was a squirrel nest in the attic.  The home was a rental so it wasn't maintained as well as it should have been.  The squirrels chewed some holes in the fascia boards in multiple places/eaves of the house to get inside.  **We set up a squirrel trap** with peanutbutter & birdseed bait (my grandpa swears by this combo) in the attic **but have not caught any squirrels** in the three years that we have tried to bait them to remove them.  **We do hear the squirrels sometimes** scurrying up there so we know they're still semi-active, but we can't seem to trap (or shoot) the darned things.  The areas where the holes are chewed through are impossible for us to reach in the attic so we don't have much visibility.\n\n  \nWe have a contractor coming to fix the holes in the fascia boards while he does some other work here and **we're wondering if we need to hire an exterminator first** to ensure all the squirrels/nest debris are out of the attic before they just chew another hole to try and get back inside.  The exterminators are wanting $200 just to come out - our contractor mentioned that they might just put more traps up there and considering we already have a trap up there that hasn't caught anything it may be pointless.\n\n  \nDoes anyone have experience with removing squirrels and making fascia repairs and if so, can you share about your experience?  Did you use an exterminator, was it worth it?\n\n  \nAlternative ideas that have come up in conversation with family/friends:\n\n* Someone suggested offering the bait somewhere away from the house to see if they'll just be content with that - we haven't tried the trap outside in the yard so we might try that and see what happens.  We have a new birdfeeder so maybe we'll leverage that.\n* Our in-laws' cat (used to be our cat) is a good mouser and sometimes they stick him up in their own attic for an hour or two about every month to see if he'll catch any mice.  He's caught at least 1 mouse every single time he's been up there, so we wonder if he could scout out any squirrel activity in our own attic.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfiaof/do_i_need_an_exterminator_if_i_havent_caught_any/", "created_utc": 1746468040.0, "score": 1, "author": "StatueofLiterby", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfiaof/do_i_need_an_exterminator_if_i_havent_caught_any/", "html_title": ""}
{"title": "Asphalt to Concrete wall sealing", "selftext": "1). I rent. Major renovations are not possible. Lets just get that out of the way first.\n\nThere is an asphalt pad under and next to our deck in the back yard. It has sunk about 2\" and now the basement is leaking, just from beside the water spigot to the edge of the asphalt. The area was previously sealed by a company building a 45\\* angle of small rocks and sealing the resulting face with some kind of rubberized pavement/asphalt seal. The sinking has opened a crack that ranges from 1/4\" to over 1.5\" in the small rocks. I did my best to clear out the rocks/dirt/etc from this area and could see about 1.5\" of dirt between the house wall and the edge of the asphalt, about 2\" below the top of the asphalt. I could also see the edge of a plastic sheeting material, pulled away from the wall by at least 1\" with dirt on all sides. I stuffed some heat-activated asphalt sealant into the cracks and melted as directed. It appeared to work for the lighter rains (less than 1/2\" total) but when we then had a heavier ran (over an inch in about 12 hours) it leaked again. I suspect that the product did not actually fill all of the crack, this was my first time using anything like this.\n\nOn the INSIDE of the basement, it's semi-finished, with the only fully built out area being the closet that appears to be the location of the leak. The walls have thick stucco coating, so i can't see what the concrete looks like under them, there is a 2 foot or so area that has spalling of the stucco, so I know that some moisture is coming in there. At the floor level, I can't see the joint/bottom of the wall due to the combination of wood edging, 2x4 framing members and that d\\*mn stucco. I can tell that the water is coming in at the bottom, and being \"sucked\" along the 2x4s that frame the closet and laundry room into the rest of the basement, with a limited amount passing under the tiles in the laundry room to the drain. There is no french drain, sump pump, or other internal water directing system. \n\nI'm willing to put enough work into this to keep my stuff from being destroyed (already lost two particle board bookcases, but those things suck anyway), but I'm not going to do thousands in work, and the owner has already indicated that he is not in a position to fix anything right now (plus the deck is only 2 years old...he's not ripping it out to get the asphalt along the wall....). \n\nStandard items like fixing the downspouts (already directing away from the house, no blockages, etc) and ensuring the grade is right (despite the sinking in the asphalt, water still runs away from the wall if you poor it on the ground) have already been done.\n\nShould I dig out what I tried to fix the wall with, put in a new angled small rock connection point, and reseal with something similar to what was used previously? It lasted about 5 years before the leaking returned. Or do you have another suggestion for sealing such a small surface area? (pictures will be added this evening, I'm at work currently)\n\nIs it worth removing the stucco and painting the interior wall with waterproofing? \n\nShould I rip out the damn framing and edging so I can at least see the bottom of the wall/joint? \n\nOther notes: We have a dehumidifier that is always set up, usually it is 40-50% humidity and runs intermittently. I keep fans and a heavy duty vacuum handy for any water removal that might be needed, dry everything as fast as possible once leakage does occur, treat for mold after it's dry, etc. We have been here for about 9 years, and I would be fine with never moving, my spouse wants to find a new place in the next 2 years for reasons entirely unrelated to the quality of the rental (which is actually quite nice and reasonably priced). \n\nI'm only interested in the best DIY repairs for this crack and leakage, that won't cost thousands. Opinions?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfi9he/asphalt_to_concrete_wall_sealing/", "created_utc": 1746467966.0, "score": 1, "author": "Ambam2022", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfi9he/asphalt_to_concrete_wall_sealing/", "html_title": ""}
{"title": "Easily removeable mailbox?", "selftext": "I did not come here without a healthy amount of google searching but I am coming up empty, hoping I can get some help here. Our neighborhood requires curbside mailboxes, the traditional box with flag on a post of your choice and design preference. That has suddenly become an issue with our new travel trailer, where our backing in our driveway is very challenging because I am working around our mailbox that's in a very unfortunate location. It's doable, but not without a spotter and a couple attempts. I've been towing for \\~10 years but this would be a tight fit for anyone.   \nSo....has anyone seen a mailbox post mount that can be easily removed and leave a flush surface that can be driven over? I'm not really concerned with theft, it's a quiet mostly-retired neighborhood, so it just need to be relatively easy to remove/reinstall. Any suggestions welcome! (other than those that involve me getting better at backing up)", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfhvac/easily_removeable_mailbox/", "created_utc": 1746467013.0, "score": 1, "author": "Cyber_CEO", "num_comments": 6, "permalink": "/r/HomeImprovement/comments/1kfhvac/easily_removeable_mailbox/", "html_title": ""}
{"title": "Rocky Mountain hardware - contractor says they don’t make hinge stops to fit renovated area door. Anyone know of a brand that will fit / work with it? This is on an interior door.", "selftext": "", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfhff5/rocky_mountain_hardware_contractor_says_they_dont/", "created_utc": 1746465981.0, "score": 1, "author": "Kitchen-Primary316", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfhff5/rocky_mountain_hardware_contractor_says_they_dont/", "html_title": ""}
{"title": "Advice Required - Smooth Out Wall?", "selftext": "Need advice on whatever is happening here - https://imgur.com/a/Wv2DYdv\n\nI've got a disabled friend and have noticed this happening to her wall. Not got a clue what's going on, but she's asked me to sand it to smooth it out but I'm not sure if that would cause any unintended issues. \n\nCan anyone shed any light on what's happening? Or if sanding off some of the layers of paint would be appropriate? Or would that cause some issues I'm not aware / can't think off?\n\nWall is brick, with plaster over to smooth it out and then painted.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfha2m/advice_required_smooth_out_wall/", "created_utc": 1746465640.0, "score": 1, "author": "SnareDrumKneeCaps", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfha2m/advice_required_smooth_out_wall/", "html_title": ""}
{"title": "Exterior Trim Around Door", "selftext": "I have a piece of trim around an exterior storm door that leads out to my deck. It needs to be painted and is rotted at the bottom, so I’d like to just replace it. It’s between another piece of trim and the siding end strip. Does it serve any purpose other than filling a gap? Can I just pry it out of there and replace it with maybe PVC trim? Thanks. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfh15z/exterior_trim_around_door/", "created_utc": 1746465067.0, "score": 1, "author": "EzBonds", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfh15z/exterior_trim_around_door/", "html_title": ""}
{"title": "Punch Home and Landscape Design", "selftext": "Bought my 50 year old tradesman uncle a laptop and want to install is software of choice but his DVD no longer works. I'm looking for a digital copy of Punch Home and Landscape Design (NexGen) 2008. I'd really like to make his day. Thanks.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfguql/punch_home_and_landscape_design/", "created_utc": 1746464653.0, "score": 1, "author": "tremendoza", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kfguql/punch_home_and_landscape_design/", "html_title": ""}
{"title": "Shower Build", "selftext": "I am going to be “building” either a 48x60 or 60x60 shower. The space will work with either size. \n\nI’m leaning towards a direct-to-stud shower wall system. My question is for the pan. If I’m doing a fiberglass pan, is it really just as easy as installing the walls, putting the pan down on its mortar base, sealing the edges of it all and boom? Seems way too simple. \n\nWhat am I missing?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfg62f/shower_build/", "created_utc": 1746463004.0, "score": 1, "author": "thegoodADHD", "num_comments": 2, "permalink": "/r/HomeImprovement/comments/1kfg62f/shower_build/", "html_title": ""}
{"title": "Exterior Door ??", "selftext": "Can I hang a left hand in swing door backward to fit right in swing opening? I don't like our front door, which is fairly new. The door on the back of the garage is the same size, just opposite facing and needs to be replaced.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfg39j/exterior_door/", "created_utc": 1746462819.0, "score": 1, "author": "Secure_Ad9033", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfg39j/exterior_door/", "html_title": ""}
{"title": "Ripping out Bath Fitter, back to tub & tile?", "selftext": "New condo was Bath Fitted by last owner in 2009. Still functional but tub floor is showing its age with a bunch of tiny little lines that make it look dirty. \"Tile\" overlay looks really cheap, too, like plastic. I'd just as rather have the real thing. I suspect the original stuff from 1982 is still behind all that white stuff but I don't know what exactly is involved in reverting to it, or if it's even possible. Any of you able to go back to the tub and tile that Bath Fitter overlaid, or did you have to redo the original with new tub and tile immediately? I'm prepared to wait if I have to for a one-shot rip-n-replace, but I do want to have it right eventually and get rid of the cheap, ugly Bath Fitter.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffz6z/ripping_out_bath_fitter_back_to_tub_tile/", "created_utc": 1746462547.0, "score": 1, "author": "TheJokersChild", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kffz6z/ripping_out_bath_fitter_back_to_tub_tile/", "html_title": ""}
{"title": "21x13ft deck inside retaining wall area", "selftext": "Wanting to build a 21x14ft deck walking into my house. We have an entrance before you walk into the house where we have a retaining wall kinda enclosing the entrance. Right now it’s nothing but weeds and was going to just put rocks but might go bigger. Since I currently have a walkway and a concrete small step up before I walk into the house it’s only 6inches off the concrete there. \nI really wanted to have it flushed with the walk into the house. It’s going to be low profile so I planned on either using the concrete blocks or those new tuffblocks.  Need all the help I can get. Plan on doing this myself. Have all the tools I need for the job as well. \nCrazy question but would I need to strip the boards to be even all around? \n\nAnother question. Since it’s a larger deck how would you go about laying the boards out? Andwhat length of boards with you go with? ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffyc8/21x13ft_deck_inside_retaining_wall_area/", "created_utc": 1746462489.0, "score": 1, "author": "LimitedX2020", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kffyc8/21x13ft_deck_inside_retaining_wall_area/", "html_title": ""}
{"title": "Need attic access, does it have to be permanent?", "selftext": "I've got a first floor room that is partially covered by a small attic, and partially by the second story room. There is no access hatch in the ceiling. There is no access hatch in the wall of the upstairs room. I suspect a ceiling access did exist at one time, but I don't know for sure. I need to get in there to air seal and add insulation.\n\n[Outside View](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F41qlulawhzye1.png)\n\n[Inside View 1](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F2lo8qdn7izye1.jpeg)\n\n[Inside View 2](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Ftmnws52bizye1.png)\n\n\nMy plan is to cut through the ceiling drywall between two joists. I can squeeze my fat ass up there between two joists, crawl around to do what I need to do, and hopefully squeeze back out without making too big a mess. Making a hatch in the upstairs wall is not an option due to a bathtub being on that wall exactly where the access would need to be cut. Also, that window is right above where the hatch would need to be, too.\n\nSince this is an attic space with no current access, do I need to make the new access hatch in the ceiling permanent or can I seal it back up with drywall the way it is now?\n\nIf it does have to be a permanent access hatch, is there a standard size? The access hatch in the full second floor attic is larger than I plan on cutting. It spans the space between three joists with a framing box around it. If I have to keep permanent access, does it have to be this wide? Or can I skip having to cut and block off one of the joists to make a wider hole?\n\n\nSome details that may or mat not be important:\n\n* Climate zone 5\n* built in the mid 1970s\n* This is not an add-on room. The basement matches the first floor, and the entire first floor external is stone.\n* There are existing external attic vents on the roof overhangs for this attic space.\n* Yes, I am aware of the rules regarding insulation and chimney. I plan on blocking insulation off about 6 inches back from the chimney and air sealing the chimney with mortar.\n* Yes, I'm absolutely sure this needs to be done. The house had an ice dam problem in the winter. I'm air sealing all attic spaces. That room in particular is extremely drafty and cold in the winter. I recently added a cat5 drop on the external wall and I could feel rapid air moving. I want to see what (if any) improvement air sealing and adding attic insulation does first, but I may eventually end up paying a crew to get all external wall foamed.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffw7p/need_attic_access_does_it_have_to_be_permanent/", "created_utc": 1746462349.0, "score": 1, "author": "Qordis", "num_comments": 3, "permalink": "/r/HomeImprovement/comments/1kffw7p/need_attic_access_does_it_have_to_be_permanent/", "html_title": ""}
{"title": "Replacing water-damaged shower studs", "selftext": "I’m currently working through a DIY full-bathroom renovation, and have removed the walls down to the studs. Before installing a new shower, I am trying to figure out what I need to do to address the water-damaged studs behind the old shower walls.\n\nPictures: https://imgur.com/a/AWmMdv3\n\nSome details:\n* The house is located in the north-east United States, and was built in the 50s. The bathroom is located directly on top of a concrete slab.\n* The old shower was tiled directly on top of the wall, which did not appear to be waterproofed at all.\n* The shower has not been used in over a year and a half, so while past water damage is apparent, everything should be very dry.\n* Jamming a screwdriver into the more damaged areas, I can get it about 1/8-1/4” into the stud.\n\nMy questions:\n* Do these studs need to be removed, or can they be simply treated and left as-is (I saw in other threads that a special mold-killer can be used)?\n* From reading elsewhere, addressing partially-damaged studs is easy enough: cut out the damaged portion, cut and put in a replacement piece, and add reinforcement to each side. Is this sufficient?\n* How would I go about replacing the bottom plates? I’ve read that for load-bearing walls, I’d either need to build a temporary wall and install it parallel to the wall to be removed, or otherwise jack up the ceiling. Is this necessary here (and how do I tell if a wall is load-bearing)? Or is there an easier approach?\n", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffujr/replacing_waterdamaged_shower_studs/", "created_utc": 1746462238.0, "score": 1, "author": "ServantOfTheLight", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kffujr/replacing_waterdamaged_shower_studs/", "html_title": ""}
{"title": "Mold and Water Damage On Baseboards in Basement", "selftext": "Hi everyone! Hope all is well!\n\nI was vacuuming my basement and noticed mold and apparent water damage to my baseboards. We had this before as well, but we took apart the flooring and then redid the baseboards etc. We thought the leak was from outside the house as there was a spot in my yard which would lead the water back to the house but I guess this isnt the case. Not sure what to do at this point and how to fix this. My kitchen upstairs is directly above this spot ( I think) which may also be causing water to drip through- then again not sure. \n\nAny help or recommendations would greatly be appreciated! Also, is this mold toxic? How severe is it?\n\nThank you all!\n", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffldw/mold_and_water_damage_on_baseboards_in_basement/", "created_utc": 1746461637.0, "score": 1, "author": "craftyonem", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kffldw/mold_and_water_damage_on_baseboards_in_basement/", "html_title": "Reddit - The heart of the internet"}
{"title": "How to determine if drainage, or \"decorative\" rocks?", "selftext": "My husband and I recently purchased a house and in the back along the foundation is lined with bricks about a foot out and then the area was filled with rocks. \n\nI'm just wondering how to determine if the rocks are decorative and I could plant in those areas or if the rocks are for drainage instead and I should leave them alone? \n\nNever been a home owner before. The rocks are not on the sides of the house just in the front and back of the house.", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffkzp/how_to_determine_if_drainage_or_decorative_rocks/", "created_utc": 1746461611.0, "score": 1, "author": "FoolishAnomaly", "num_comments": 4, "permalink": "/r/HomeImprovement/comments/1kffkzp/how_to_determine_if_drainage_or_decorative_rocks/", "html_title": "Reddit - The heart of the internet"}
{"title": "Replacing Drywall Questions", "selftext": "A mold issue from a shower leak caused us to have to demo the bottom two thirds of one of our walls in the bedroom. The wall is roughly 5 ft wide (next to a closet that’s unaffected) and 8 ft tall. My husband has put up new drywall once before a long time ago in like a shed or something, and I’ve never drywalled, but we’re both capable diyers. One weird thing too is that the previous drywall was two 3/8” drywall pieces on top of each other. No idea why. \n\nWould it be more difficult to just replace the affected part we’ve already demoed and have to try to match the finish to the top of the wall, or should we demo and replace the whole wall so the finish doesn’t have to be as close? The wall meets up to an interior wall that has a weird mesh like corner bead for some reason, and the other side meets up to a door frame on that wall where the closet is (and the closet opening goes to the other end of the wall).\n\nWould it be difficult to finish where it meets the door frame, or where it meets the ceiling? Right up to the corner bead on the interior corner needs replacing either way. If we do demo the whole wall, should we leave an inch or two between where we demo and the door frame or the ceiling? To me this seems the best route to make any difference in finish as least noticeable as possible, but am I missing something? \n\nAlso, any ideas on how much it might cost if we were to just hire someone to replace the wall for us? The demo is/would already be done, and we’re in a low cost of living area in Michigan. Thanks in advance!", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kffc9e/replacing_drywall_questions/", "created_utc": 1746461028.0, "score": 1, "author": "Hot-Yak-5222", "num_comments": 0, "permalink": "/r/HomeImprovement/comments/1kffc9e/replacing_drywall_questions/", "html_title": "Reddit - The heart of the internet"}
{"title": "Complete house renovation in San Diego", "selftext": "Hi everyone! After years of saving, I've finally decided to move on with a complete house renovation for my old (1970) house in San Diego. And when I say total, I mean from A to Z\n\nI've got a decent budget set aside (turns out those boring index funds my dad wouldn't shut up about actually did something useful over the last decade - who knew :)). But San Diego prices are well, San Diego prices. Everything is so insanely expensive here it's unbelievable. I don't wanna fuck it up cuz it's a very heavy investment. My main goal is to make a complete renovation with modern stuff, but don't lose the vibe of a proper SD house.\n\nAnyone here done major renovations in San Diego specifically by any chance? Looking for contractor recommendations, permit nightmares to avoid, and realistic timelines. Also any general tips are highly welcomed. \n\n\n\nAppreciate it and have a nice week!", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfd4qz/complete_house_renovation_in_san_diego/", "created_utc": 1746455669.0, "score": 123, "author": "Sea_Leopard3953", "num_comments": 11, "permalink": "/r/HomeImprovement/comments/1kfd4qz/complete_house_renovation_in_san_diego/", "html_title": "Reddit - The heart of the internet"}
{"title": "What Home Essentials would you buy if you were to start from 0? e.g. things that give a lot of value in terms of longevity or multiple-usage.", "selftext": "Context: I am moving out into my own place for the first time since being a student and i have the chance to buy my own possessions to use at my new home. \n\nWould love to know what are the home essentials that people are buying to ensure 1. I only need to buy once, 2. I am buying things that have multiple uses (like those screwdriver toolkits that do everything instead of buying multiple different tools) ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjn9g/what_home_essentials_would_you_buy_if_you_were_to/", "created_utc": 1746471232.0, "score": 4, "author": "vkkt", "num_comments": 15, "permalink": "/r/HomeImprovement/comments/1kfjn9g/what_home_essentials_would_you_buy_if_you_were_to/", "html_title": "Reddit - The heart of the internet"}
{"title": "Septic is failing within city limits. Quoted $30k to hook up to city ? Waiting on 3 more quotes.", "selftext": "Could this even be real? I am blown away. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kf04eu/septic_is_failing_within_city_limits_quoted_30k/", "created_utc": 1746409262.0, "score": 88, "author": "Munchr272", "num_comments": 109, "permalink": "/r/HomeImprovement/comments/1kf04eu/septic_is_failing_within_city_limits_quoted_30k/", "html_title": "Reddit - The heart of the internet"}
{"title": "How bad are the cheap manually retractable awnings on Amazon?", "selftext": "I've looked at Sunsetter, Marygrove, etc awnings with the motors and sensors, but they're out of my budget for now. I see a bunch of under-$500 hand-retractable awnings on Amazon. I'm assuming this is cheap crap, but the reviews aren't as bad as I would have thought. Anyone ever used these? How long do they last, and are they worth it at all?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfc3cp/how_bad_are_the_cheap_manually_retractable/", "created_utc": 1746452978.0, "score": 9, "author": "macnfleas", "num_comments": 6, "permalink": "/r/HomeImprovement/comments/1kfc3cp/how_bad_are_the_cheap_manually_retractable/", "html_title": "Reddit - The heart of the internet"}
{"title": "About to dig 2.5 tons of gravelly dirt for a fire pit area. What should I expect?", "selftext": "It’s been raining for a week so now’s the time to dig. Plan is to spend all day digging and wheelbarrowing to a 3 inch depth so I can put down weed barrier and pea gravel (I’d be buying in bulk, which is why I know how much the dug out ground will weigh).  \n\nWhat can I do to prepare my driveway? (tarp under? Tarp over? There will be too much material to use a tarp?) What other challenges might I expect?  \n\nHow easy/difficult will it be to get someone to take the unwanted material from the front yard?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfdsr9/about_to_dig_25_tons_of_gravelly_dirt_for_a_fire/", "created_utc": 1746457329.0, "score": 6, "author": "UtterDisgrace", "num_comments": 13, "permalink": "/r/HomeImprovement/comments/1kfdsr9/about_to_dig_25_tons_of_gravelly_dirt_for_a_fire/", "html_title": "Reddit - The heart of the internet"}
{"title": "What's the best method for waterproofing plywood under concrete?", "selftext": "We are remodeling our pool deck that's going to be 2.5\" concrete poured over a plywood base. Originally the plan was to treat the wood with sealant and then also lay plastic sheeting over it for an additional barrier. However, the person doing the concrete has advised that it's not a good idea to pour on top of the plastic because it will heat up the concrete and cause it to crack while it's drying.\n\nMy contractor says the sealed plywood should be fine, and offered to also add a paper-based layer if I want. But I'm still worried that the eventually water might get through and rot the plywood.\n\nIs there a better way to do this that my contractor isn't aware of or is just treating the plywood with sealant really the best way to go?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfix7s/whats_the_best_method_for_waterproofing_plywood/", "created_utc": 1746469495.0, "score": 3, "author": "nelisan", "num_comments": 14, "permalink": "/r/HomeImprovement/comments/1kfix7s/whats_the_best_method_for_waterproofing_plywood/", "html_title": "Reddit - The heart of the internet"}
{"title": "Fuse keeps blowing", "selftext": "This issue has gotten worse over the 3 years we have lived in the house.\nTwo bedrooms in my house are connected to the same breaker. My house has no central air so window units are what we use during the summer. We used to be able to have the unit in our room going all day for months with no issues, but now it’s gotten to where even plugging it in blows the fuse.\nI’m not sure what to do to fix this as it gets really muggy and hot in the house if we can use it.\nI can’t afford to have an electrician come look at it. \nAny help would be appreciated. House was build in 1913 in PA. ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfe9np/fuse_keeps_blowing/", "created_utc": 1746458472.0, "score": 4, "author": "dalliecat", "num_comments": 10, "permalink": "/r/HomeImprovement/comments/1kfe9np/fuse_keeps_blowing/", "html_title": "Reddit - The heart of the internet"}
{"title": "Cat Door Staircase Conundrum", "selftext": "Hi all, I'm hoping for some ideas. We just had new doors installed in our house; one at the top of our basement stairs, which do not have a landing (https://imgur.com/a/VH5hLdf). Our contractor put a cat door in for us, but it had to be installed high up in that decorative panel area so it didn't mess with the integrity of the door. Unfortunately, this makes the cat door unusuable--especially for my arthritic cat. Had I known this limitation before, we wouldn't have gone this route (I wasn't there when it was put in).\n\nSo, any ideas for something creative I could do to provide a platform, ramp, or way of getting to the door more easily? I'm thinking of a carpeted platform that's corner shaped, starts where the hinge side of the door meets the basement wall, and comes out to meet the opposite edge of the cat door, positioned right at the bottom of it. That way they can jump from the top step to the platform and come out, and it's out of the way for people going up and down. \n\nAny ideas--explained to me like I'm a toddler--are much appreciated", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfjo01/cat_door_staircase_conundrum/", "created_utc": 1746471281.0, "score": 2, "author": "BuffyTheEggPileLayer", "num_comments": 1, "permalink": "/r/HomeImprovement/comments/1kfjo01/cat_door_staircase_conundrum/", "html_title": "Reddit - The heart of the internet"}
{"title": "Floors before walls or walls before floors?", "selftext": "I am moving in to my first home. Want to get the floors sanded, stained and poly’d and the walls painted before moving in. What is the correct order to do this in and why? Thanks! ", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kfeog8/floors_before_walls_or_walls_before_floors/", "created_utc": 1746459453.0, "score": 3, "author": "bosoxrox24", "num_comments": 7, "permalink": "/r/HomeImprovement/comments/1kfeog8/floors_before_walls_or_walls_before_floors/", "html_title": "Reddit - The heart of the internet"}
{"title": "Should I install Rockwool Safe n' Sound throughout the entire interior of my new build?", "selftext": "So I've heard a lot of great things about Rockwool, but I'm unsure if it would be practical to install between every interior wall and in between the floors of my entire house.\n\nWe have a 2-story ranch style house with a U-shaped staircase down to the basement. The staircase does not have a door at the top or the bottom (open concept design). Would it be an acceptable idea to put rockwool between the entirety of the ceiling in the basement or not since sound would just travel up the staircase anyways? Or should I just focus on insulating the bedrooms/laundry room areas with Rockwool?", "url": "https://www.reddit.com/r/HomeImprovement/comments/1kf2lhm/should_i_install_rockwool_safe_n_sound_throughout/", "created_utc": 1746417506.0, "score": 23, "author": "Beezer_MB", "num_comments": 30, "permalink": "/r/HomeImprovement/comments/1kf2lhm/should_i_install_rockwool_safe_n_sound_throughout/", "html_title": "Reddit - The heart of the internet"}
