{"title": "From Scratch!", "selftext": "Hey all. I've recently started food storage preparation. Right now I'm working on about a 6 month(maybe too far ahead? I don't know) food preparation stash. The first item that made sense to me was storing flour, sugar, salt, water. This is as far as I got today because I was looking at how to properly store it.\n\nI found keeping flour air tight and in a cool and dry spot would be good. Since I have a good sized pantry I'll be starting off my food storage there.\n\nMy concern mostly is what are the essential food items I should focus on first? For some reason I felt flour would be the most expensive. So I got 36 lbs. Now I gotta save up and get to the item. What should I be getting next? I was thinking rice maybe?\n\nAny thoughts and constructive criticism is always appreciated", "url": "https://www.reddit.com/r/FoodStorage/comments/t3xrz3/from_scratch/", "created_utc": 1646104353.0, "score": 8, "author": "None", "num_comments": 7, "permalink": "/r/FoodStorage/comments/t3xrz3/from_scratch/", "html_title": "", "top_comments": ["The most useful food storage will be stuff you already know how to cook and use often. For example, my food storage has all the ingredients for my favorite crockpot recipe in multiples. \n\nBuy some extra pasta and sauce or a few extra cans every time you go to the store. You'll be amazed how quickly it builds up. \n\nAlso wheat stores longer than flour. You're ok with the flour you have but as you're using it, I would recommend replacing it with wheat. \n\nI'm proud of you! That's a lovely goal and I'm cheering for you ☺️", "I always feel like you should have 3 months worth of your normal daily eating patterns. I think that is the most important. If you have children, they can develop what is called food depression if they are, or conditions require the use of food storage. That way you can slowly make the necessary changes to the food prepared. After that, I focused, or focus on long term storage items like wheat, beans, rice, sugar in 5 gallons buckets tightly sealed with oxygen absorbers, and labeled with item and date stored. After that, I have gone to freeze dried prepared meals. They are expensive, but last 30 years, and are a really good starter for a meal that might include items from your long term food storage. With all that is going on in the world right now, and governments not doing what is in the best interest of the citizens, we need to plan and prepare for ourselves. I am also acquiring, or have been acquiring medical/first aid supplies.", "Ok so... flour has a bug called boll Wevel. If storing flour for an extended amount of time you want to make sure there are no bugs in the flour. I freeze my flour for 2 weeks to kill off any bugs that might be in the bag. Then store in airtight cool dark place.\n\nI started with dry goods first. Noodles, dry beans, oats, powdered milk, things with a high nutrient count and that preps with mainly water.", "Get some canned tomatoes for a soup base."]}
{"title": "POTATOES!!! How can I prevent my potatoes from growing sprouts? And does it effect the taste and quality of the potatoes?", "selftext": "", "url": "https://i.redd.it/i89tjhacpje81.jpg", "created_utc": 1643426540.0, "score": 8, "author": "kadeska233", "num_comments": 5, "permalink": "/r/FoodStorage/comments/sf8np6/potatoes_how_can_i_prevent_my_potatoes_from/", "html_title": "", "top_comments": ["Sprouts are safe to eat. They don't affect the quality of the potato themselves, but they are more likely the older the potato gets so check for soft/brown spots. (You can cut out the spots and eat the rest.) You can just snap the sprouts off and then use the potato like usual.\n\nThe best way I know to keep them from sprouting is to store them in pitch blackness as close to 55F as possible. When I was a kid (grew up on a farm) we stored ours in the well pit, so they were about 8 feet underground and only saw light when we opened the pit cover to get them. They'd go six months without sprouting some years.", "[deleted]", "My grandfather would grab one potato and knock the sprouts off the others in his basement... he kept about 20 beer flats full every year and they kept through next harvest... with dirt left on.", "Pull of the sprouts anytime you see them"]}
{"title": "Mason jar vacuum sealer", "selftext": "Hey folks! I have recently purchased a mason jar vacuum sealer and I have a question/need some advice. \n\nI have some food products that are sold in the dry goods section at the store, but state to \"refrigerate after opening\" on the package. (I.e. ground flax seed, raw nuts, hemp hearts, etc). I have a small fridge and storing all these items in the fridge would take away from space I would like to store frequently used and *need* refrigeration items. Ya know?!\n\nSO... what I'd like to do is open these bags, fill sterilized mason jars, immediately vacuum seal and then put back on the shelf... Thus only smaller amounts of said products require space in my fridge 😅\n\nWhat are your thoughts? Is this something that can be or should be done??", "url": "https://www.reddit.com/r/FoodStorage/comments/17q7wec/mason_jar_vacuum_sealer/", "created_utc": 1699399920.0, "score": 6, "author": "JaeTea123", "num_comments": 1, "permalink": "/r/FoodStorage/comments/17q7wec/mason_jar_vacuum_sealer/", "html_title": "", "top_comments": []}
{"title": "Teaching food storage to friends and neighbors", "selftext": "I am working on a project to teach friends and neighbors how to do long term food storage. The idea is to have one bucket be 2 to 3 week supply for a family of 4. The buckets could be a learning opportunity and start to a larger food supply, or given away to families in a time of need. My plan is to put various dry goods in one gallon zip lock bags and put the zip lock bags in a bucket lined with a mylar bag and seal it all up with o² absorbers inside.  The dry goods would consist of rice, beans, oats, pasta.  Would those items be ok stored together? If there is room in the top of the bucket I could also add a small bag of sugar, salt, olive oil and some spices that could be stored for a shorter period of time. I would love some feed back on this.", "url": "https://www.reddit.com/r/FoodStorage/comments/txvxdk/teaching_food_storage_to_friends_and_neighbors/", "created_utc": 1649278259.0, "score": 6, "author": "Dramatic-Ad-7067", "num_comments": 1, "permalink": "/r/FoodStorage/comments/txvxdk/teaching_food_storage_to_friends_and_neighbors/", "html_title": "", "top_comments": ["A realize that this was posted a long time ago, but I’m curious as to what you decided to do. I think it would be better to just store the dry ingredients in their own mylar bags. You can get them in a variety of sizes. Even small enough for spices."]}
{"title": "Hair growth spray containing aloe vera? How would i store it?", "selftext": "New to the group! I’ve never grown aloe vera before or have even worked with it. From my understanding, aloe vera gel has a max shelf life of 1 week, and a max refrigerated life of 1 month. I’m creating a recipe for loc spray/dreadlock spray for my small business. Ideally, I want to create a leave-in product that you can spray in your hair/locs like a mist and leave it to dry without having to wash it out, or build up. I would like for refrigation to not be required; convince and storage wise. I plan my recipe to consist of; 1/2 distilled rose water, 1/4 aloe vera (gel?), and 1/4 my current oil mixture.\n\n1.  How can I extend the shelf life of the aloe vera rose water mixture without necessarily having to refrigerate? \n\n2. I’ve read about vitamin E oil as a natural preservative for aloe vera gel. What parts of what would be the minimum to extend shelf life? Like 1 parts aloe vera gel:1 parts vitamin E oil? \n3. I want it to be a leave in hydrator, so would I need any of type of preservative(s)?\n\n3. Would storing in a glass container vs a plastic PEL bottle be better? Would the PEl bottles need to be sterilized in a PC/autoclave before or would airtight suffice?", "url": "https://www.reddit.com/r/FoodStorage/comments/161qfi7/hair_growth_spray_containing_aloe_vera_how_would/", "created_utc": 1693041934.0, "score": 4, "author": "thatstonergirl200005", "num_comments": 1, "permalink": "/r/FoodStorage/comments/161qfi7/hair_growth_spray_containing_aloe_vera_how_would/", "html_title": "", "top_comments": ["Hi! Have you ever gotten any answers for this? I’m looking to do the same for personal use. Currently my rosemary, rose, aloe and rice waters are in the freezer until I can figure this out. Thanks for any advice you may be able to provide!"]}
{"title": "Enemies Of Long-Term Food Storage & Calculation Formula for Long Shelf Life", "selftext": "We discuss the enemies of long-term food storage and provide you with a formula to calculate the shelf life of your stored foods. \n\n[https://www.safecastle.com/blogs/safecastle-blog/5-enemies-of-long-term-food-storage-how-to-protect-your-food-supply](https://www.safecastle.com/blogs/safecastle-blog/5-enemies-of-long-term-food-storage-how-to-protect-your-food-supply)", "url": "https://www.reddit.com/r/FoodStorage/comments/12jub39/enemies_of_longterm_food_storage_calculation/", "created_utc": 1681323638.0, "score": 4, "author": "safecastle_", "num_comments": 0, "permalink": "/r/FoodStorage/comments/12jub39/enemies_of_longterm_food_storage_calculation/", "html_title": "", "top_comments": []}
{"title": "A question about Azure Standard", "selftext": "My nearest drop location is almost 4 hours one way from my home. Does anyone have experience using the shipping option, specifically as it relates to perishables. Do they pack them well? Are icepacks etc used? \n\nThank you for any insight you may have.", "url": "https://www.reddit.com/r/FoodStorage/comments/xp50kj/a_question_about_azure_standard/", "created_utc": 1664248903.0, "score": 5, "author": "Autumn142", "num_comments": 2, "permalink": "/r/FoodStorage/comments/xp50kj/a_question_about_azure_standard/", "html_title": "", "top_comments": ["You might consider starting a drop off your own.  Just call them and see what is involved.", "I would see if you could make your own drop. Azure keeps the food on refrigerated trucks with a special compartment for frozen foods. You would need to bring your own cooler or ice chest to keep things cold for the ride home."]}
{"title": "Are Mylar bags really necessary if you already have a bucket?", "selftext": "The expenses can really add up with the food and buckets so I’m a little hesitant to get Mylar bags for my food.  Thanks for the help.", "url": "https://www.reddit.com/r/FoodStorage/comments/tw63lk/are_mylar_bags_really_necessary_if_you_already/", "created_utc": 1649089313.0, "score": 3, "author": "RE_trophyhunter", "num_comments": 1, "permalink": "/r/FoodStorage/comments/tw63lk/are_mylar_bags_really_necessary_if_you_already/", "html_title": "", "top_comments": ["They are necessary if you’re using O2 absorbers, because you won’t get a good enough seal with just the bucket. They should also help control the smell of the food being stored, decreasing the chances of attracting rodents."]}
{"title": "Food packaging, vaccum sealing, heat sealing food", "selftext": "Can anyone tell me what type of packaging this is and how to achieve it at home? I can't seem to find it online", "url": "https://www.reddit.com/gallery/17nfq0h", "created_utc": 1699079755.0, "score": 3, "author": "Aggravating_Heat2853", "num_comments": 1, "permalink": "/r/FoodStorage/comments/17nfq0h/food_packaging_vaccum_sealing_heat_sealing_food/", "html_title": "", "top_comments": ["[Food packaging](https://www.insights.inflavourexpo.com/active-and-intelligent-smart-packaging-for-f-b-efficiency/?utm_source=reddit&utm_medium=affiliate&utm_campaign=inflavour23)"]}
{"title": "Question.", "selftext": "Can a silica gel pack be used with dehydrated food?", "url": "https://www.reddit.com/r/FoodStorage/comments/177tajq/question/", "created_utc": 1697300871.0, "score": 3, "author": "None", "num_comments": 6, "permalink": "/r/FoodStorage/comments/177tajq/question/", "html_title": "", "top_comments": ["Yes. That’s the optimum use for it.", "I made some homemade curry powder that's OK with gel packs , too. Right?", "Absolutely! For best freshness, you should consider vacuum sealing a silica gel with a high barrier material for your food. This takes out any remaining oxygen that can also cause long-term storage issues. DM me if you want to learn more."]}
{"title": "My brother left me all of these that my parents had canned. Sitting on top of a fridge for 2 maybe 3 years. Are they still good?", "selftext": "", "url": "https://i.redd.it/f3fs38cf7w5b1.jpg", "created_utc": 1686708866.0, "score": 3, "author": "Welllllllrip187", "num_comments": 5, "permalink": "/r/FoodStorage/comments/148vwoe/my_brother_left_me_all_of_these_that_my_parents/", "html_title": "", "top_comments": ["The ones that appear to be a little murky may be suspect but honestly, they're likely fine. You'll know when opening if something is off. What a great treat for you! Someone took care, time, and trouble to can these items.", "[removed]"]}
{"title": "How do you prevent strawberries that come in plastic containers from going bad ? Do you clean them before placing them in the fridge and how ?", "selftext": "", "url": "https://i.redd.it/0akid6yx9bwa1.jpg", "created_utc": 1682532829.0, "score": 3, "author": "Schila1964", "num_comments": 6, "permalink": "/r/FoodStorage/comments/12zscon/how_do_you_prevent_strawberries_that_come_in/", "html_title": "", "top_comments": ["The ones that go bad first are usually toward the bottom. I take them all out and look for ones that are turning bad and remove them before they can spoil the others. I don’t wash them till it’s time to eat them.", "Your post was 3 months ago but it's still berry season so I'll chime in. \n\n\r  \nThe best way I have found to store strawberries (any berries, really) is to rinse with (5% vinegar + water solution), and store them in an air-tight container with folded paper towels on the bottom (trading out the paper towels every couple of days). \n\n\r  \nThere are airtight containers that are supposed to keep greens, veggies, and fruit fresher, longer but I haven’t tried them, yet.", "I’ve heard a lot of people doing a water and vinegar rinse (not sure the ratio) for a few minutes and then letting them dry and then storing them in an air tight container. I’ve heard this helps them last a lot longer. I’ve also heard of lots of people doing baking soda too because most pesticides are acidic. \nSorry not super helpful but hopefully puts you in the right direction! \nSamm\nstoragechef.com"]}
{"title": "Storing wheat gluten", "selftext": "I have been making seitan to get lean protein, and to get a good price on wheat gluten I purchased a bag of 25kg.\n\nNow that it has arrived, I realize I haven't thought this through; should I be able to seal the bar airtight again after opening? This bag will last me a year (taking out about 500 grams each week). \n\nCan I just keep it in a closet on room temperature and seal it with some strips?", "url": "https://www.reddit.com/r/FoodStorage/comments/11gx2om/storing_wheat_gluten/", "created_utc": 1677838252.0, "score": 3, "author": "Pegasus9208", "num_comments": 2, "permalink": "/r/FoodStorage/comments/11gx2om/storing_wheat_gluten/", "html_title": "", "top_comments": ["Have you considered getting smaller Mylar bags and putting a week’s or month’s worth in each?", "breaking up the large container into more manageable portions is a good idea. Depending on the type of bag you might be able to reseal after a few times, but will probably run into issues long term. I tend to break up large shipments of rice or powders into Mylar bags like:\n\n[https://www.amazon.com/dp/B09NRZT65T](https://www.amazon.com/dp/B09NRZT65T)\n\nThey fit well in my 5 gallon pail and give me enough headroom to cut open under the sealed section, and have more room for a new seal underneath. Either way if you are worried about the long term storage of the powder I would use some oxygen scavengers to try and limit how much air can leak in even with an older bag."]}
{"title": "Im building my stockpile and this is the first time i need to store diary can how do i do this?i have oxygen absorbers.im just intimidated that is dairy and i won’t do it properly i dont have a vacuum sealer yet", "selftext": "", "url": "https://i.redd.it/ulw3klopzyka1.jpg", "created_utc": 1677589779.0, "score": 3, "author": "Llaidiliet", "num_comments": 3, "permalink": "/r/FoodStorage/comments/11e5o09/im_building_my_stockpile_and_this_is_the_first/", "html_title": "", "top_comments": ["For buttermilk powder, I buy mine in bulk and seal in Mylar bags. For a small container like that, I would just pop that in the freezer, or transfer into small Mylar bag. For other dairy, I buy Morning Moos for drinking and cereal and powdered milk for baking and cooking with. Both come in large cans so they stay shelf stable for a long time."]}
{"title": "How should I store burger meat from the store?", "selftext": "I bought a pack of 4 fresh burger beef patties but only need to make 2. Is it ok to just re-wrap the other 2 with plastic wrap or should I use something more tightly sealed like a tubberware? I’m just worried the raw meat will go bad since I already removed its original plastic seal", "url": "https://www.reddit.com/r/FoodStorage/comments/zn24ae/how_should_i_store_burger_meat_from_the_store/", "created_utc": 1671152967.0, "score": 3, "author": "clarisssssaa", "num_comments": 2, "permalink": "/r/FoodStorage/comments/zn24ae/how_should_i_store_burger_meat_from_the_store/", "html_title": "", "top_comments": ["So I would use those up in a couple of days fresh to avoid any ickyness. If you’re going to freeze them I’d plastic wrap them and then put them in a ziplock or freezer bag and pop them into the freezer", "As long as you eat the rest in a few days it should fine. I often buy more than I need and season the meat and make a bunch of burgers all at once. I individually wrap each burger in plastic wrap and freeze them until it's time to cook another one.\n\nKevin Garce from Food Storage, Choices and Alternatives"]}
{"title": "How To: Make Delicious Beef Jerky in a Food Dehydrator", "selftext": "", "url": "https://www.youtube.com/watch?v=d8GiRstHjVY", "created_utc": 1661567930.0, "score": 3, "author": "Accomplished-Yam2766", "num_comments": 0, "permalink": "/r/FoodStorage/comments/wyre0p/how_to_make_delicious_beef_jerky_in_a_food/", "html_title": "How To: Make Delicious Beef Jerky in a Food Dehydrator - YouTube", "top_comments": []}
{"title": "Seeking advice for a freezer chest, 40 inches wide, quiet, reliable", "selftext": "Hello, I am shopping for a freezer chest.  It should be about 40 inches wide, maybe less.  What are the best brands of freezer chest currently?  Any advice welcome.  Thank you!", "url": "https://www.reddit.com/r/FoodStorage/comments/ws3djr/seeking_advice_for_a_freezer_chest_40_inches_wide/", "created_utc": 1660879910.0, "score": 3, "author": "Personal_Style_8698", "num_comments": 1, "permalink": "/r/FoodStorage/comments/ws3djr/seeking_advice_for_a_freezer_chest_40_inches_wide/", "html_title": "", "top_comments": ["Most products on the market are all good. Some are better than others, but none are terrible. They will all keep your food frozen. We bought a second freezer this year, and it really came down to price, energy star ratings, and features."]}
{"title": "Should clementines be stored in the refrigerator or in a cabinet?", "selftext": "", "url": "https://www.reddit.com/r/FoodStorage/comments/vbr7q9/should_clementines_be_stored_in_the_refrigerator/", "created_utc": 1655168068.0, "score": 3, "author": "fitxa6", "num_comments": 2, "permalink": "/r/FoodStorage/comments/vbr7q9/should_clementines_be_stored_in_the_refrigerator/", "html_title": "", "top_comments": ["I’d think they would dry out faster outside of the fridge. I always keep my citrus in the fridge.", "I keep mine in a bowl in the counter. They're always in view and easy to grab one for a snack. They seem to be ok for about 10 days but they usually don't last that long."]}
{"title": "Canning Machine for Sale", "selftext": "Hey! I'm selling my canning machine, looking for $1,500 or best offer, it works great to store dry foods. [https://fargo.craigslist.org/for/d/fargo-all-american-canning-7502-can/7481156234.html](https://fargo.craigslist.org/for/d/fargo-all-american-canning-7502-can/7481156234.html)", "url": "https://www.reddit.com/r/FoodStorage/comments/ulgye6/canning_machine_for_sale/", "created_utc": 1652062540.0, "score": 3, "author": "terpcandies", "num_comments": 0, "permalink": "/r/FoodStorage/comments/ulgye6/canning_machine_for_sale/", "html_title": "", "top_comments": []}
{"title": "Long term rice storage and moisture", "selftext": "I am planning to store white rice in Mylar bags and 5g bucket for long term storage but I have been reading it’s important to only store it if it is less than 10% moisture. \n\nDo I just assume the rice I buy is less than 10% moisture? I there a way to check? I worry that the store bought rice is higher than 10% and then will spoil. \n\nThanks", "url": "https://www.reddit.com/r/FoodStorage/comments/tfkd4a/long_term_rice_storage_and_moisture/", "created_utc": 1647444929.0, "score": 3, "author": "None", "num_comments": 1, "permalink": "/r/FoodStorage/comments/tfkd4a/long_term_rice_storage_and_moisture/", "html_title": "", "top_comments": ["It wont be more than 10% moisture as sold in stores. If your home is extremely humid, I’d bag it up in mylar with some oxygen absorbers soon after you get it home."]}
{"title": "Water Storage", "selftext": "Does anyone have good documentation on the best way to store water in a 4 season climate? It would be in a basement, but if you have to bug out? Any water storage information would be greatly appreciated.", "url": "https://www.reddit.com/r/FoodStorage/comments/t9l9gm/water_storage/", "created_utc": 1646758575.0, "score": 3, "author": "justice4all1613", "num_comments": 1, "permalink": "/r/FoodStorage/comments/t9l9gm/water_storage/", "html_title": "", "top_comments": ["If you're bugging out in the freezing cold, you'll need to keep your daily drinking water in flasks and canteens on your body, under your warm layers, to keep it from freezing.\n\nIf you're not sure how much water you can put in a larger travel storage container (ie  without it rupturing or getting damaged due to freezing), figure that out now rather than during an emergency, and make note of how long it takes to thaw.\n\nAs for good documentation, go to your regional official \"72 Hour Preparedness\" site, read up on mountaineering techniques for water storage, and look up Dr. Giesbrecht at the University of Manitoba, who operates a lab studying heat and cold injuries and how to survive extreme environmental conditions: [https://en.wikipedia.org/wiki/Gordon\\_Giesbrecht](https://en.wikipedia.org/wiki/Gordon_Giesbrecht)"]}
{"title": "Ultimate freezer meal post", "selftext": "", "url": "/r/EatCheapAndHealthy/comments/s3wrsw/ultimate_freezer_meal_post/", "created_utc": 1644188870.0, "score": 3, "author": "malt_soda-", "num_comments": 0, "permalink": "/r/FoodStorage/comments/smahru/ultimate_freezer_meal_post/", "html_title": "", "top_comments": []}
{"title": "Rice storage - have I messed up?", "selftext": "I bought some rice in bulk a few months ago. I have left it in the bag (open) in my Pantry and scooping some into an airtight container of rice, in my kitchen cabinet, every month or so.\n\nThe bag that the bulk rice is in, has been left open - is the rice still okay to be eating?\n\nI mean it still looks good, tastes good, do I need to get a large airtight container for it too?", "url": "https://www.reddit.com/r/FoodStorage/comments/rxqth6/rice_storage_have_i_messed_up/", "created_utc": 1641508101.0, "score": 3, "author": "Retro_whale", "num_comments": 11, "permalink": "/r/FoodStorage/comments/rxqth6/rice_storage_have_i_messed_up/", "html_title": "", "top_comments": ["My family keeps it in the 20kg bag. Just make sure it's in a dry area where it is stored and not susceptible to temperature changes. Do you suspect animals or particles getting into it? Why do you think it is bad? How much time has it been sitting?\n\nThe best way to find out it is still good is cook some and try it! You say it tastes good so you should be good to go!", "I buy 20 lb bag of rice and store most of it in the deep freezer. Keeps out the weevils.", "I like the 5 gallon food grade bucket for these types of hard grains. Wheat, rice, beans, etc.", "I mean, that is kind of how they store it before shipping it out, so if the company that produces them doesn't have a problem with it, you probably won't.", "https://news.grainpro.com/how-to-prevent-rice-weevils-in-commodities", "I have a similar question -  I have uncooked white rice in 20 vacuum sealed quart size ball jars and have had them for about 10 years. They are basic long grain rice, nothing fancy or exotic.  \n\nThe vacuum seals are still intact and there are no signs of issues, but the storage conditions were not ideal (mice as well as outdoor temperatures) \n\nHow might I be able to tell if the rice is still safe and good to eat?  Is there anything I should do \"just in case?\" Any danger signs to look for? \n\nI want to taste to see but not if they might be just nasty or dangerous"]}
{"title": "TWOHeritage Survival Seed Vault 25 Year Storage Life Fruits Herbs and Vegetables", "selftext": "", "url": "https://www.ebay.com/itm/285564787026?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=hi3kdtbnq8e&sssrc=2524149&ssuid=hi3kdtbnq8e&widget_ver=artemis&media=REDDIT", "created_utc": 1700324302.0, "score": 2, "author": "Legal-Concentrate-97", "num_comments": 1, "permalink": "/r/FoodStorage/comments/17y9w13/twoheritage_survival_seed_vault_25_year_storage/", "html_title": "Heritage Survival Seed Vault 25 Year Storage Life Fruits Herbs and Vegetables for sale online | eBay", "top_comments": ["You might want to find out the growing zone of the seeds. They might not be for your area."]}
{"title": "Flour smell", "selftext": "Hi, I’ve got some flour I put into long term storage at the beginning of covid. It smells metallic. I put an o2 absorber and it was in Mylar. I’ve heard that flour takes surrounding smells very easily but it’s also around the proper time to start risking going bad. Is it bad or is this smell from the o2 absorber?", "url": "https://www.reddit.com/r/FoodStorage/comments/17n8prn/flour_smell/", "created_utc": 1699055528.0, "score": 2, "author": "mro2352", "num_comments": 4, "permalink": "/r/FoodStorage/comments/17n8prn/flour_smell/", "html_title": "", "top_comments": ["I just opened 25lbs of white flour I had in a mylar. It was zipped and heat sealed with oxygen absorbers. The bag was airtight when I pulled it out, but it smells metallic! The flour was purchased and placed in my deep freezer for a few days prior to storing. I think it originally had an 11/2024 expiration date. What in the world is going on?!"]}
{"title": "How to make this storage bin air-tight for dry goods and flours so that pests can't get in or out?", "selftext": "", "url": "https://i.redd.it/tv7beooetltb1.jpg", "created_utc": 1697043430.0, "score": 2, "author": "trippysushi", "num_comments": 3, "permalink": "/r/FoodStorage/comments/175izno/how_to_make_this_storage_bin_airtight_for_dry/", "html_title": "", "top_comments": ["Make silicone seals with 100% silicone caulk  I’ve waterproofed so many things with this method or make some sort of gasket, nowadays you can probably order custom ones look into it !!"]}
{"title": "Canned Cheese Shelf Life?", "selftext": "I know many canned goods store well way passed their stamped on date (depending on where they're stored and the condition of the can).  How long would a standard #10 can of nacho cheese from a regular grocery store keep for if unopened, undamaged, and in an optimal location?  ", "url": "https://www.reddit.com/r/FoodStorage/comments/16z39ya/canned_cheese_shelf_life/", "created_utc": 1696366692.0, "score": 2, "author": "zmaint", "num_comments": 1, "permalink": "/r/FoodStorage/comments/16z39ya/canned_cheese_shelf_life/", "html_title": "", "top_comments": ["I have had a small standard soup can of nacho cheese 2 years past its best-by date. That is also a lot of cheese goo. You might find smaller cans or powdered cheese a better option."]}
{"title": "Glass container questions", "selftext": "I’m probably gonna answer my own question here, but… Are glass container sizes measured by fluid ounces when it just says ounces in the description?\n\nI bought 34 ounce jars to put my 28 ounces of rice in… It did not fit. I’m guessing it’s because the glass containers are fluid ounces. If it’s something different please help me understand so I can get the right sizes for what I need in the future.\n\n Thank you.", "url": "https://www.reddit.com/r/FoodStorage/comments/16ybr1c/glass_container_questions/", "created_utc": 1696288387.0, "score": 2, "author": "FewEnvironment218", "num_comments": 1, "permalink": "/r/FoodStorage/comments/16ybr1c/glass_container_questions/", "html_title": "Reddit - The heart of the internet", "top_comments": ["It’s fluid ounces yeah, unless your rice is perfectly compact it wouldn’t fit"]}
{"title": "Glass Container for Sandwiches", "selftext": "I've been meal prepping sandwiches for lunch for several months now and have been using gallon ziplock bags. I want to eliminate the expense and waste by switching to **glass** food storage containers, but I cannot find any that fit the purpose.\n\nI am looking for a large borosilicate glass container with vertical sides that can store 8 standard square sandwiches. From a reputable brand (no Chinese nonsense brands from Amazon).\n\nIts very difficult because all of the large containers I've seen are too shallow and have flared sides that serve no purpose and take up twice as much space for no reason.  \n\nDoes such a container exist? I greatly appreciate the help!", "url": "https://www.reddit.com/r/FoodStorage/comments/16gdxpd/glass_container_for_sandwiches/", "created_utc": 1694482352.0, "score": 2, "author": "drapanosaur", "num_comments": 1, "permalink": "/r/FoodStorage/comments/16gdxpd/glass_container_for_sandwiches/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Hello! Did you ever find one? Having a hard time finding sandwich specific glass containers"]}
{"title": "foods that change when stored near other foods was how this post was supposed to go …", "selftext": "I’m new here to this sub, here are some scribbles of thoughts food storage related or adjacent, and also a unique take on culinary some of you may find interesting and i’d love to hear thoughts ….. \n\nI work in music as an recording and mixing audio engineer,  and culinary / cooking is the closest field i have ever felt to audio engineer.   a Chef refines his pallet over years of tasting and adjusting and researching history and the perfect time to pick ripe … the soil, the pH … uh, no need but there’s plenty more.  \n\nAn audio engineer does all these things using their ears as the primary sensory input.  sure in both fields, texture, weight, feel, balance … that’s all important to be great,  but to me, cooking and mixing music very much put me into what’s that word frisson? well, maybe not that, but i get in a transcendent work flow doing either.  \n\nWhat made me a good audio guy was study, prep, confidence, review, and repeat.    I bet it’s the same w high level chefs too, including the absolute murderous  grind and terrible pay the first several years.  \n\nhere’s my questions:  \n\n1.  people say don’t put bananas and tomatoes near each other because they release chemicals that spoil them faster.  truth? or false?   \n\n2. it is also said that onions and garlic and potatoes must all be kept separate and air tight, but dark in pantry is the best method?  I’ve heard paper bag out or in pantry,  but at the store they sell them in half plastic, half open air netting. same w onions.  and garlic.. i’ll make that a diff question. \n\n2a. garlic … i understand with the knife smash (blade away etc) and pop out the skin, i also know the bag method where you shake em like mad, but i always end up w bits of skin.   The pre peeled ones are expensive and unless you’re a jersey italian family , it’s just too many peeled to early and they taste funny.  \n\n3.  can i buy one of those 3 tier baskets and keep bananas and apples on top, tomatoes and something in the middle, and then root veggies at the bottom like potatoes and garlic.  I’ve heard of devices like plastic apples with a packet inside that helps keep produce, but i can’t tell if it’s working.   \n\n3a. what are crisper settings on the bottom two drawers on most fridges?\n\n4.  some foods we put in the fridge for obvious reasons (raw chicken / ice cream) … what foods don’t need refrigeration, also, which ones do and are sensitive about it\n… like avacados for example.  you buy 5. none were ripe the first day, then they all ripened faster than i can eat them, so i put near ripe ones in the fridge to slow it all down.   or if a strawberry is placed too close to the fridge vent and it freezes just a little, the whole thing is ruined.  \n\n4. alternatively, there are food prep kitchen containers that have a little drainage at the bottom and they airtight stack precut stuff or small items like strawberries or cherries.  there are also classic line cook stackables in plastic or metal.    like how can i cut all my fruits and veggies.  \n\n\n\ntl;dr:   what tips regarding hot/cold storage and access does food in our kitchens go for optimal storage and longevity.", "url": "https://www.reddit.com/r/FoodStorage/comments/13njlgf/foods_that_change_when_stored_near_other_foods/", "created_utc": 1684645758.0, "score": 2, "author": "sirCota", "num_comments": 0, "permalink": "/r/FoodStorage/comments/13njlgf/foods_that_change_when_stored_near_other_foods/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "(Hear me out) Help me lick peanut butter like a dog", "selftext": "I would like to carry \"emergency peanut butter\" around with me, with the lightest possible footprint. I want to be able to eat it without utensils and without a lot of waste.\n\n* **Any ideas?**\n* **Anywhere else I should ask this question?**\n\n&#x200B;\n\nI was thinking that a plastic bag would be awesome, but it's kind of hard to lick up all the peanut butter from something with so much surface area and such a small opening. It's tough for me even with a spoon.\n\nSo then I was thinking about maybe like a really shallow jar or tray-type thing with a lid that stays on well. Does that exist?\n\nOr if they had some bougie, durable, reusable version of those energy gel containers.\n\nOr some kind of plastic bag shaped like the letter \"D\" with a zipper that goes all the way around the curvy part of the \"D.\" It seems like that would be perfect because I could like open it all the way up and lick the peanut butter that way.", "url": "https://www.reddit.com/r/FoodStorage/comments/13n1aqg/hear_me_out_help_me_lick_peanut_butter_like_a_dog/", "created_utc": 1684604797.0, "score": 2, "author": "OpenParodies", "num_comments": 4, "permalink": "/r/FoodStorage/comments/13n1aqg/hear_me_out_help_me_lick_peanut_butter_like_a_dog/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Spoonful of peanut butter, inside of an un-inflated balloon, tied of with a recycled twisty tie around the stem of the spoon. Lube up and insert in butt. No one will have any idea, trust me.", "Look for something like this? https://www.amazon.com/Aluminum-Storage-Containers-Cosmetic-Candles/dp/B079CGP5GP/\n\nThere’s sites that sell empty containers for cosmetics, try looking there\n\n\nBtw, sounds weird at first, but kinda genius.\n\n\nhttps://www.berlinpackaging.com/tins/", "Look for Japanese sauce containers or reusable silicone baby food pouches."]}
{"title": "Food storage with interchangeble lids", "selftext": "hi everyone, \n\n&#x200B;\n\nI'm in the UK and looking for different sizes of food container that have interchangeable lids. Eg. Theey would be the same dimensions, except the depth.\n\n&#x200B;\n\nIt seems really simple (and would solve the problem of always losing lids) but I can't find anything anywhere.\n\n&#x200B;\n\nDoes anyone know somewhere i can get some? Thanks,", "url": "https://www.reddit.com/r/FoodStorage/comments/12oeeen/food_storage_with_interchangeble_lids/", "created_utc": 1681660238.0, "score": 2, "author": "2istheoddestprime", "num_comments": 1, "permalink": "/r/FoodStorage/comments/12oeeen/food_storage_with_interchangeble_lids/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Good idea. I am in USA but if you find them, please let me know"]}
{"title": "Help Identifying a missing Japanese Stackable Container.", "selftext": "", "url": "https://i.redd.it/awhenuwe815a1.jpg", "created_utc": 1670643351.0, "score": 2, "author": "augra27", "num_comments": 1, "permalink": "/r/FoodStorage/comments/zhhsce/help_identifying_a_missing_japanese_stackable/", "html_title": "", "top_comments": ["More info:. I lost the yellow one of this four piece (red, yellow, green, blue) screw top, stackable set and Google image search is not helping me so I wondered if anyone here can identify it. It has sentimental value & I'd love to be able to replace it. \n\nWhat I know: it's of Japanese origin, roughly 20 years old. Each open container can screw into the base of the other but the lids do not screw into the bases, just as lids per individual container. \n\nAny help would be of immense importance. \n\nThanks in advance!"]}
{"title": "How to Store Unstackable Cans?", "selftext": "Hello internet! I have a lot of canned food (not home-canned) in my food storage that has the same top and bottom, so they can't be stacked (I hope that makes sense). I've looked into the dispensers that store the cans sideways and allow easy access, but I don't like how they take up lots of room and I think they are overall just too expensive for the simple job they do. I like my food storage to be space-efficient so I don't see a point in investing in the big dispensers if there is a more simple (and hopefully cheaper) solution that I can find here. What (cheap and space-efficient) methods do you all use to safely store your cans?\n\ntldr: I need a cheap and efficient way to store cans", "url": "https://www.reddit.com/r/FoodStorage/comments/z275be/how_to_store_unstackable_cans/", "created_utc": 1669155964.0, "score": 2, "author": "leglerisaac", "num_comments": 3, "permalink": "/r/FoodStorage/comments/z275be/how_to_store_unstackable_cans/", "html_title": "Reddit - The heart of the internet", "top_comments": ["stack them in a pyramid, like a grocery display, or just box them up and label the boxes", "I second the cardboard. You can either use the trays they come in at the store or just use a flat piece cut to size.", "Another vote for using a thin divider placed on top of the bottom row, Rigid cardboard or a thin hard plastic sheet. The cardboard is better because it can be trimmed to the desired size.\n\nKevin Garce from Food Storage, Choices and Alternatives"]}
{"title": "vacuum sealing freeze dried food - why do some foods seem unsealed after a few days?", "selftext": "Hey all: have a question regarding storing home freeze dried food in vacuum sealer bags for medium term storage. I remove food from the dryer while ensuring there is no moisture remaining in the food (cold spots, etc), put it into a typical vacuum sealer bag you might buy in 100 packs from Amazon, clamp it into my sealer and press the button. The vacuum pump engages, the dried food gets a little crushed due to the vacuum created, all air is sucked out and the sealer engages. The now sealed food is in an air-tight bag where the plastic clings to the food and nothing can move around. Why then, in some cases can I come back a few weeks later to my dry, cool basement pantry to find the bags of food still sealed, but seemingly not in the air-tight condition I left them? E.G. you can pick up the bag and shake it and the food within moves around, but when you squeeze the bag, there are no air pockets to be found? This tends to happen more with powdery food such as raw eggs, but I've even had it happen to whole freeze dried green beans. Is there somehow more air in the void space between the food that the vacuum sealer doesn't get out on initial sealing or am I dealing with minute impurities in the seals of my bags? Would an oxygen absorber help? I don't want to use mylar for medium term storage due to its expensiveness compared to vacuum sealer bags, and I'm moving soon so don't want to store food for more than 2 years at this point.", "url": "https://www.reddit.com/r/FoodStorage/comments/ye5ov2/vacuum_sealing_freeze_dried_food_why_do_some/", "created_utc": 1666810157.0, "score": 2, "author": "Shuteye4220", "num_comments": 3, "permalink": "/r/FoodStorage/comments/ye5ov2/vacuum_sealing_freeze_dried_food_why_do_some/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Is it possible that little flakes/fragments of the dried food is getting sucked up under the sealing surface and creating a path for air?\n\nThinking of things I've vac-sealed at work, and things like dried spices would be sealed without engaging the vacuum so that they would stay at the bottom of the bag and not get into the seal line.\n\nPut a moisture absorber pack in if you're worried about current air humidity, wipe the sealing surface, and seal with no vacuum, would be suggestion; for stuff you already have, just wipe the inner surface above the attempted seal and re-seal it higher up on the existing bag (or cut, wipe, and re-seal lower)", "Is this happening with every bag or just the ones with the powdery food?"]}
{"title": "food storage and Trogoderma granarium", "selftext": " Just looked at my food storage and found Trogoderma granarium ***(carpet beatle)*** and have trashed 40 % of my dry food storage even my sealed MRE clear sealed packs does anyone know how to take care of the pest?", "url": "https://www.reddit.com/r/FoodStorage/comments/xbpio5/food_storage_and_trogoderma_granarium/", "created_utc": 1662920186.0, "score": 2, "author": "chillpac", "num_comments": 0, "permalink": "/r/FoodStorage/comments/xbpio5/food_storage_and_trogoderma_granarium/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "What is the most cost effective vacuum storage system", "selftext": "Years ago we purchased a \"FoodSaver\" vacuum system and have been pleased with the job it does.  One concern is I am finding that it costs \\~50 cents each time you vacuum seal something.  Seems like a high cost to me.  Has anyone here done the research on a more cost effective vacuum pack system?", "url": "https://www.reddit.com/r/FoodStorage/comments/vt1snn/what_is_the_most_cost_effective_vacuum_storage/", "created_utc": 1657144717.0, "score": 2, "author": "MBarRanch", "num_comments": 2, "permalink": "/r/FoodStorage/comments/vt1snn/what_is_the_most_cost_effective_vacuum_storage/", "html_title": "Reddit - The heart of the internet", "top_comments": ["You can get generic bags on ebay. 100 bags for around $23.00. There are rolls you can cut etc.. Just search food saver bags. Would bring your cost down to .23.", "I buy generic bags as well. It cost pennies. I typically buy on large rolls, but I also buy really small bags as well and package my own snacks in them. If you do a lot of vacuum sealing, you might consider upgrading to a commercial sealer."]}
{"title": "Noodles Recepies Delecious Chinese foods Latest Noodles Recepies Delecious Chinese foods Latest https://youtu.be/0-POaXXnd88 via @YouTube Please share & subscribe 😂 Like to my channel ❤", "selftext": "Noodles Recepies Delecious Chinese foods Latest\n\nNoodles Recepies Delecious Chinese foods Latest https://youtu.be/0-POaXXnd88 via @YouTube \n\nPlease share & subscribe 😂 Like to my channel ❤", "url": "https://www.reddit.com/r/FoodStorage/comments/v3haai/noodles_recepies_delecious_chinese_foods_latest/", "created_utc": 1654199493.0, "score": 2, "author": "Jazzlike_Quiet9184", "num_comments": 1, "permalink": "/r/FoodStorage/comments/v3haai/noodles_recepies_delecious_chinese_foods_latest/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "Food Storage Soup", "selftext": "I was given some long Term Cream of Broccoli Soup that has been kept in a cold basement.  It is from a from a food storage company packed with Oxygen Absorber, it is 20 years old.  Is it still good, or would it taste weird??", "url": "https://www.reddit.com/r/FoodStorage/comments/t8et5m/food_storage_soup/", "created_utc": 1646619881.0, "score": 2, "author": "RoseCanyon", "num_comments": 2, "permalink": "/r/FoodStorage/comments/t8et5m/food_storage_soup/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Anything that is 20 years old that is not hard wheat, beans, rice, etc. Is always suspect to me. I think there is somewhere you can send it out to be tested. The sniff test is always a good starting point. I think sometimes people do not understand good food storage. My wife and me try to store what we eat regularly. Our goal is a 2 year supply of food that is rotated. We eat something from the storage (minus fresh foods of course, but they can be freeze or air dried) and then we make sure it is added to our grocery list. I try to avoid 20 years of storage items unless they are freeze dried and stored properly. Not sure if that helps."]}
{"title": "Corn meal ?", "selftext": "", "url": "/r/cookingforbeginners/comments/spmaq5/corn_meal/", "created_utc": 1644542317.0, "score": 2, "author": "None", "num_comments": 0, "permalink": "/r/FoodStorage/comments/spmbma/corn_meal/", "html_title": "", "top_comments": []}
{"title": "Tyvek bags for re-sealable food storage?", "selftext": "I'd like to make dry food storage and rotation a bit easier by using food-grade Tyvek resealable food pouches. I've seen them for things like [5lb bags of rice](https://cdn.yamibuy.net/item/c71197aab8cf97a48fbd62e6e63c026f_757x757.webp), but haven't been able to find a source. Anyone done this or something like it?", "url": "https://www.reddit.com/r/FoodStorage/comments/so1jp6/tyvek_bags_for_resealable_food_storage/", "created_utc": 1644372091.0, "score": 2, "author": "JohnWhiteHV", "num_comments": 1, "permalink": "/r/FoodStorage/comments/so1jp6/tyvek_bags_for_resealable_food_storage/", "html_title": "Reddit - The heart of the internet", "top_comments": ["My favorite rice!  I didn't realize the bag was Tyvek."]}
{"title": "Grits ?", "selftext": "How do you use your grits? \n\nWe have some on the shelf and it’s time to start eating them", "url": "https://www.reddit.com/r/FoodStorage/comments/sm5r8z/grits/", "created_utc": 1644177170.0, "score": 2, "author": "None", "num_comments": 2, "permalink": "/r/FoodStorage/comments/sm5r8z/grits/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Oh yum. Cook them with chicken broth, salt and pepper. If you like onion and celery chop it up and cook it with the grits. Scoop some in a bowl, top with fried egg and bacon crumbles. Delish.", "As someone raised in the Southeastern United States, let me tell you that grits are not supposed to be a healthy side. \n\nCook them like this: https://www.aspicyperspective.com/the-creamiest-cheese-grits/ \n\nDon't skimp on the butter or they'll taste really bland. The cheese is optional (as in, grits are traditionally made cheesy or just buttery) but the butter is necessary. Happy eating!"]}
{"title": "can this food item be frozen?", "selftext": "Can the cans of ready to bake biscuits be safely frozen?\nI have a feeling the cans will \"pop\" open as they freeze....\nthoughts?\nThanks!", "url": "https://www.reddit.com/r/FoodStorage/comments/rxnm2p/can_this_food_item_be_frozen/", "created_utc": 1641499546.0, "score": 2, "author": "36Roses", "num_comments": 5, "permalink": "/r/FoodStorage/comments/rxnm2p/can_this_food_item_be_frozen/", "html_title": "Reddit - The heart of the internet", "top_comments": ["[deleted]", "The title is a little bit clickbaitey \"using one weird trick\""]}
{"title": "Best Reusable Takeaway Bowl", "selftext": "Hi,\n\nI hate all the packaging waste that comes with takeaway (disposable plastic containers etc).  So I'm looking for a reusable bowl & lid that will tick all the boxes.\n\n\\- Leakproof\n\n\\- Dish washer safe\n\n\\- Microwave safe\n\n\\- Volume about 7 cups (1,750 ml), to hold a noodle soup :-).\n\n\\- Shape: preferably low profile cylinder\n\n\\- Not essential but clear would be good too\n\n\\- Material: preferably ceramic or glass \n\n\\- Carry handle or insulated (plastic / stainless / ceramic & tempered glass all transfer too much heat to hold the container so it'd either need carry a handle or to be insulated).\n\nI've had quite a look online and it seems I'll have to compromise on a few things.  The leak proof lids tend to have clips that could be used to hold and carry when the bowl is hot but these lids tend to not be microwave safe.  Looks like I'll end up with plastic bowl and lid unless anyone has a better idea?  Thanks :-).", "url": "https://www.reddit.com/r/FoodStorage/comments/rr04vk/best_reusable_takeaway_bowl/", "created_utc": 1640755304.0, "score": 2, "author": "TunZen", "num_comments": 0, "permalink": "/r/FoodStorage/comments/rr04vk/best_reusable_takeaway_bowl/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "What foods will benefit in freshness with this vacuum storage system?", "selftext": "https://www.canadiantire.ca/en/pdp/zwilling-fresh-save-food-preservation-storage-starter-kit-with-handheld-vacuum-pump-0430335p.0430335.html?rq=Zwilling#srp\n\nJust wondering what refrigerated foods would be best to keep vacuum sealed. I dont wanna go the full vacuum seal route with the machines and plastic rolls. Thanks", "url": "https://www.reddit.com/r/FoodStorage/comments/183ofr9/what_foods_will_benefit_in_freshness_with_this/", "created_utc": 1700932415.0, "score": 1, "author": "mikemantime", "num_comments": 0, "permalink": "/r/FoodStorage/comments/183ofr9/what_foods_will_benefit_in_freshness_with_this/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "Twist ties", "selftext": "Does anybody know where I might buy a box of twist ties that are used to seal plastic produce bags from the grocery store? I looked into it once, and it seemed like it was almost impossible to buy a normal number of them. They were apparently intended for grocery stores, and came in quantities like 2000 per package. I would not outlive a box of 2000 twist ties! I could put them into my will, I guess.  😹\n\nI’m just looking for a package of maybe 50, maybe 100 ties? Any suggestions? Thank you!", "url": "https://www.reddit.com/r/FoodStorage/comments/17g8rnw/twist_ties/", "created_utc": 1698251263.0, "score": 1, "author": "Bastette54", "num_comments": 5, "permalink": "/r/FoodStorage/comments/17g8rnw/twist_ties/", "html_title": "Reddit - The heart of the internet", "top_comments": ["I just take them from the grocery store… 10-20 at a time. (I‘m not a monster…. I don’t use the plastic bags but bring my own mesh ones)", "Is there a reason you specifically need twist ties, or can you use something else? I use wooden clothespins for bread loaf bags and stuff. You can get 20- or 50- packs for cheap at most stores.", "Go on alibaba youll get a wholeeeeee lot but for cheap"]}
{"title": "AAA Cold Storage Consultants", "selftext": "  \n\nAAA Cold Storage Consultants\n\nRE: What we offer to customers\n\nBelow is a list of services that AAA Cold Storage Consultants can provide customers. AAA understands a cold storage unit is vital to the grocery, beverage, pharma businesses and it’s a large investment that the customer expects to last over time with minimal issues. \n\nNew Installs\n\n1. We can assist in the initial design of the box for the customer. Many customers or vendors can ask AAA to meet with customers to see the “lay of the land” so to speak and see what type of box would work for them. Size, shape, refrigeration needs, door sizes needed, field measurements, any other questions customer may have, configuration etc. \n\n2. We can assist with the installation of the boxes provided by the manufacturer. By having AAA instruct, guide, and oversee the construction of the box, any warranty issues will be better addressed and resolved if needed. \n\nThis installation service can be used a “sign Off” on the box.\n\n3. AAA can train and instruct the installing contractor that the customer has hired to build their newly purchased Freezer/cooler box so--- “good installation practices are followed and are up to manufacturers guidelines and standards”. \n\n4. AAA can help recommend and resolve any questions, issues and concerns the customer may have. \n\n5. There may be other questions and concerns that a customer or vendor will need that we can assist with. \n\nExisting Freezers/Coolers\n\nFreezers and Coolers do have a lifespan of approx. 25 years. After years the insulation will start to fail, and your R-value will decrease and cost money. Your refrigeration equipment will need to work harder to keep the temp inside your freezer/cooler. \n\nThe seams of the panels may become compromised and allow air penetration that will cause moisture and water issues. (We all want to prevent the presence of mold that will happen if not addressed.)  Also, ice around the outside and inside of the box may happen that will cause safety issues for slips and falls. We all want to minimize injuries that can be costly.\n\nThere are options and solutions for the customer that will save money and down time that AAA can offer. \n\nDoors, hardware, walls may have been damaged by vendors, employees and others while loading the freezers and coolers.  This will happen and should be expected due to human error. \n\nFeel free to call if you have any questions about how AAA Cold Storage Consultants can assist with your cold storage needs.\n\nAAA Cold Storage Consultants\n\n585-576-6127", "url": "https://www.reddit.com/r/FoodStorage/comments/172ckvq/aaa_cold_storage_consultants/", "created_utc": 1696701678.0, "score": 1, "author": "Due-Professional1049", "num_comments": 0, "permalink": "/r/FoodStorage/comments/172ckvq/aaa_cold_storage_consultants/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "how do I store 180lbs of meat long term without smell leaking", "selftext": "", "url": "https://www.reddit.com/r/FoodStorage/comments/16wiwqb/how_do_i_store_180lbs_of_meat_long_term_without/", "created_utc": 1696110450.0, "score": 1, "author": "xman2007", "num_comments": 4, "permalink": "/r/FoodStorage/comments/16wiwqb/how_do_i_store_180lbs_of_meat_long_term_without/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Lye as long as ur not going to eat it", "How is it stored? Canned? Freeze dried? Salt cured and dried?", "What kind of meat?"]}
{"title": "Ziploc bags with no corners (except at the top)?", "selftext": "Are there any cheap ziploc-style bags out there that are rounded at the bottom?", "url": "https://www.reddit.com/r/FoodStorage/comments/16vmaz8/ziploc_bags_with_no_corners_except_at_the_top/", "created_utc": 1696019090.0, "score": 1, "author": "OpenParodies", "num_comments": 0, "permalink": "/r/FoodStorage/comments/16vmaz8/ziploc_bags_with_no_corners_except_at_the_top/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "Ziploc bags with no corners (except at the top)?", "selftext": "Are there any cheap ziploc bags out there that are rounded at the bottom?", "url": "https://www.reddit.com/r/FoodStorage/comments/16vmays/ziploc_bags_with_no_corners_except_at_the_top/", "created_utc": 1696019090.0, "score": 1, "author": "OpenParodies", "num_comments": 0, "permalink": "/r/FoodStorage/comments/16vmays/ziploc_bags_with_no_corners_except_at_the_top/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "Rice//Corn cakes", "selftext": "I have some rice and corn cakes. I just put some in pyrex in the fridge. Then I’m going to move them to the freezer tomorrow when I make more space. Is this alright to do? \n\nOr should they go straight to the freezer?", "url": "https://www.reddit.com/r/FoodStorage/comments/16fqc0v/ricecorn_cakes/", "created_utc": 1694422850.0, "score": 1, "author": "Confident-Till8952", "num_comments": 0, "permalink": "/r/FoodStorage/comments/16fqc0v/ricecorn_cakes/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "the best ways to store your cat food — Mad Katz Blog", "selftext": "", "url": "https://www.madkatzblog.co.uk/blog/the-best-ways-to-store-your-cat-food", "created_utc": 1693149045.0, "score": 1, "author": "MadKatzBlog", "num_comments": 1, "permalink": "/r/FoodStorage/comments/162sxca/the_best_ways_to_store_your_cat_food_mad_katz_blog/", "html_title": "", "top_comments": ["Seems like a bunch of ads. We just store it in the resealable bag it comes in."]}
{"title": "Storing canned goods/condiments, etc. in basement", "selftext": "I am buying a house and the basement is unfinished but seems dry (previous owners recently dry locked and no signs of water during inspection) and has a section with shelving where the previous owners store some food and cleaning items and other various things.\n\nThe kitchen storage is limited in the home so I was hoping to use the basement shelving to store canned goods, condiments and anything I can get away with safely storing there.\n\nI am reading online and there seems to be more into storing food than I realized and just want to make sure I store things safely and so not at risk for insects/pests and don’t spoil the food. \n\nSo my main questions are:\n\n1. Can I safely store canned goods/condiments right on the shelves? \n2. What about other items like boxed pasta, boxed vegetable box, bagged rice/beans, bagged flour, canola oil, protein powder in its container ? Just a few other items I usually have extra of and currently store in an extra spot in my kitchen but would love to be able to put in the basement pantry. \n3. Do I need to take any additional precautions like getting a dehumidifier or storing the items in containers? \n\nThank you so much!", "url": "https://www.reddit.com/r/FoodStorage/comments/15vd36n/storing_canned_goodscondiments_etc_in_basement/", "created_utc": 1692442395.0, "score": 1, "author": "Satansdvdcollection", "num_comments": 2, "permalink": "/r/FoodStorage/comments/15vd36n/storing_canned_goodscondiments_etc_in_basement/", "html_title": "Reddit - The heart of the internet", "top_comments": ["1.Yes you can store canned goods directly on a shelf but just consider the strength of the shelves and the weight of what you are putting on it. You might also want to consider can rotators to make the FIFO rotation easy.\n\n2. Pasta, rice, beans and flour should be repackaged into plastic buckets and/or mylar bags with oxygen absorbers to prevent  bugs and moisture. You could also look into a FoodSaver vacuum sealer for storing your dry goods. \n\nFlour will only be good for a short while. Look into wheat berries and a grain mill. Wheat berries, properly stored can last 25+ years. \n\nUnopened Canola oil will last 6-24 months on a dark cool shelf. Ghee is a good alternative oil/fat that is shelf stable.\n\n3. I would consider a dehumidifier as a precaution if you live in a temperate climate as opposed to a desert climate."]}
{"title": "Pulled Turkey Breast Safe Temp", "selftext": "", "url": "https://i.redd.it/vqy4rrdklreb1.jpg", "created_utc": 1690575720.0, "score": 1, "author": "MaxiePriest", "num_comments": 3, "permalink": "/r/FoodStorage/comments/15c83hi/pulled_turkey_breast_safe_temp/", "html_title": "", "top_comments": ["I buy pulled turkey breast from Ralph's (West Coast Kroger) often and since it is always in the refrigerated deli department, it is easy to freeze. This time they had to grab a turkey breast from the hot section and process it for me but it is HOT. \n\n  \nI know overall it's important for heated items to be allowed to cool to room temperature before freezing and/or refrigerating. But not sure what to do with this pulled turkey. Leave it to cool to room temp before freezing, refrigerate before freezing or just pop it into the freezer?   \nThanks!"]}
{"title": "Short fat plastic bag?", "selftext": "Can anyone recommend a short, wide plastic bag? When I say \"short,\" I mean the axis perpendicular to the zip.\n\nOkay, last post for me for a while.", "url": "https://www.reddit.com/r/FoodStorage/comments/13n1omh/short_fat_plastic_bag/", "created_utc": 1684605748.0, "score": 1, "author": "OpenParodies", "num_comments": 0, "permalink": "/r/FoodStorage/comments/13n1omh/short_fat_plastic_bag/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "Countries With Most Starbucks Franchises in the World", "selftext": "", "url": "https://youtube.com/watch?v=gASRkl5rid8&feature=share", "created_utc": 1683569584.0, "score": 1, "author": "Lucianomende", "num_comments": 0, "permalink": "/r/FoodStorage/comments/13bzxl1/countries_with_most_starbucks_franchises_in_the/", "html_title": "Countries With Most Starbucks Franchises in the World - YouTube", "top_comments": []}
{"title": "What is the best quart slider freezer bag? Hefty? Ziploc? Other?", "selftext": "Also interested in the least toxic bag, if anyone has that information.  Thank you!", "url": "https://www.reddit.com/r/FoodStorage/comments/12x6rox/what_is_the_best_quart_slider_freezer_bag_hefty/", "created_utc": 1682319821.0, "score": 1, "author": "Personal_Style_8698", "num_comments": 0, "permalink": "/r/FoodStorage/comments/12x6rox/what_is_the_best_quart_slider_freezer_bag_hefty/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "Green beans", "selftext": "So I bought some “fresh” green beans from Aldi. Raw french green beans that come in a sealed plastic package. The bag was too much for one meal so I cut the ends off and put them in a mason jar with water (to the top) and put them in the fridge. It’s been a week and I took them out to cook. Strained the water off and put them on a paper towel. They’re still firm so I was gonna eat them. Anyone think this is a no go or am I okay to store green beans this way?", "url": "https://www.reddit.com/r/FoodStorage/comments/12i4s52/green_beans/", "created_utc": 1681178839.0, "score": 1, "author": "Both_Independent_748", "num_comments": 3, "permalink": "/r/FoodStorage/comments/12i4s52/green_beans/", "html_title": "Reddit - The heart of the internet", "top_comments": ["I rinsed, dried and froze in a ziplock freezer bag…don’t do this. When you unthaw, the green berms are soggy. Not sure how these buggers got freezer burn but I think that’s the culprit. We don’t eat a whole thing of green beans each week, so thought I’d try it this way. Really upset that I can’t figure out how to keep fruit/veg from going bad without having literally the same meal every night….which doesn’t work at all with a toddler.", "I would not cut the top and bottom and I would not store in water. I would store in a plastic bag wrapped in a damp tea towel, whole.", "those aldi beans are delicious. i do the same,  eat half and store them in the plastic bag they came in,  don't really even need the paper towel"]}
{"title": "Square Glass Food Container for two sandwiches", "selftext": "Has anyone ever found a Square **glass** lunch container that fits two standard square sandwiches stacked one atop the other?\n\nIt should be 5-6in square and 4-5 in tall. Glass. With a rubber gasketed lid.\n\nI could not believe that literally no company has ever made such a container, but evidently I was wrong. Apparently people have been packing single-sandwich containers since time immemorial and I'm the first person ever to want two sandwiches in the history of the planet.", "url": "https://www.reddit.com/r/FoodStorage/comments/12eccf3/square_glass_food_container_for_two_sandwiches/", "created_utc": 1680849473.0, "score": 1, "author": "drapanosaur", "num_comments": 1, "permalink": "/r/FoodStorage/comments/12eccf3/square_glass_food_container_for_two_sandwiches/", "html_title": "Reddit - The heart of the internet", "top_comments": ["They make more money when you buy two."]}
{"title": "Looking for a food storage container the right size for a laptop", "selftext": "Hi all\n\nI'm doing a lot of travelling and looking for something strong, light and waterproof to keep my laptop in, is anyone away of very long and wide but also shallow food storage? Like is there a use for that shape for any specific purpose? \n\nThanks", "url": "https://www.reddit.com/r/FoodStorage/comments/11e4wcu/looking_for_a_food_storage_container_the_right/", "created_utc": 1677587469.0, "score": 1, "author": "JanCumin", "num_comments": 1, "permalink": "/r/FoodStorage/comments/11e4wcu/looking_for_a_food_storage_container_the_right/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Not so much food storage, but look on Amazon for ‘Nanuk 923 Waterproof Hard Case with Laptop Insert Kit and Incorporated TSA Approved Travel Lock Latches’ .\n\nNot cheap but it meets your description."]}
{"title": "Following The Hungry Bear to the Nature 🌲🇸🇪 | Episode #1 #sweden", "selftext": "", "url": "https://youtu.be/aYj7RNw30kc", "created_utc": 1677497339.0, "score": 1, "author": "Adventurous_Map_1349", "num_comments": 0, "permalink": "/r/FoodStorage/comments/11d9mma/following_the_hungry_bear_to_the_nature_episode_1/", "html_title": "Discover Sweden's Nature 🌲 The Hungry Bear | Sverige 🇸🇪 |Episode 1: Nature Escape - YouTube", "top_comments": []}
{"title": "Storage Containers for dry items", "selftext": "looking for food storage for beans and oats\n\nWhat options do you use and have seen that are not plastic?", "url": "https://www.reddit.com/r/FoodStorage/comments/11bq46m/storage_containers_for_dry_items/", "created_utc": 1677345284.0, "score": 1, "author": "thankyoukatrina", "num_comments": 3, "permalink": "/r/FoodStorage/comments/11bq46m/storage_containers_for_dry_items/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Mylar with the zipper access may fit your requirements.", "[https://www.amazon.com/s?k=vacuum+container&rh=p\\_4%3ABESTFULL%2Cp\\_78%3AB0B9MZB7TP&ref=nb\\_sb\\_noss\\_2](https://www.amazon.com/s?k=vacuum+container&rh=p_4%3ABESTFULL%2Cp_78%3AB0B9MZB7TP&ref=nb_sb_noss_2)\n\nvacuum container, that sounds good", "I personally use mylar and Superpoly nylon bags: [https://www.impakcorporation.com/flexible\\_packaging/long-term-food-storage](https://www.impakcorporation.com/flexible_packaging/long-term-food-storage)"]}
{"title": "Are these jars airtight, or can they be made so?", "selftext": "Hi all! Not sure if this is the right sub for this question, but I'm hoping someone can help. I recently picked up a couple of [these jars (170 oz Mason Jars w/ screwtop metal lids)](https://www.amazon.com/Grant-Howard-Embossed-Container-Airtight/dp/B08L8C6VW6?th=1)for pantry storage. I was thinking Flour/Sugar/other dry goods. \n\nDo we think these jars are airtight, or tight enough to serve that purpose? If not , is there a way they can be made airtight?", "url": "https://www.reddit.com/r/FoodStorage/comments/101b3j9/are_these_jars_airtight_or_can_they_be_made_so/", "created_utc": 1672661368.0, "score": 1, "author": "agent_mick", "num_comments": 2, "permalink": "/r/FoodStorage/comments/101b3j9/are_these_jars_airtight_or_can_they_be_made_so/", "html_title": "Reddit - The heart of the internet", "top_comments": ["This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Grant Howard 51093 170 Ounce Classic Wide Mouthed Embossed Glass Mason Storage Jar Storage Container with Airtight Screw On Closing Lid \n\n>**Company**: Grant Howard\n\n>**Amazon Product Rating**: 4.2 \n\n>**Fakespot Reviews Grade**: C\n\n>**Adjusted Fakespot Rating**: 2.3\n\n>**Analysis Performed at**: 01-02-2023 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/grant-howard-51093-170-ounce-classic-wide-mouthed-embossed-glass-mason-storage-jar-storage-container-with-airtight-screw-on-closing-lid) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*", "If you are storing items for everyday pantry use, these are probably fine. They are not air tight enough for long term storage though."]}
{"title": "Question on Mylar Bags", "selftext": "I'm wondering if these little creases along the seal are letting air in? It seems I can't get rid of them no matter how flat I try to make the bag prior to applying heat.", "url": "https://i.imgur.com/S07Eva7.jpg", "created_utc": 1669317925.0, "score": 1, "author": "Adhelmir", "num_comments": 3, "permalink": "/r/FoodStorage/comments/z3sfrf/question_on_mylar_bags/", "html_title": "", "top_comments": ["Could you give the bag a gentle squeeze? You should be able to hear a leak. Typically this kind of mark is normal, and there should be enough material that has sealed what might look like a gap, but it could also just be a crease, matched on the back, but still sealed."]}
{"title": "What type of containers work in the freezer?", "selftext": "I have a hard time finding big containers that fit my freezer. I found some in plastic, but I don't know if they can withstand the freezer. Some of them it say they are made from  Polypropylene. Searching Google for that material, I get conflicting results. Some say they are great for freezer, while others say they can't be used. So I'm confused!\n\nIf they can't be used, and need a tag of some sorts, do you know of an European vendor with lots of different sizes?\n\nCheers", "url": "https://www.reddit.com/r/FoodStorage/comments/z2trc3/what_type_of_containers_work_in_the_freezer/", "created_utc": 1669221445.0, "score": 1, "author": "VonDinky", "num_comments": 0, "permalink": "/r/FoodStorage/comments/z2trc3/what_type_of_containers_work_in_the_freezer/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "Is bobka from TJs good to eat after 3-4 weeks in the fridge", "selftext": "I bought some bobka from trader joes (so it is not vacuum wrapped) at the beginning of this month, and promptly forgot about it after placing it in the fridge.  I just found it today when moving stuff around, and it looks fine (no visible mold) but  I'm not sure if I can still eat it.  Anyone know?", "url": "https://www.reddit.com/r/FoodStorage/comments/z29rxl/is_bobka_from_tjs_good_to_eat_after_34_weeks_in/", "created_utc": 1669162261.0, "score": 1, "author": "DrCrappyPants", "num_comments": 0, "permalink": "/r/FoodStorage/comments/z29rxl/is_bobka_from_tjs_good_to_eat_after_34_weeks_in/", "html_title": "Reddit - The heart of the internet", "top_comments": []}
{"title": "I'm trying my hand at winter squash storage, found one of the butternut like this. Does it need to be made asap? It yields to moderate squeezing", "selftext": "", "url": "https://www.reddit.com/gallery/yxdnqj", "created_utc": 1668651396.0, "score": 1, "author": "VillageInspired", "num_comments": 1, "permalink": "/r/FoodStorage/comments/yxdnqj/im_trying_my_hand_at_winter_squash_storage_found/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Extra info: there are green streaks connecting to where the stem use to be (I accidentally broke it off) and a calloused gash near that as well. I tried to sun-cure(?) it for about a week before keeping it inside. Had it for a few weeks in the pantry before moving it to the basement 2 weeks ago, this texture wasn't there."]}
{"title": "Best way to store bulk sweet corn on cob?", "selftext": "I recently started growing some and got way more than I thought 🥲.\n\nI have seen blanching but most instructions are so varied in timing I don't know which one to use.", "url": "https://www.reddit.com/r/FoodStorage/comments/ybefxv/best_way_to_store_bulk_sweet_corn_on_cob/", "created_utc": 1666521640.0, "score": 1, "author": "seediabolique", "num_comments": 1, "permalink": "/r/FoodStorage/comments/ybefxv/best_way_to_store_bulk_sweet_corn_on_cob/", "html_title": "Reddit - The heart of the internet", "top_comments": ["I do everything for about a minute. Until the color brightens up."]}
{"title": "Most ADVANCED Flexible Food Container on the Market", "selftext": " Details about this product below:  \n[https://www.youtube.com/watch?v=ikXWi-iicB4](https://www.youtube.com/watch?v=ikXWi-iicB4) \n\nhttps://i.redd.it/k3eo3dkee3s91.gif", "url": "https://www.reddit.com/r/FoodStorage/comments/xwt30w/most_advanced_flexible_food_container_on_the/", "created_utc": 1665021566.0, "score": 1, "author": "Shinraepc", "num_comments": 1, "permalink": "/r/FoodStorage/comments/xwt30w/most_advanced_flexible_food_container_on_the/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Information on this Gadget:\n\nDELIONE FLEX'N FRESH CONTAINER is the best flexible storage for food. Take care of the Earth and transport your meals in these durable, stretchable storage boxes. The patented stretchable lid can increase the volume by 50%! Not only that, but it also extends to 200% of its height. If you have something to store that’s just a little wonky in size, this container can handle it. You can actually stretch them up to 10,000 times without them cracking or breaking at all. It is 100% leakproof due to being made of high quality japanese shrink film."]}
{"title": "looking for a big storage bin that's relatively airtight", "selftext": "I like to keep single-serving bags of chips in the house instead of big bags for portion control purposes, and generally the cheapest way to get them is to order bulk boxes of 50 or so from Amazon.  The garage is the only place we have room to keep this stuff (also helpful for portion control if you have to walk outside to get a bag of chips), and unfortunately those little tiny ants keep getting into the boxes despite putting down traps etc. nearby.\n\nI've had good luck using Oxo's Pop containers to keep the ants out, but they aren't really that big (and individual bags of chips take up more room than you'd think). I'm wondering if there are larger containers that have similar gasket lids? I don't need something that's going to be airtight the way you would if you were storing rice or flour or something but something relatively airtight would be really helpful. Thanks in advance for any advice!", "url": "https://www.reddit.com/r/FoodStorage/comments/xdgvdq/looking_for_a_big_storage_bin_thats_relatively/", "created_utc": 1663098889.0, "score": 1, "author": "frooboy", "num_comments": 1, "permalink": "/r/FoodStorage/comments/xdgvdq/looking_for_a_big_storage_bin_thats_relatively/", "html_title": "Reddit - The heart of the internet", "top_comments": ["This the best \"airtight\" containers that I have found. They come in many sizes: https://www.amazon.com/gp/product/B0971S8W3B/ref=ppx\\_yo\\_dt\\_b\\_search\\_asin\\_image?ie=UTF8&th=1"]}
{"title": "Safest plastic / brands for food storage", "selftext": "We like to food prep a lot of our veggies and meets ahead of time so that when we cook, we can take out the appropriate containers and we're ready to go. \n\nCurrently, we use a mixture of Tupperware and Pyrex containers nearly all of which is round which makes it very difficult to best utilize the space in our fridge. We're looking for recommendations on the safest and most space efficient storage containers that will not leak out bad chemicals into our raw (or even cooked) foods, preferably dishwasher safe, and resistant to odor retention and staining. Normally, we'd like to use glass but a look at the Pyrex and Corningware containers doesn't reveal any larger rectangular containers that we can use to actually store bulk raw food.\n\nCurrently, we're looking at things like [this](https://www.restaurantsupply.com/cambro-12sfspp190-translucent-camsquare-12-qt-polypropylene-square-food-storage-container) and [this](https://www.restaurantsupply.com/cambro-4sfspp190-translucent-camsquare-4-qt-polypropylene-square-food-storage-container) but don't know whether it's better to get polycarbonate or polypropylene plastic. Supposedly both are safe and BPA-free but is there one that's better than the other? We definitely don't want it to affect things like fetuses or breastmilk or other things like that for my wife.", "url": "https://www.reddit.com/r/FoodStorage/comments/wi0fpw/safest_plastic_brands_for_food_storage/", "created_utc": 1659826014.0, "score": 1, "author": "noblerare", "num_comments": 2, "permalink": "/r/FoodStorage/comments/wi0fpw/safest_plastic_brands_for_food_storage/", "html_title": "Reddit - The heart of the internet", "top_comments": ["Have you looked into enamelware? You can google “enamelware covered storage” you will see what I’m talking about. Enamel won’t leach and with a layer of press-n-seal on lid it will be air tight. They are great for stacking they are much lighter than glass."]}
{"title": "Cheonggukjang powder; keep in fridge or at room temp?", "selftext": "Cheonggukjang powder; should I refrigerate or store at room temp\n\nCheonggukjang powder; refrigerate or store at room temp\n\nI got some cheonggukjang powder from Amazon but it doesn’t say if I should refrigerate it. Should I or should I just leave in the cupboard", "url": "https://www.reddit.com/r/FoodStorage/comments/vogzia/cheonggukjang_powder_keep_in_fridge_or_at_room/", "created_utc": 1656618085.0, "score": 1, "author": "panatipata", "num_comments": 1, "permalink": "/r/FoodStorage/comments/vogzia/cheonggukjang_powder_keep_in_fridge_or_at_room/", "html_title": "Reddit - The heart of the internet", "top_comments": ["My mom keeps hers in the fridge."]}
{"title": "Is it okay to use this glass to cover walls and then also store bottled water and non perishable foods?", "selftext": "", "url": "https://i.redd.it/rmaamgbtihu81.jpg", "created_utc": 1650373703.0, "score": 1, "author": "None", "num_comments": 0, "permalink": "/r/FoodStorage/comments/u74rla/is_it_okay_to_use_this_glass_to_cover_walls_and/", "html_title": "", "top_comments": []}
{"title": "ham - how to store in fridge?", "selftext": "", "url": "https://www.reddit.com/r/FoodStorage/comments/tyt677/ham_how_to_store_in_fridge/", "created_utc": 1649384744.0, "score": 1, "author": "AndrewWise80", "num_comments": 5, "permalink": "/r/FoodStorage/comments/tyt677/ham_how_to_store_in_fridge/", "html_title": "Reddit - The heart of the internet", "top_comments": ["I have put it in an airtight container then put that in the fridge. Is that enough? Or do I need to wrap the block of ham (about 500grams) in baking paper then put that in airtight container then place airtight container in coldest part of fridge?"]}
{"title": "Make yogurt canned evaporated milk?", "selftext": "", "url": "/r/Cooking/comments/thx8bp/make_yogurt_canned_evaporated_milk/", "created_utc": 1647702721.0, "score": 1, "author": "None", "num_comments": 0, "permalink": "/r/FoodStorage/comments/thx8hx/make_yogurt_canned_evaporated_milk/", "html_title": "", "top_comments": []}
{"title": "Blueberries", "selftext": "I have 5-6 pounds of blueberries. Should I freeze them or dehydrate them?", "url": "https://www.reddit.com/r/FoodStorage/comments/sks70b/blueberries/", "created_utc": 1644018462.0, "score": 1, "author": "KyTitansFan", "num_comments": 1, "permalink": "/r/FoodStorage/comments/sks70b/blueberries/", "html_title": "Reddit - The heart of the internet", "top_comments": ["I say do both. That way you don't freeze them all and have a power loss that ruins them. \n\nFreeze for short term storage and dehydration for long term is what I'd do."]}
{"title": "Does anyone know if I can freeze my poke bowl and eat it tomorrow? Or should I just throw it out?", "selftext": "", "url": "https://www.reddit.com/r/FoodStorage/comments/s6nyxz/does_anyone_know_if_i_can_freeze_my_poke_bowl_and/", "created_utc": 1642478257.0, "score": 1, "author": "None", "num_comments": 1, "permalink": "/r/FoodStorage/comments/s6nyxz/does_anyone_know_if_i_can_freeze_my_poke_bowl_and/", "html_title": "Reddit - The heart of the internet", "top_comments": ["How long have you had it? If it's from today, just refrigerate until tomorrow."]}
