{"title": "Tasty cancer", "selftext": "", "url": "https://i.redd.it/p5dl5os8dx8b1.jpg", "created_utc": 1688030468.0, "score": 4211, "author": "zain_monti", "num_comments": 290, "permalink": "/r/foodsafety/comments/14m08lv/tasty_cancer/", "html_title": "", "top_comments": ["This is technically a food safety issue, but it's a bit of a stretch. Also let's stick with better sources than news articles. \n\nAs far as I can see, the science says it **may** increase the risk of cancer, but has not been proven to lead directly to cancer. Unfun fact: potatoes can be carcinogenic too! \n\nHere are two studies done that lean  towards it being bad, but 5heu are what I could find that felt impartial. The Association for Aspartame didn't seem like the best source. \n\nhttps://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1003950\n\nhttps://ehjournal.biomedcentral.com/articles/10.1186/s12940-021-00725-y\n\n~~I will leave this post open for discussion, but please keep it civil, and keep it scientific.~~\n\nEdit 2: shutting this down now. Consensus is that artificial sweeteners are cancerous when huge doses are given to rats. More study is needed, and for now I don't think any of us are going to fall over tomorrow because of aspartame.", "I remember reading somewhere that artificial sweeteners are only carcinogenic in extremely high quantities, like you'd have to drink litres upon litres every day of your life for it to have any negative effects.", "Clickbait- no studies have proven a link between it and cancer but they want to investigate it further amd hope this prompts it (basically using fear to get it investigated). As currently known, any effects they find would depend on the quantity ingested.", "Learn about absolute and relative risk.\n\nLiving increases the risk of cancer.", "Aspartame is one of the most studied food additives. People seem to feel like it MUST be bad for us. The FDA and European equivalents keep labeling it safe. Doesn’t mean they are right but at some point…", "This Advertisement is Brought to You By THE BIG SUGAR", "For all the years they’ve been trying to say this, they still lack any compelling evidence.", "What does this have to do with cancer? If it was shown to cause cancer it would be a group 1, known carcinogen.  Not a group 2 probable/possible carcinogen with other things that haven't been shown to be carcinogenic. Like foods fried at high temperatures, red meat, hot drinks (above 65⁰c),  and pickled vegetables", "Other things in this group: coffee, cell phones, woodworking, working nights", "It's only dangerous in extremely large quantities, and the way they tested it was on rats.\n\nSo tiny animal gets a shit ton of aspartame, and develops cancer, then people start thinking one diet soda gives you cancer. \n\n\nHow about all that sugar you're drinking ? That not only leads to cancer as well, but 10x more issues like obesity, diabetes, tooth decay, clogged arteries, I could go on and on.\n\n\nNot going to say anyone needs to follow my lead, but I'd rather drink diet soda and day of the week over a normal one. \nDo some research if you don't agree. \n\nOr, don't drink any soda ! The best option", "This is all based on a series of flawed studies. If I remember correctly, (as I am not an expert,) Aspertame is ~1000 times stronger than sugar. Therefore drinks with aspertame use a very, very small amount. Scientists took laboratory rodents and gave them equal amounts of sugar and aspertame enough so that the aspertame killed them and then went “SEE! SEE! IT’S DANGEROUS!” When in reality the experiment was flawed from the start.", "This was floating around 30 years ago. If there was a proven link, there would already be a ban", "I've seen videos from nutritionists and dieticians online that have claimed you'd have go basically hammer the fuck out of soft drinks with sweeteners to suffer any serious effects. \n\nThis debate has been going on the entire time I've been alive, which is 29 years, at least.", "That McDonalds Diet Coke will go with me to the grave tho.", "Just remember everyone, everything in moderation", "How much would you have to drink everyday for it to be an issue though. One can a day isn’t an issue", "Artificial sweeteners have been shown to reduce weight in those that usually drink sweetened soda. Obesity is a major risk factor for cancer development.\n\nTherefore, if this were true (and I doubt it is) I would like to see an analysis of the benefit of avoiding artificial sweeteners vs increased cancer risk with the increase in weight gain that individuals will experience if they stop drinking artificially sweetened drinks.\n\nAspartame is one of the most intensivly studied food compounds and the evidence for it's safety is robust and abundant. So I would like to see what evidence is presented to the contrary.", "Can you share a source?", "Sugar, wants there money back …..", "They declared bacon and other processed meats as carcinogen years ago, hasn't seen to impact bacon sales or the availability of bacon and other meat products. \n\nI assume they will try to get a label or advisory on the bottles, though the lobby groups have managed to stop them from putting those same labels directed at the calories or sugar on the regular non diet products, so I doubt they will be any more successful in this battle.", "You would have to drink so much for this to be real, it's not good for you but it's not this bad", "And sugar will give you diabetes and also cancer, seems like we are not meant to have sweet things...", ".....and meanwhile many ppl drink alcohol, so what does it really matter.", "The thing with these studies is that until they release how much causes cancer they’re doing the public a disservice. \n\nI know so many people who would lose a ton of weight if they switched to diet soda (or no soda) but won’t because of these studies. \n\nWe live in a nation where CVD is the most common cause of death and obesity/diabetes is a common diagnosis.", "Lots of things we consume daily are known carcinogens but well anybody stop highly doubtful", "Aspartame is extremely carcinogenic in RATS. There is no link with it being carcinogenic in humans.", "Let me guess. It increases risk in laboratory mice at a dose equivalent to drinking your own body weight every day", "This took way way too long", "The study I read about gave aspartame to rats. Some of the rats developed cancer. However, based on the weight of the rats, the amount given to them would be the equivalent of a human drinking over 1000 cans of diet soda every day.\n\nThere are also concerns that the rats themselves were predisposed to cancer because of breeding practices.", "i'll still take the chemicals over loads of sugar. i'd rather die of cancer later than be a fatass now", "We’re all full of microplastics anyway i’ll continue drinking my soda", "“Since 1981, JECFA has said aspartame is safe to consume within accepted daily limits. For example, an adult weighing 60 kg (132 pounds) would have to drink between 12 and 36 cans of diet soda – depending on the amount of aspartame in the beverage – every day to be at risk. Its view has been widely shared by national regulators, including in the United States and Europe.”\n\nReminds me of when we found out that bananas could give you radiation poisoning (if you ate a million in a day) as kids", "I always stuck with full sugar drinks anyway, they taste better and don't damage taste buds over time.", "Diet Stomach Cancer!!!", "I also remember reading that aspartame doesn't affect blood sugar, but it does affect your gut. A fucked up gut can cause issues, including weight gain.", "UK be like \" omg sugar is so evil\" \n\nAlso UK : sticks sweeteners in everything", "God for bid they go back to cane  sugar which taste better and is healthier than all the chemicals they use. Greedy capitalistic pigs.", "A close friend of mine drank diet coke alot...like 4-5 355ml cans a day and he passed from throat cancer at the young age of 44😥...", "I always thought it tasted like cancer", "Don't tell me alex Jones was right", "Haven't seen anything on that, but there was a report that something like two cans of Diet Coke a day is worse for your heart than regular coke or smth...", "I read recently that there was a study that showed sucralose breaks down DNA when they exposed human blood cells to it. \n\nI'm not an expert to know how dangerous that is, but I understand that DNA has a half life that's hundreds of years. It doesn't sound healthy on the surface. I can't say how bad that really is though, bc I haven't dug into it and researched further yet.", "THE CONSPIRACY THEORISTS WERE RIGHT AGAIN!!!!!!!", "And people think drinking Diet Coke and zero sugar are good for you? 😂", "I know people who live on diet sodas, and I’ve been telling them for the past 1.5 decades, that the regular pop is better, just don’t drink it like water.", "Nothing we already didn’t know", "Been saying it for years......", "I honestly hope the stuff is found to be unsafe because sweeteners all seem to give me diarrhoea whereas actual sugar doesn’t set off my IBS-D at all", "This is old news.", "Honestly I'd appreciate that. I drank some yesterday but I'd happily remove aspartame from all diet drinks if I could xD.", "Finally", "[removed]", "Me and my friends had this pegged as teenagers back in the 80s", "[Cyclamate Part II, electric bugaloo.](https://youtu.be/pDAZ9lQOi7Q)", "[removed]", "It my not be cancerous, but it tastes gods awful. I swear it must taste different to most people.", "So is this bullshit or not fucking worrying me dude.", "People have said it caused cancer for years, I knew someone who blamed diet coke for the death of their sister, that was a good decade ago.", "Definitely NOT tasty.", "Let's declare everything as \"possible\"", "Grandma was saying that shit for years", "I wouldn't call it tasty, personally. But I'm also allergic to artificial sweeteners. Lol", "Everything is legal in high doses including water. This is a nothing burger", "Being alive increases risk. But I do not drink soda As a side note", "Wait no I need this im a type 1 diabetic were is this going to happen", "jfc, \"aspartame may cause cancer, we should research it more\"\n\nbut...but...potatoes!", "Curious if it's the soda or the plastic bottles.", "Carbohydrates in general are letting growing cancers, especially sugar and spiking your insulin levels. If anyone's body will have a dead cell and mutate in to cancerous  cell the only way how it can feed isn't from oxygen but insulin spiking, literally stuffing you face with carbs.\n\nWarren Buffet been drinking coke all his life and he is fine, someone thinking living healthy gets brain cancer. It's about the diet and carbohydrate consumption more or less.", "How about neither of them.", "Funny story. They knew this in the '80s and still sent red gumballs sweetened with NutraSweet in the mail to thousands of mailboxes. The postcard they were stapled to described NutraSweet as a natural derivative. But, everyone knew the saccharin in T.A.B. (the original diet soda, acronym joke was Totally Artificial Beverage) was causing cancer in lab mice. So, the people needed a new way to poison themselves....\nThe pink sweetener packets still exist, so now we have two sugarless killers!", "Any diet drink sucks.", "Is this shocking to anyone lol", "Why are there so many aspartame advocates haha. It’s clearly not healthy, just drink water", "Ah yes correlation vs causation strikes again. The Naturopathic \"doctors\" are going to be pretty damn smug for a while SMH", "It only took 1000 years", "I thought we already knew sweeteners caused cancer", "No, this shit gets repeated for over 20 years now. Mostly because people like thinking that everything good must have a negative downside, so it's an easy way to enforce your confirmation bias.\n\nSame with Sucralose.\n\nhttps://www.youtube.com/watch?v=TmpzqjzG4-I", "I thought we already knew this. It’s the reason I have avoided diet soda for years", "Gee. Catch up US", "Didn’t they already do that years ago?", "People have been saying this for decades and it's never been proven", "A bit of common sense:\n\nIf artificial sweeteners imitate the bonding sites of sugars enough to fool taste receptors, then in theory, they'll fool the body, too. Don't throw monkey wrenches into your machinery.", "It is important to note, IARC reporting lists \"possible carcinogen\" as below \"probable carcinogen\" and that is also below \"carcinogen\"", "\"Tasty\" is debatable.  Tastes like poison, IMO.  Sweet poison, but poison none the less.", "Aspartame is a Donald Rumsfeld product, I think he pushed that product out to the marketplace, it was one of his big achievements.", "I know I drank a few aspartame pops one time and started to feel sick after this  has never happened with regular sugar pops it is definitely not good for you especially in larger quantities", "I meat processed meat is listed as a carcinogen and it's still on the shelf so... Why should I give a fuck?", "Charcoal grilled meat is more carcinogenic. Don't see Americans putting that shit down anytime soon", "I think it’s worth remembering the way they test if something is a carcinogen\n\nTears are done in rodents, usually at *thousands* of times the dose that a human could consume in one day. \n\nSo while things like a microwave COULD increase your risk of cancer, you’d have to be living in a constantly running microwave for it to ever be something to worry about for you.\n\nIt’s like the banana problem: bananas are radioactive. If you eat *several thousand pounds* of bananas at once, you’d consume enough radiation to kill you, however it is MUCH more likely that the insane overconsumption of bananas would kill you long before the radiation could have a chance", "Haven't there been various safety concerns to some degree over most artificial sweetener going back decades?", "Literally everything gives you cancer. The Prop 65 signs say so.😜", "This is aspartame, the sweetener that’s slowly killing me", "for fuck sake can they leave my bubble gum alone ..", "didnt we already know this for like 15 years", "People have been talking about this for 30+ years", "While I’m sure that’s definitely true, the evil thing here is that this can all be a public relations stunt designed to scare us and “coincidentally” coca cola and other companies will magically have a new product line suddenly available for us to buy instead. This is really just marketing disguised as news. So, this can all be an elaborate plot to prepare us for their new products. This is a classic scare-tactic corporations have been using for decades; preying on the innocent by exploiting the sources we trust. Problem, reaction, solution. So, they present the problem (they created), the masses react in fear, and then they offer the solution (a new “safer” product). ALL for profit. Pure scare-tactics, it is evil. Let’s say I sell sunblock to someone, make profit from it, then tell them it’s carcinogenic so they get scared and then I offer the solution…sell them another product. Corporations can pervert & corrupt even the government bodies we all naïvely trust. And they will get away free without ever having to take responsibility for putting known carcinogens into their products. Deliberately making ppl sick and harming our health on purpose to make more profit for big pharma. You think the tobacco industry was the only one to deliberately poison ppl to make more profit for big pharma? Believe me, this is *wide-spread.* As a media grad, if we were aware of the evil and corruption going in the world that we are all oblivious victims of, this would be a different world over night. That is the primary function of all mainstream media, to disseminate corporate information and hide their evil. It’s the corrupt major corporations we all trust that make media stations rich. This is the reality of capitalism they don’t want us to be aware of. Competition is so fierce that all morals go out the window. You think they’d ever be allowed to talk about corporate corruption and the evil things they do? They’d immediately pull all funding. We’re all too distracted by our phones nowadays and thereby oblivious to the insidious corporate evil in the world. And this is exactly what they want… A dumbed-down society that just does what they’re told and doesn’t question anything and just buys their products. The smartphone is the Achilles heel for the masses. They spend billions on commercials and marketing every single year just to convince us their shit poisonous products are actually good. If that’s not propaganda then I don’t know what is.", "Aspartame has always been bad.", "We already know this don't we?", "oh no I have been drinking a can of diet soda almost everyday", "It's less about what it is and more about how it got approved and into foods here in the good ol' USA: https://www.huffpost.com/entry/donald-rumsfeld-and-the-s\\_b\\_805581"]}
{"title": "Okay... you walk into your work bathroom and find this... what percentage of the cupcake do you think is technically safe to eat?", "selftext": "", "url": "https://i.redd.it/7ikfvgjftn8b1.png", "created_utc": 1687914844.0, "score": 2870, "author": "GabbotheClown", "num_comments": 1890, "permalink": "/r/foodsafety/comments/14kvizj/okay_you_walk_into_your_work_bathroom_and_find/", "html_title": "", "top_comments": ["You know what? \n\nI'm gonna allow it. \n\nProceed to discuss the food safety of the toilet cupcake.\n\nEdit: it seems there is a little agreement. Other than the social taboo of eating a cupcake, and the part that directly touched the toilet, this is \"safe\". \n\nThis sub in no way supports toilet cupcakes or their perpetrators.", "I would personally not eat any of that cupcake", "None. You know dang well someone’s looking for that and probably gonna want it back. 🤨", "0%. Who puts a cupcake on a toilet seat?\n\nThis is clearly a trap or a prank.", "You can eat 100% of it just make sure you stay seated on that porcelain throne for the after effects.", "Zero percent.\n\nThe answer is zero percent.\n\nIf you think for one second that the answer might be greater than zero, stop thinking immediately because the answer is zero. Full stop.\n\nDo. Not. Eat. That. Cupcake.", "General safety rule : just don’t eat food off toilet seats???", "Gun to my head, I’d say remove the outer layer about half a centimeter on all sides and soak the whole thing in rum. Maybe roughly 60%", "You’re making an assumption that its a cupcake….", "Prettiest pile of shit I've ever seen. Scat artist.", "100%.\nIf you lick the seat before you eat the cupcake then it cancels out the bad bacteria. \n\nTwo negatives make a positive.", "Airborne fecal bacteria is real.", "In this case asking the question is answering it 🤔 loll", "spoiler, the toilet is cake", "Probably safer than your thumb on the phone screen", "Remember limits from math class", "There’s a chance someone pissed on it", "I just leave the stall. I don't want to know why there's a cupcake on the seat and I'm not touching it.", "0% or 100%.", "Lick the top and replace it. Done, a good find.", "Top 20%", "I’d say do a reverse 🤌🏻 and cut straight thru middle. \n\nThen throw both halves into toilet and flush", "Bathrooms disgust me, I can’t even brush my teeth without washing my hands after, so I would never eat anything in a bathroom", "0% shit air", "I would never put my mouth near it, I think I would piss myself laughing about it then throw it all out", "0 percent. Here is the proof.\n[Toilets spew invisible aerosol plumes with every flush\n\n](https://images.theconversation.com/files/499634/original/file-20221207-11275-dvj7o.jpeg?ixlib=rb-1.1.0&rect=0%2C0%2C3863%2C4784&q=45&auto=format&w=926&fit=clip)", "If you eliminate the prank factor, toilets tend to get washed often as opposed to a desk or a keyboard.", "I wouldn't eat any of it? \n\nWhy are people actually trying to scientifically determine how much cupcake to eat here? \n\nIts literally a random cupcake in a bathroom. You guys will take one bite, pass out, and wake up in an empty motel inside an ice bath.", "Realistically looking, I think only the inside is 'safe'. But, you can't get to the inside without transferring germs from the surface to the inside.\n\nThe real question is, did you EAT it? 😉", "The only thing keeping me from that cupcake is societal norms, I see no issue", "Is it an edible? I’d eat two.", "If you’re starving to death and eating is more important than the risk of infection than I would eat all of it.\n\nIf you’re not on the verge of death I would pass", "If you are for a moment considering eating any percentage of that, you need help 🤢", "The whole thing. Your fine, thats there so you can use the dipping sauce. Just make sure to not leave a mess so please lick around the seat when you finish, it has a nice and tangy flavor :)", "If the seat was dry, mythbusters says that the seat has very little bacteria on it.  Esp if the seat is cold.  So it could depend on when the cupcake was placed.", "About 0%", "George Costanza, is that you?", "SAFE? 100% I bet. \n\nBut how much, if you really insist, would I say is acceptable? Just slice the thin layer off the bottom that’s touching the seat I guess. If you’ll eat part of it might as well eat most of it", "The whole thing is covered in residual fecal matter.", "Ok in honor of the u/Redbaron1701 let's be real here....\n\nThe sugar content probably gives this cupcake a super high hydroscopic index. So most likely it's impenetrable by bacteria. Therefore the only contamination would be a surface contamination and OP can cut off the bottom by the width of the bacterial colony.\n\nBacteria is around \\~0.5um and let's assume there's a dense colony... because it's a toilet... so eh 100 bacteria height so that's 50um. Let's say that the cupcake is 3 inches tall.  So he'd have to cut off .065% of the cupcake. Or 99.934% is still good.", "Zero", "0.00%", "0%", "Zero percent.", "Just remember that although you think it might be vegan the amount of animals killed to create this product harmed far more creatures than it would to cook a ribeye steak.", "Bro fucking Zero", "0%", "0", "Dude they’re going to take your post down. Still made me lol though", "Depends… was the toilet flushed just before the cupcake was set down? How long has it been there? Through numerous flushes? If the answer it no, just set down for the picture and zero flushes, I would eat it all except for the very bottom.", "0% assumption. \n\nIn actuality? Maybe 20%, the core. \n\nFecal particles become airborne during flushing.", "0", "Literally 40% of the shit you touch is dirtier that that seat. Relax", "Nope", "If I'm your janitor, the whole cupcake is safe to eat. 😉", "i would say..........................0%\n\nyou are better off throwing it out. i love chocolate, but i would not eat a chocolate cupcake from a toilet. that's just *gross.*", "0%. Toilet spray is a real thing", "Is this post from Crabbe and Goyle?", "Lick it then put it back", "Prank for new employee that happens to be blind ?\n\nI'm joking!!!", "How do you know its a cup cake? Judging by where it is someone might just have a poor diet and a poor aim", "Just the frosting.\n\nBut I'd sit on it first.", "Because of the principle of the matter don’t eat toilet cupcakes, but in reality it’s probably not among the dirtiest places to eat a cupcake off of", "How much of it is safe? All of it most likely. Would i eat it? Not a chance.", "101% - lick the crumbs that aren’t cupcake", "Zero", "At my work, zero…… it’s probably been uncovered for a month and laced with every shitty street pharmaceutical available.", "Depends.  That bitch from HR or your micro managing boss can 100% eat it.", "100%, try me", "The question is why did someone put a cupcake on the toilet.  This food is not to be trusted, regardless of germs.", "My man… did you eat the fuggin cupcake?", "None?!! Why would anyone even consider eating food that’s been on a toilet??? Sick 🤢", "Id say everything except the bottom slice (same width as bologna) which touched the toilet. So like 95%\n\nIf it's not fresh and people have been flushing toilets etc around it, maybe the entire outer layer", "Define safe to eat? Could house the whole thing and likely not feel any side effects. Immune systems are great. Personally I don’t like sweets but if it were a baked potato I’d prolly just not eat the skin, also my answer for cupcake. Don’t eat bottom “skin”", "The inner core of the cupcake", "99% ?", "I think it'd depend on if the toilet had been flushed with it sitting on there or not, because that could mean some \\*particles\\* got on it. That'd be something to consider I think lol.", "ZERO!", "2/3 of the way down", "0%", "0%, its too close to a fart zone.", "All", "that really depends on if the toilet was flushed post placement!  the easy answer is a hard no and use it as a projectile for the muffin man who placed it there!", "No I don’t think so", "To break it down, in the wild coming across this I wouldn't eat it.\n\nHowever.... An argument can be made for taking a bite off the top.", "The inner 50% of it as the outside might have been exposed to whatever’s in the air", "There’s no paper so fuck no", "The inner part that contacts none of the washroom air and the toilet seat", "the entire thing is contaminated as soon as it touches the toilet", "Absolutely 0%.", "90% of that cupcake is good to eat. If it’s not touching the seat it’s not infected", "How many words for zero do I know?", "Zero", "0, there's fecal matter in the air.", "Depends on who came out before I went in.", "Absolutely zero. End of story. If you put any of that toilet cake in your mouth, you should have to wear a sign warning people you're disgusting so they'll know before they kiss you. 😂", "23%", "i mean, it looks pretty good. i'm sure a few cheeky particles won't do ya more harm than chocolate couldn't cure. dig in.", "0% but my stomach doesn't consider the math", "All of it. Germs don't live on plastic seat."]}
{"title": "how is this allowed to be sold?", "selftext": "this is sapporo ichiban japanese style noodles. if this product can lead to cancer... why is it okay to consume?", "url": "https://i.redd.it/ws8vsyo5s5cb1.jpg", "created_utc": 1689439884.0, "score": 2011, "author": "k4spbr4k", "num_comments": 233, "permalink": "/r/foodsafety/comments/150gvn3/how_is_this_allowed_to_be_sold/", "html_title": "", "top_comments": ["locking due to high volume of off topic comments. \n\nin case anyone did not see, California made the prop 65 with goodish intentions but the parameters were too strict so anything that has a potential to even cause a minuscule amount of cancer or even if you have to eat a ridiculous amount, gets this warning. \n\nthis backfired because there are so many things that are safe at low doses but could potentially become dangerous at high enough doses. doesn't account for the fact that the dosage would probably be impossible to consume by a human normally or other things would happen before whatever gave the warning caused cancer.\n\nan example is bananas. bananas are a good source of potassium which we need as part of our vitamin intake. however, potassium has a chance for small amounts to be radioactive. this is less radioactivity than the sun however. so you would have to consume more bananas than humanly possible to even get a chance of a risky level.\n\n[Bananas source ](https://www.epa.gov/radtown/natural-radioactivity-food#:~:text=The%20most%20well%20known%20examples%20of%20naturally%2Doccurring%20radionuclides%20in,(0.1%20microsieverts)%20of%20radiation.)", "Prop 65 started as a well intentioned idea to alert consumers about the presence of potentially harmful chemicals and such. Unfortunately, it spiraled out of control and there was no regard given to context. If there is a fraction of a percentage chance that someone might be at increased risk of getting cancer after eating 10 times their body weight of a given food, it got the label.\n\nSo they wound up being placed on just about everything, not just foods. It's basically the participation award of safety warnings. It's so ubiquitous it means nothing.", "I came across a prop 65 warning on a plastic valve for a fish tank tube the other day and had to Google what the hell it meant. This was in a garden centre in a rural English village. \n\nIt seems that the threshold for the warnings is so ludicrously low there isn't any real way to use them to inform your health. The problem of emphasising everything in fact emphasising nothing.", "The CA Prop 65 warning is on most of the stuff in your house.  It means almost nothing.  Your noodles are fine.", "You'd be surprised by the number of food products that contain life-threatening chemicals but are in so low dosages that it mostly doesn't matter. For example, bananas contain an isotope of potassium that is radioactive but in order to cause noticeable damage you'd have to eat millions of bananas in an hour. Almonds contain cyanide but in order to die of cyanide poisoning you'd have to eat more almond in 30 min than your stomach can ever contains you'd die of a thorn stomach before you'd die of cyanide poisoning. Tldr don't worry about the warnings of chemicals in food if it were that dangerous the FDA wouldn't allow it to be sold.", "Pretty sure air in CA also has this warning.\n\nIf it was truly unsafe, it wouldn’t be a foodstuff being sold to consumers.", "I think California puts this on everything known to man", "You get cancer from everything in California. Actually, you don't even have to be in California, just uttering 'California' out loud probably causes throat cancer.", "Red meats, preserved foods, and alcohol are all carcinogenic... and not CA 65 warning carcinogenic......", "My keyboard has a warning sticker that repeated use can lead to wrist injury. I don't know how California knows what kind of porn I'm searching for but my wrists are fine. You'll be too.\n\nhttps://i.redd.it/pgpstve2s1271.jpg", "Here’s a little story. There’s a product called G-Fuel. You can look it up. It’s basically an energy drink powder made of a lot of different fruits. Guess what? Lead will find its way into this drink via the fruit. This means they have to disclose that it can expose you to lead. Will you get lead poisoning drinking it? I would put a lot of money on ‘no’. But because of prop 65, a bunch of people question whether this drink is safe or if they will die. Paranoia at its finest. The intentions of the regulation were good, but sometimes it doesn’t go as planned and things get out of hand.", "Bro what... Half the posts on here are trolls, prop 65, can I eat sausage etc...", "Proposition 65 was a very bad idea. California will one day realize that some companies will just stop putting those warnings on there and California will just stop getting supplied things that do not comply. When their citizens realize that their state's overreaching law was a bad idea, maybe they will repeal it.", "This is a generic CA Prop 65 label. If it were equally enforced across the board, it would be on every item of food you buy in the state of California.", "I'm sure it's only there to make someone money somehow in California.", "Simple, just don’t eat it in California.", "Because it's California doing their fucking insane California shit that means absolutely nothing.", "People buy and consume alcohol. And it's literally poisonous.", "I mean, even a bag of rice would qualify for that warning. It means next to nothing.", "This warning is issued in California - if you eat the plastic, stainless steel of the product you'll increase your risk of cancer, etc. \n\n\nI have seen even guitars with this label. Please dont eat your guitars or food containers.", "It’s prop65. They’d put this label on fresh air if they could.", "Literally just drinking tap water can expose you to lead, arsenic, copper, heavy metals, etc. This is the same water they urge people to drink in order to stay hydrated. \n\nFrom the moment we're born, we're all slowly dying. Everything around us is killing us slowly. Oxygen causes issues, but we need it to breathe. Water contains bad stuff, but we need it to drink. Air contains pollution..... you get my point. It's very wise to *minimise* any risks of large exposure, but it's impractical - and impossible - to live without exposure to stuff like this. Instead of worrying about those things, I prefer to focus on the stuff I can control.....harmful ingredients in food, nutrition, exercise, things like that. These things (or lack of) will kill you WAY before a little lead in the water will.", "That label is in every restaurant, grocery store, gas station in California  etc", "Because you pay for healthcare so it creates a nice little cyclical market", "I read reproductive ham, thought it was made out of pig dicks.", "*The only way to fix it is to flush it all away.*", "The people running the FDA were in the same fraternity with the people running the junk food companies and they help each other out. Simple.", "Bro sunlight causes cancer\n\nBreathing the air in the states causes cancer \n\nVirtually everything does. Don’t stress is and mitigate the risk when you can. \n\nEat well, exercise and for the love of god wear sunscreen", "I've seen that warning on brake pads too.", "Grilled food is technically carcinogenic. So is any drink with alcohol.\n\nDont worry, those noodles are both fine and delicious.\n\nAll things in moderation.", "They probably didn't have enough packaging space to list off everything that can cause cancer in processed foods these days.\n\nLead is an interesting one though I must say.\n\n\"Fuck it\" I say, here for a good time not a long time", "Has potassium.  Potassium is great, right?", "If it helps, rice contains arsenic and consuming large quantities would likely put you at the same level of risk as the product you're looking at.\n\nAlso, bacon.", "I spent 2 nights in San Francisco and every restaurant had this warning on the door. Totally defeated the purpose of what I’m sure was originally well intentioned.", "As lots of people have already commented: I grew up in California for the first 26 years of my life, this label is everywhere; even restaurants in California have this posted. Even when new cell phone towers went up these letters were sent to surrounding communities. Used to be a joke about this that basically said “The only guarantees in life are death, taxes and getting cancer in California.”", "Cigarettes and alcohol can be sold and lead to cancer, death, etc.\n\nIt is called freedom of choice, you don't have to buy that product. You can choose to eat organic or eat complete piles of boxed food. Up to you.", "If you buy a stainless frying pan, the California warning is on it.  It's literally on everything.", "You already gave cancer, don't worry.", "P65 law means that if any product in a factory contains a dangerous ingredient, then every product leaving that factory must be labelled as potentially harmful. \nBecause there's no guarantee that the product wasn't exposed or contaminated by the dangerous ingredient, even though the ingredient isn't used for that product. \n\nSo basically, the noodles are not made with lead. But there is a potential risk that they might have been exposed to lead because something else in that factory has lead in it.", "California Proposition 65 requires that statement for products that exceed the limit of lead of 0.5 mcg/day. It's really nothing to worry about.", "Everything in California has that label you are fine", "The DOSE makes the poison\n\nLook up dihydrogen monoxide (H2O) if you need to really wrap your head around why this is important to keep in mind", "California has this label on everything. I’m not even kidding. I’m surprised they haven’t labeled the sidewalk at this point.", "Because this is America and no one gives a fuck about us. Just max profit", "One of these said a tennis ball caused cancer", "Once bought a nice top that was made in America and the label said “this material contains toxins that can cause cancer” lol threw  that shit away. Such a shame.", "About anything is either a known carcinogen or a potential or suspected carcinogen. I think for now we have like 2 to 3 known molecules proven *not* to cause cancer. Those and water of course. Even oxygen leads up to free radicals so it is a possible carcinogen.", "If you read enough labels, you’ll find that California believes EVERYTHING causes cancer and/or birth defects.", "Prop 65 basically requires all products shipped into California to be labeled as \"MAYBE\" having cancer causing shit in it.", "They sold Teflon cookware for 50 years without a warning so......", "That label is on basically anything that might be sold in California. It is therefore meaningless.", "Anything grown in natural soil has to have this label because of the natural minerals that occur in the soil. There may be almost no chance it will affect you but they still need to have the label because of naturally occurring iron and stuff.", "Hello California! \n\nThe level of led this label requires is so insanely small it even needs to go on shit like strawberries.", "I ordered a computer from California and it said i would get cancer from the case", "I live in Ontario, Canada, and even we get the State of California warning labels on everything.", "Don't tax your noodle, when it comes to noodles.", "Because the state of California had super insane standards about what is and isn't allowed and what has to have a warning label.", "P65 is nonsensical bullshit 99.9% of time.  If you go into a *car dealership* in Cali, they have Prop 65 warnings on the door.", "Everything in California has that label on it lol", "Let me guess you’re in California?", "They put that on everything almost.", "Context is important. This is California’s overly bullish health policies. Eat your noodles.", "If you look closely that warning is on absolutely everything", "I've had this come on so many things. It's just a California thing that has spiraled hard.", "If you put that label on damn near every single thing to ever exist and they have then simply use the words, can or may or potentially you’d be 100% right….. on atleast some of the things you’ve labelled.", "P65 warnings are in absolutely everything. They’re pretty much meaningless without any context behind them (which there never is in the label)", "Lol even saw that on a shower curtain", "Literally everything in California has a prop 65 warning now. I'm a big proponent of strong regulations, but its a prime example of when things are taken too far.", "i think thats even on my nintendo switch box 😭", "I always wondered the same thing. But breathing is a P65 warning too so there’s that 🙄🥴 (sarcasm)", "They put that on our local strawberries. It's fine dawg  there gonna start putting these on bottles of water and the air we breathe", "1st time?", "I mean, red meat is classified as a carcinogen and no one bats an eye.", "California requires this label on anything that COULD do this… in 7,000x the normal dose, in rats.\n\nIt means pretty much nothing. People aren’t rats, and you’re not going to get cancer from one serving of noodles.", "Can someone explain me to me the whole California warning thing? \n\nOn a fish sub, the aquarium filter had this warning. Like WTAF?", "America..fuck yeah!", "Well Tuna contains mercury ... so...", "Because lead is naturally occurring in soils and water making foods and products with the chance of lead since it's literally in the earth and everything we eat and use comes from the earth.", "im thankful for all the replies but i now know that this is normal in california! 😭 you can stop commenting the same things", "Lol they sell cigarettes and alcohol dont they?", "More like be glad that the California government is warning you about the things found in all food everywhere these days. I'd be more concerned by not being warned.", "If you don't live in California then ignore because it does not apply to you", "According to the State of California living can be hazardous to your health.", "Or you could think this way.  Everything is toxic and everything is killing you.  Likely you'll be surprised to see you'll live for quite a long time.", "Better to die free than live as a Californian.", "America built different 🦅", "everything in cali gives you cancer", "Wow where did you find those ? It's a good thing you read labels !", "same reason fidget spinners are still legal. government is actively working to destroy us.", "You have a higher risk of suffering some sort of issue from the fact that you're eating ramen as opposed to contaminants. S**** barely digestible", "I would be more worried about the level of rodent hairs that are permitted", "Coffee and French Fries require that warning here. You’re fine. Enjoy!", "All food in California warns that it can cause cancer/birth defect/harm/other issues", "This is in all food, CA just has a law where it has to be labeled", "It means there might be an atom of lead in there somewhere. Maybe two.", "That warning is on literally everything. If they could stamp it on the air outside they would.", "surprised they having put up a prop 65 warning for breathing air at this point.", "Similar warning is on the rooster sriracha sauce as well.", "It will be fine. Just consume it outside of Cali.", "It’s required to be on there due to California law. Most stuff is “known to cause cancer” nowadays (obviously in different severities) but this is a food product on a shelf. FDA approved because the chemicals it’s warning about are in such small amounts that you’d have to eat multiple packs of these noodles daily, likely for several years, before an issue would develop for *most people*\nI totally get being concerned! You’re safe to eat them, just don’t make them all you eat and you’ll be no worse-off than any other American"]}
{"title": "this is what i think it is, right?", "selftext": "", "url": "https://i.redd.it/5mjuwx8w0l6b1.jpg", "created_utc": 1687009357.0, "score": 1619, "author": "honeybunz916", "num_comments": 110, "permalink": "/r/foodsafety/comments/14brh92/this_is_what_i_think_it_is_right/", "html_title": "", "top_comments": ["Shutting this down because name calling has started. \n\nI agree with the users: Best to bring that to management's attention, and they can decide what to do with it. It is likely something that should not be there and the food should not be sold. If it has been sold I think that is a reason to return it. \n\nThere's also possibility that this is tapioca disease (I know I know, the name is really silly). \n\nCould also just be a grain of rice, but I think because of the placement that is unlikely.", "My glasses are too weak and I thought the middle piece was a severed finger… I guess a maggot is slightly better?", "Yep. Looks like a maggot. Be discreet and take it to the manager", "Would be funny if it's just a grain of rice with a blackened end.", "Which shop was this in? \n\nAnd to me that’s defo not a sesame seed…", "Sushi-grade fish must be treated with freezing in order to get rid of little parasites like this. Clearly this didn't happen lol recommend not buying it, notify the vendor if you're inclined to do so", "Complain and get £50 voucher", "Yup, looks like it. Time for me to stop eating supermarket sushi", "Could be the chill cabinet isn’t working and food is rotting bc of this. Definitely report it asap before someone gets really bad food poisoning", "I can’t be the only one who can’t see anything right", "Why wife wouldn't have noticed it and eaten the whole package. Gal is like a grizzly bear when it comes to fish", "[removed]", "Is it true that some states require sushi going into a quick chlorinated water dip?", "Does it move? Ewww", "Where is that? I need to know so I can NEVER shop there. Tx", "Lol is it moving? Just politely talk to a manager.", "IMO more likely to be a sesame seed (from what I can tell in pic as it seems too smooth and tear drop shaped) than a maggot, but still not good since its a relatively common allergen.", "That is definitely not a maggot lol", "Well in general, don’t buy convenience store sushi. Take it from an expert", "Looks like a sesame seed.", "I think it isn't what I think you think it is, I think.", "For all you know it’s a slit through to see the rice?", "Maggots don’t have a black head", "Absolutely need another picture to confirm", "Yeah that’s a maggot. Never trust supermarket raw sushi", "Don't make too much of a fuss or everyone will want one...", "I guess it depends on what you think it is, if you're assuming it's some kind of mythical creature, then no, I'd have to disagree", "Sure", "[removed]", "Extra protein", "Looks like more protein", "O noo I hope you told the staff that's nasty"]}
{"title": "I didn’t eat this part but what the fuck happened here? Ive never seen a rotisserie chicken like this.", "selftext": "I didn’t eat this side of the chicken but i did have some of the other side.", "url": "https://www.reddit.com/gallery/14sjnfd", "created_utc": 1688672789.0, "score": 1563, "author": "BonesAndSalt", "num_comments": 49, "permalink": "/r/foodsafety/comments/14sjnfd/i_didnt_eat_this_part_but_what_the_fuck_happened/", "html_title": "", "top_comments": ["Butcher here, it looks like the poor thing had a broken breast bone before it was slaughtered. In most cases an animal with an issue like that will be slaughtered but then butchered into pieces so said blood and bruising can be removed. \n\nIt looks like this one was missed and sent off as a whole fryer chicken, or someone was lazy on the line and just didn't care. Unless of course there is a smell to it, if there's a putrid smell then perhaps there is something else going on with it.\n\nI wouldnt eat it, return it for your money back, it's inedible", "It’s a bruise. Look at the underlying bone and I’m willing to wager that it is broken. broken bones bleed a lot, this chicken suffered a fracture just before slaughter, bled into the muscle and formed a hematoma which was eventually cooked. I’s safe to eat but rather unappetising.", "The chicken lived a hard life before it was slaughtered only to have its body thrown in the garbage.", "The chicken was handled poorly while still alive and had a broken bone.", "I'm getting closer and closer to be a vegetarian", "That’s what happens when they throw chickens into the wall of the truck as hard as they can", "Get your money back.", "The blood seeps from the bones into the muscle.", "I was getting tired of chicken anyway", "Others already answered, but I’m curious where you got this chicken!", "Take it back. Omg! don't eat that", "Vein exploded", "stop buying meat from these places and choose a local farm that has quality meats, grass fed and finished beef, pasture raised chickens etc. Use where you spend your hard earned dollars to send a message to these places that don’t care about quality control.", "Dry cooked blood perhaps?", "Ah shit is that Costco?", "does not look right", "Looks like a tumor", "[removed]", "[removed]", "Rotisserie chicken is normally trash. Stop eating garbage", "Either a tumour, or it was cooked too hot, too fast."]}
{"title": "What's happened to these \"black and fishy\" peaches?", "selftext": "", "url": "https://i.redd.it/wtu9vbj5948b1.png", "created_utc": 1687677998.0, "score": 1557, "author": "16-Bit_Degenerate", "num_comments": 114, "permalink": "/r/foodsafety/comments/14ifv2l/whats_happened_to_these_black_and_fishy_peaches/", "html_title": "", "top_comments": ["Shutting this down because I think if we keep talking about the black peaches, they **WILL** kill us all out of spite. \n\nAs users have said the can was likely damaged and what you are seeing here should not be eaten by anyone.", "Dented. Botulism. Horrible painful death if eaten lol", "Isn’t this sploosh?", "Seam damage on can. Air got in and this is the result.", "can was no longer sealed so they have essentially had bacteria be able to enter the can", "I don't know but I can't help thinking of [this scene](https://www.youtube.com/watch?v=L7LzMlo8s34&ab_channel=Uploads2)", "Good Ole squid ink peaches.", "This actually made me gag", "It looks like oil and peaches", "The original post said its botulism, very bad if you eat it.", "Original post here: https://www.reddit.com/r/Weird/comments/14ibjba/opened_a_can_of_peaches_and_they_were_black_and/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "They aren't supposed to be like that. I've never seen peaches come out black. Probably just get a different can and throw that one out.", "Looks like someone got their sploosh recipe wrong", "Isn't that what killed Tasha Yar?", "You struck oil", "The culture of the black liquid from Prometheus", "Return of the Living Dead. Tar Man.", "Not the worst looking thing I’ve seen on this sub.", "You can put this in your car", "Botulism!", "You'll have to ask the presidents of the United States about that one, they're the professionals on Peaches in cans put there by a man.", "Fresh & juicy", "Walking down the beaches \n\nRun away from them peaches", "🤔🫢🤢🤮", "You probably shouldn't eat them", "I'm pretty sure that's sploosh.", "Most comments day it's botulism, why is is black?", "Ah, a can of Botulism. I seriously hope you have not had any of that touch you or ingested?", "[removed]", "Don’t eat tanned goods brought in the 70s!!", "Throw away the house", "https://www.reddit.com/r/Weird/comments/14ibjba/opened_a_can_of_peaches_and_they_were_black_and/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "[removed]", "They look fishy .", "Malcom in the middle taught me better than to eat that", "They look pretty bad but tell s ...what did they taste like?", "Botulism stew! Yum", "Oh- A little bit of blackened peaches never hurt anyone!!", "I just opened a can of peaches an hour ago hahahaha that’s putrid", "Something happened to the can to allow oxygen to reach the product.", "Straight from those skyrim dark books", "I never knew this was a thing. Cans are now going to reek havoc on my OCD. Sigh.", "SPLOOSH!!", "Idk, but if you mix it with onions and put that shit in your shoe, it'll get rid of the stink real quick!", "r/nope", "They were packed with used motor oil instead of syrup or water.", "It looks like the peached from 'Holes' https://youtu.be/l1xIX5toEOQ", "The black plague", "Hopefully what happened was they went into the trash after seeing them.", "That’s the golden ticket! You get to tour the CDC.", "DON'T EAT THEM!!! 🤮 They look disgusting", "Date expired in 1927", "It’ll be fine", "Petroleum peaches!! Ma favorite!", "why are they “fishy”?😭", "Can you just taste it just for shits and gigs?", "Idk, they look OK to me.", "i usually grab the ones in syrup, but i guess some come in oil.", "Symbiont. You're about to become Venom.", "Thousand year old peaches.", "I suspect the tin was dented and the internal lining was compromised meaning that the sugars and acids went to work on the metal."]}
{"title": "Put chicken and tater tots into the air fryer last night and cooked them, and forgot about them til this morning. Still safe to eat?", "selftext": "", "url": "https://i.redd.it/e1h8m7gacd9b1.jpg", "created_utc": 1688223859.0, "score": 1416, "author": "bagel_nuggets", "num_comments": 282, "permalink": "/r/foodsafety/comments/14nxb2r/put_chicken_and_tater_tots_into_the_air_fryer/", "html_title": "", "top_comments": ["Locking thread because its out of control.\n\nPerishable food should not be in the danger zone(40f to 140f) more than 2 hours of saving for later or 4 hours if consuming and tossing.\n\nanecdotal evidence is not a good source. just because you haven't got sick now doesn't mean you won't get sick.\n\nyou can't tell if food is safe just by smell. smell will tell you when it's bad but not when it's safe.", "That’s a funny way of saying you got drunk and passed out.", "[removed]", "Generally speaking, once you cook something you should refrigerate it as soon as possible.\n\nIf this is not possible, you should consume within two hours.\n\nI'm not saying you *will* get sick, but I am saying it's not worth the risk for some chicken and tater tots.", "I have eaten chicken which has been unrefridgerated until the next day more times than I can count when I was in my early 20s and never had a single issue.\n\nThere's no guarantee one way or the other, and everyone will rightly tell you to err on the side of caution, particularly with chicken.\n\nBut you can bet I'd be eating it.", "Not at all.", "I'd eat the fuck out of that. Pop the oven on for a few minutes, you're good to go.", "Definitely not", "I'd just heat it up again if it were me but, I'm poor and don't like to waste food 🤣", "No not at all", "Yes!! I’ve done this and have reheated for breakfast the next day!!  Did not die!!", "I’d eat it without thinking twice.", "I never realized just how many people go to the trouble of heating up food just to forget about it until I got on Reddit - how? I mean, just, how? Did you forget you were hungry? Do you throw money away in other areas of your life as well?", "It depends how poor you are. The poorer the more sketchy food you eat and find out it won’t kill you. I’m not a doctor tho", "Hard to imagine how the human race managed to survive a million years without their Frigidaire.", "Of course its still good lol wtf is wrong with people. Its cooked. Its been like 10 hours.", "Yes", "I heard that you shouldn’t have meat out for longer than two hours in room temperature. Of course you should refrigerate immediately, but after two hours it’s definitely not safe to eat", "No!", "No", "Trash it", "No.", "Nope", "I'm not a professional but I would eat it.", "I'd eat it", "It’s safe. Don’t be a wuss.", "Food hygeine and safety will say no. But they'll  be fine, warm them up properly", "Stoner move for sure lol , id still eat it. And i have eaten day old still in air fryer food and im still alive.", "Yo air fryers are perfect for storing cooked food overnight for a pleasant morning hangover surprise! Do not chuck that quality nosh! Bosh it down with hair of the dog!", "I would eat them. Should be OK. Just heat them back up BEFORE you start drinking. 🤣", "That’s brunchinner bruh 💀😭👌😮‍💨 U Gucci", "I’d eat the heck outta it", "It's heavily processed (salted) and in a closed container; 99% chance it was fine", "Remember the days when you cooked a full meal and just forgot about it?", "Id eat it", "Yea they good", "They'll be fine", "I'll lean-to the side of it's probably okay. I'm assuming it got baked thoroughly, and the oven door was closed the entire time, so basically had a sterile container it was left in.", "Even if it ain't, I'd destroy them and ask for more", "Crank it to 350 for a few minutes and enjoy.", "Meh just throw it in the microwave for a bit, it'll be fine", "Those things were likely precooked and then you cooked them again, plus they’re loaded with salt, I would just reheat them again and eat them. They’ll be a bit dry but honestly I think people are too paranoid about food poisoning these days. My parents will literally just smell and look at food to judge whether it is safe or not, and they’ve never gotten food poisoning to my recollection. \n\nOr just don’t eat this junk food anyways.", "Done it a 100 times . Never got sick", "30 seconds in the microwave will kill the bad stuff. I would eat them", "There is so much crap in those probably will last 3 days left out lol! I’d eat it but to each it’s own.", "Nope.", "I see a ton of people saying you’ll get sick, but I disagree. I’ve done this ~10 times and never had the slightest gastric distress, and see other comments claiming the same. I guess the door being closed helps idk", "Food safety will tell you no, but personally I wouldn’t have given it a second thought before I finished the entire meal. Modern day preservatives aren’t exactly healthy, but they are powerful. Plus it’s a fairly dry meal, food spoils fastest when there’s moisture.\n\nI’m not going to tell you definitively that it’s safe, but like I said, I personally wouldn’t have even thought about it.", "\nTLDR: No.\n\nIf the chicken was par cooked frozen tendies before you even cooked them last night and the toter tots were par cooked frozen tots then reheating them is considerably less risky but still a risk nonetheless. I personally may very well reheat it and eat it because I find it more risky to use some public washrooms than to reheat tendies and tots that were left out overnight, but that is not my advice; the answer is no.", "People on this sub are so fragile, How do you think humans survived this long? We aren’t delicate little flowers. It’s cooked heavily processed chicken and potatoes with enough salt in it to preserve a dead body.", "Most people here seem to be pussies and need to grow up. Heat it again to kill bacteria and eat them. It’s not raw food. People need to grow tf up.", "[deleted]", "I would. Just heat them up. I'm a nasty mofo though with an iron stomach. I also eat a lot of fermented foods though. I've put some dirty things in my mouth during my time. LMAO", "Seems like an extreme amount to forget.", "Technically not but I would", "Fried foods should be ok assuming below:\n\n\nFirst fry made internal temp at above 165F from the restaurant/home.\n\n\n\nSecond fry/air fry reheated food to 165F internal temp. \n\n\n\nAssuming you did not open the oven, no outside particles (mold, bacteria, etc) will go in the oven. \n\n\n\nAlso, dry crust/coating/oil keeps bacteria out and wont penetrate the moist interior of chicken/tots. \n\n\n\nFrying the second time usually drives the moisture out on the surface and reduces risk of organism growing on moist surface.", "I’m nasty i’d eat it\n\ndid the same to a chick fil a sandwich a few months ago", "Not a good idea but…personally I would probably reheat them and eat them anyway", "Probably not\n\nBut I would eat them anyways", "i’d still eat them. but i have the stomach of a goat so", "EAT IT", "YES ur fine", "Nuke ‘em again, 99% chance you’ll be fine overnight, esp if they’ve been sealed up in there so no dirt/dust/bugs can settle. Over a 24 hr period or a weekend? Toss them", "Sorry to be 'that person' but I wouldn't consider those over processed things to be ever safe to eat.", "Yes, the air fryer sterilized everything inside and created conditions on the surface of the chicken that  generally wouldn't allow for any bacterial growth in any meaningful quantities. You created a life desert on there.", "Here’s my time test. Heat it up! Makes scent more potent, if it smells rancid throw it out.\n\nEdit to add disclaimer: this is an opinion, not food safety advice.", "Those things are probably so full of salt and antibiotics, they’re probably safe to eat, but why would you want to?", "I’m waking up hungover and eating that whole tray 10 times out of 10 personally", "No. Look up botulism. Anything left out for over 2hrs becomes a health hazard. Unless you are fond of diarrhea and potential food poisoning then toss it out.", "You’ll be fine. Just crank that bad boy on another time to heat them up.", "Would eat.", "I’d eat it", "Probably not the best thing to eat for breakfast but I highly doubt you'll die or get seriously sick from it. I would heat it up again, bring it up to temperature to kill any bacteria that may be on or in it and eat it. It looks too good to waste lol.", "I bet they are fine, most air fryers keep them hot, and by the time it turned off they were prob only chilling at unsafe temps for a short time.   \n\n\nIf it were me id prob eat them, just heat them back up first", "i eat stuff thats been left on the counter for hours and hours after being cooked. this would be fine.   \nhell ive left stuff on the counter for days and ate it and thats never made me sick.", "No.", "Yes, if you want diarrhea lol 😂", "pot makeshift mindless fertile cable bewildered existence ruthless paltry sip\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "No.\n\nbut ... \n\nI would eat.  I might slice up & pan fry.\n\nAlso, no.  It's junk food.  High carb = instant sugar in your blood = insulin spike = fat on your liver = one more step down the path to tired / overweight / unhealthy / diabetic.", "No, they are deadly.   Let me dispose of them for you.", "No", "depends how hot they have been while sitting there", "Good for dogs!!", "Pls don't eat this", "Yup 👍🏼", "Lol you are completely fine. I do shit like this all the time lol.", "It’s fine.", "Yes I do it all the time", "Get it hot again you'll be fine", "i eat fries that sit out all day i cant imagine this is any different", "Honestly I bet the tator tots would be fine if you heat them back up. I wouldn't touch the chicken even though it's heavily processed", "It'll be fine. Microwave to hell to kill any lingering bacteria. Smother in mayo and BBQ sauce and enjoy", "They will be fine", "Anything heavily processed like this can be considered dangerous after 4-6 hours at room temperature. \n\nIf it was unbutchered, or a local butcher it would last longer but the factories are pretty dirty and that causes food to go bad faster", "Those are packed with so much preservatives and oils. I'd eat em", "its perfectly safe to eat them. just go ahead and refrigerate after.", "just eat if, who cares. i do that ahit all the time.", "Meh. I'd eat it.", "Could you heat it back up to kill anything unsafe?", "Chances are you’re fine."]}
{"title": "Someone requested this", "selftext": "", "url": "https://i.redd.it/7cgfnvf96dhb1.jpg", "created_utc": 1691708614.0, "score": 1254, "author": "3_T_SCROAT", "num_comments": 22, "permalink": "/r/foodsafety/comments/15nrfsn/someone_requested_this/", "html_title": "", "top_comments": ["I don't like Campylobacter. It's coarse and rough and irritating and it gets everywhere.", "More food safety memes please!", "Somehow I've never felt closer to Padme", "\"There is no better way to spread the goals of food safety than through spicy memes.\"\n\n-Trevor Suslow\n\nEdit: probably. I only met him a few times.", "Yessssss! Thank you!", "Brine being salty water right?\nRight?", "I only just saw that post and this was _exactly_ what went through my head lol", "Along those same lines, who can forget [this famous scene?](https://imgur.com/a/NDomAFa)", "I cackled", "Well if nothing else I finally get how this meme works.  But if y'all don't mind, what are the images from?", "That was me yesterday when i saw that brine post. lol", "Haha! Perfection", "LMFAOOO", "I'm so glad y'all made this😭", "🤣🤣"]}
{"title": "Safe to eat? Expired July 1st. Family insists on eating these sausages. I tried to convince them that the bloating is caused by bacteria but they said “bacteria is in everything we’ll just cook em”🙄", "selftext": "", "url": "https://i.redd.it/7mnbqek01mbb1.jpg", "created_utc": 1689200732.0, "score": 1169, "author": "unhappyangelicbeing", "num_comments": 121, "permalink": "/r/foodsafety/comments/14y2qaf/safe_to_eat_expired_july_1st_family_insists_on/", "html_title": "", "top_comments": ["locking comments due to rude and mean comments.", "Yes, cooking will kill the bacteria. Yes bacteria is in everything. The problem is that the bloating is from bacteria actively digesting the sausages. What makes us sick is the toxins excreted from the bacterial metabolism, not the presence of bacteria. It’s not safe.", "That puffy package is a giant red flag. Please DO NOT EAT!", "Literally had this happen in my family before. Everyone had it coming out both ends, except one of my sisters, who didn't have the sausage.\n\nIf you can't convince them, *definitely* don't partake yourself.", "[removed]", "Hopefully the stench of rotting meat when they open it will put them off", "Not safe to eat.", "My chef training teacher in high school always said, \"When in doubt, throw it out\"\n\nI still live by that to this day.", "I wouldn't - do you know if you have an inheritance - do you like them?", "Toxic sausages", "If meat is getting bloated then it's bad. It can bloat from being aged or left out of refridgeration for too long. Fresh meat sausages have a 5 day shelf life at best. Processed sausages like eckrich or hillshire farm are ok for about a week after expiration because of all the preservatives. I was a butcher for 8 years, if i wasnt cutting meat i was making sausage.", "[removed]", "Bacteria produce toxins that aren't destroyed when heated.  The bacteria will die, but all the toxic bacteria shit remains.  That's why you can't cook spoiled stuff.", "[removed]", "I'm this situation I go off the raw smell test 🤷 smells bad/rotten = no eat, smells normal = eat. if your not good at this game expect 3 days pissing out your asshole", "Was the packaging like this when you bought it? It could be MAP (modified atmosphere packaging). Not helpful in this moment, but if you ever see your food is coming up on the use by date and don't intend on using it soon, then freeze it.\n\n&#x200B;\n\nedit: i wouldn't eat this though, it's so far past the date. Better to just chuck it than get sick", "Just don’t eat them. You adequately warned them.", "Not the kind of sausage party for me. Learned that lesson. Do not eat.", "With the same logic, any meat from any time in history could be cooked and eaten at this moment, even if the smell is making you vomit. They do what they want, but just get away from that.", "Your family must love vomiting and diarreah as well as hospital visits", "My dad's the type that thinks a little bit of bacteria is good for you, makes you strong. Then again I rarely ever see him get sick and he smokes cigarettes and drinks beer. I'm the type that realizes there is like bacteria in the soil that if you eat too much you can get like lockjaw. Meaning it doesn't always make you strong. That and flesh eating bacteria. I don't think that makes anybody stronger", "Don’t eat them. I’m not at all conservative about this but THIS. Is not safe. Toxins can’t be removed by heat.", "I didn’t see anyone mention that this could be a production/packaging date as well, depending on the manufacturer.", "imagine the smell might change some minds.", "Safe enough to be a BOMB", "Once you open those packets (please don't) and you all SMELL it... it may dissuade them.", "Did they eat it?", "Stock up on Gatorade, ginger ale and crackers, your family will need them", "If frozen I'd eat but not in fridge that long hell no", "If it was cured, I'd totally cook and eat them, but I don't see any nitrates or nitrate sources on the ingredient list, so it's a pass for me.", "Just smell it", "[removed]", "Food Products do not have an expiration date: It's A \"Sell-By date\" that tells the store how long to display the product for sale for inventory management.\n\nIt is not a safety date /expiration date. The “Sell-By date\" is the last date recommended for product use at peak quality.\n\nBaby Formula is the only product sold with an actual \"expiration date.\"", "[removed]", "Oh hell nah", "Don’t eat them and make sure there’s plenty of toilet paper in the house, it’s gonna be needed", "Toss that crap!!", "How big a family are we talking about here? Are there enough bathrooms to go around when the squitters set in?", "I wouldn't eat it. Prob wouldn't even taste right imo.", "Nice hiss!", "this is why i basically just store meat in the freezer unless i have plans for it within a day", "Straight garbage. It's pork and will give you food poisoning assuredly", "Cooking kills bacteria but cooking does not destroy toxins like botulinum. I personally would not eat that.", "Would love to hear an update on how your family is doing after eating these——you’re definitely making the right call in not eating them!!", "Nope", "naaaaah lol", "Let them eat it", "Do not eat that.", "Are you in their will?  If so, let them enjoy their sausages.", "Run", "[removed]", "I wouldn’t risk it. It’s not worth it", "Dans game"]}
{"title": "Hard boiled eggs. It doesn’t smell bad. Is this safe to eat?", "selftext": "", "url": "https://i.redd.it/yg8m3djhda7b1.jpg", "created_utc": 1687316249.0, "score": 1124, "author": "Biancayeon", "num_comments": 75, "permalink": "/r/foodsafety/comments/14evghb/hard_boiled_eggs_it_doesnt_smell_bad_is_this_safe/", "html_title": "", "top_comments": ["locking the thread because people are being rude and OP has been hopefully answered.", "Normally you have to decide whether you want chicken or egg for dinner. You get both! Lucky you :)", "Balut. You've got a fertilized egg. Edible, if you're brave enough.", "I mean if your into eating part formed chicken chick  then yes but looks like its fertilised \n\nIt is a common dish in Asia, but personally I'm not into it, the look puts me right off", "I wouldn't", "[removed]", "Well??? Did you??? I gotta know!", "Probably alright but to be honest you’ll probably be better if that goes in the bin", "[removed]", "This came before the chicken *or* the egg.", "Guy I'll get u another egg but definitely throw that one", "I clicked on this thinking it was a video and just looked at the screen in anticipation lol.", "Hatch it and let bro live with you", "Do you like chicken?  I don’t enough to eat a partially formed baby one.  Lol", "[removed]", "[removed]", "When in doubt, throw it out.", "Balut", "If things are that tight or your that hungry you need to eat it to survive go for it bud", "…which came first?", "Did OP eat it?", "If you are in Vietnam, then it is.", "[removed]", "[removed]"]}
{"title": "If one strawberry is moldy, are the rest safe?", "selftext": "I got these two days ago. \nI removed the moldy one right away, and the rest look ok\nI haven’t eaten them yet though - \n\nshould I?", "url": "https://i.redd.it/bx8qi5jjcd8b1.jpg", "created_utc": 1687788096.0, "score": 934, "author": "Molly-Grue-2u", "num_comments": 27, "permalink": "/r/foodsafety/comments/14ji5vz/if_one_strawberry_is_moldy_are_the_rest_safe/", "html_title": "", "top_comments": ["Locking this because people are begining to get berry mad. \n\n[source here](https://content.ces.ncsu.edu/botrytis-cinerea-botrytis-fruit-rot-and-blight-on-strawberry)\n\nYou want to remove the bad berry, and then the remainder are good. This particular pathogen is typically only bad for immunocompromised people, so I would not worry too much. Yes a low amount of spores will have spread to the other berries but as they are not visible yet the total pathogen load will be small enough that your body will not notice it.\n\nA lot of the users got this answer correct. A couple others are saying the berries are not good, and technically yes they have gotten some of the same rot on them.\n\n[Additional information, good sources at the bottom](https://www.eatortoss.com/what-if-just-one-berry-is-moldy/)\n\nEdit: spores will be spread. Not sports. The sports have already spread.", "As per the USDA:\n\nhttps://ask.usda.gov/s/article/What-if-I-find-moldy-fruit-in-a-container-with-other-fruit\n\nDirect Citation:\n\n“Mold can penetrate and grow inside the soft flesh of fruit where you can’t see it. Consuming moldy food can cause allergic reactions, as well as respiratory problems. When you find a few moldy pieces of fruit inside a container, throw out the moldy fruit and any pieces of fruit that are directly touching them. Take a close look at the remaining pieces of fruit: if there are no signs of mold and the fruit is not overly mushy, thoroughly wash the fruit prior to consuming.”", "I have eaten the rest of many cartons of strawberries with one mouldy one for years to no ill effect", "To try and prevent this in the future, give them a vinegar/water bath (keep the stems on) and dry before putting in an airtight container. It has always kept my strawberries fresher for longer. I do that with all my fragile berries and it works great!", "Pro tip, rinse them in white vinegar then cold water when you get them home. The acidic wash helps to kill spores that would become mold!", "safe to eat? probably…will they also have mold spores on them?? yes", "I’ve never seen a crate of berries that didn’t have one moldy item \nWould eat the rest after a rinse and sorting", "Just check each one if it not mushy or got mould on it I can't see a problem.", "If you’re allergic to mold, unsafe. If not, sure", "Absolutely fine. Source: Me. I've bought 1000's of tonnes of fruit and veg in my career as a fresh produce buyer.", "No", "The fluff are the reproductive spores which grow once the hyphae are developed. They are all mouldy by the time you see one fruiting.\n\nNot safe.", "drunk worm hateful scary frightening political boat sloppy steer foolish\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "don’t touch them, the moment mold is noticed in the container it’s already spread and penetrated the rest, may not be visible but still there"]}
{"title": "I saw dead, brown worms on my rotisserie chicken I bought today. I already almost ate the whole chicken. What worms are these?", "selftext": "", "url": "https://i.redd.it/rgb1aqls095b1.jpg", "created_utc": 1686428282.0, "score": 909, "author": "Blocky_Lizard", "num_comments": 240, "permalink": "/r/foodsafety/comments/1469z5z/i_saw_dead_brown_worms_on_my_rotisserie_chicken_i/", "html_title": "", "top_comments": ["I'm not a food safety person, but reddit likes to show me this sub for some reason and I raise my own meat chickens. Those are baby feathers and hairs. They're somewhat difficult to pluck out, especially using a machine, and the reason it's rare to see them in the food supply is that they're pretty much clear on a white-feathered chicken, which is the majority of the meat chicken market. This is a very normal appearance for a dark-feathered chicken that didn't get a perfectly awesome pluck job. Still kinda off-putting, for sure, but also not unsafe. (Also I'm pretty sure if the chicken was bad enough that it had worms growing on it, it would taste and smell atrocious. Rotten meat smell is unmistakably awful.)", "They could be bits of feathers", "Feathers. You're good, and yes it's safe to eat, but maybe will go down better if you pull them. 😉", "Those look like veins/where feathers had started to form before the chicken was killed; before they emerge from the skin they're just little pockets of keratin and blood. Before they come out of the sheath we all them bloodfeathers because if the sheath is broken before the feather forms fully it will bleed like crazy. You're just looking at some old blood stuck under the skin that wasn't able to be drained.", "Did you drop a rotisserie chicken on your keyboard?", "I could be wrong, but I don't think they are worms. If it's a fresh chicken that tasted good, I reckon it's unlikely.", "Regardless of what they are this picture makes me want to vomit.", "blood vessels?", "This looks like hair to me? I don’t know from where or who’s as I know nothing about raw chicken, but I have textured hair that looks pretty much exactly like that when it sheds/in the shower.", "They look like either blood vessiles which I don't think so, or just fine feathers", "Chicken feathers", "Like that’s actually the remainder of its feathers. That poor chook had dark black or brown feathers.", "Feathers, not worms.", "Ate half a green worm while eating coleslaw at a picnic when I was about 10. It had a very distinctive taste. It took me 40 years to try coleslaw again, inspecting every forkful.", "This is calamus and little feathers that were cooked into skin. \n\nHamatospiculum flagellispiculosum is the only \"worm\" that I know of that will affect muscle, but you won't really see them, they are tiny, and not infectious to humans.", "Why is this guy eating off of his  keyboard?", "Looks like cooked blood to me. No harm, some fowl! 🙃", "Bruh I thought you had chicken all over a keyboard", "I noticed the worms exculsively on the skin from the bottom of the chicken, but I did not eat the skin containing them. Do I need to worry about getting paralysis?", "Ive been a cook for thirty years and those are definitely veins. Still kinda gross tho", "They're a rare type of worm called veins......", "Looks like a parasite(s) to me", "I would assume parasite worms that lived in the chicken. Just as well you didn't eat but check your stool for anything or go to the pharmacy and take the deworm tablet. It should be fine cooked but they can be resilient.   \n\n\nI remember I had worms as a kid. After the tablet, it just killed them all.", "Those look like parasites to me", "Looks like parasites to me! 🤢🤮", "They're parasites. All conventional meats and fish have them.", "Is that not just veins?", "Blood vessels", "Veins I think", "Maggots maybe?\nDemand a refund, unless you didn’t properly store it…", "Looks like veins", "i hope you ate it before you saw the worms…", "Veins?", "Vascular worms", "[removed]", "[removed]", "So glad to see this is feather remnants and nothing groady!", "I don't see any worms.", "Thats disgusting\n\nEdit:nevermind my comment section didn't fully load in, so i just assumed there are worms instead of feathers", "Don't worry about it, you're already dead", "Those look like small veins or blood vessels in the chicken.", "Those are pubes", "Look like veins/ blood vessels etc.", "Um looks like hair but could be wrong or blood vessels no idea though, makes me feel sick just looking at it no idea how you ate that", "Beard hair or pubic? Probably just go with feathers if it makes you feel better. 😂🤣", "Those aren’t worms. You’re safe.", "[removed]", "just eat it", "Feathers I eat ‘em all the time", "it look like pube", "Grooooooooooooossssssssssss", "Mis-plucked feathers.", "This might be a stupid question, but do chickens carry a lot of worms? I've worked in food service and everything but I've never have heard of them being high risk. I might be worng though.", "Those are not worms.", "Those worms are bigger than my", "Them is poltergeist worms! Always in the chicken and tequila. As long as it freaks out the humans the ghosts still do it . They put our reaction on Ghost-tube and Evilgram.", "Dead feathers", "It's Extra-proteinius.", "Looks like veins I ate chicken with veins looking like that many times", "Not worms, maybe small feather particles or veins/arteries?", "You're a dead brown worm! When you eat once living things you are bound to find the things that enabled them to once live, like veins and blood vessels. Carnivores need to grow up and understand that the food they eat was once just as alive as them. I say this as a mad carnivore myself.", "You gonna have a chest burster in approx 6 hours. Lil baby xenomorph on its way out.", "Chicken with( FREE) worms ,what you complaining about", "[removed]", "Noodles", "Forbidden fibre flavour spaghetti", "That’s creepy ew I’m so sorry man", "Feathers, city slicker.", "Omg I saw dead things on the dead thing I was eating!", "Just some seasoning", "Those are harassment worms they start yelling when in the belly lol jokes idk that's gross and I might change my diet jks I want hamburger rice and corn", "I don't believe that chicken is done", "That’s why vegetarians >>", "I weep for humanity", "what duuu hellll", "Seen this on xfiles. I means you are going to be taken over by aliens.", "You need to do a Colleen cleanse and a parasite detox", "[removed]", "When i worked at a grocery store i had to prep rotisserie chickens and they had me pull the worms out if i saw them and just cook them but they were big and white. Sometimes they weren't pulled out if people missed them. They were foster farms chickens", "Congratulations on turning over 600 people vegan", "Resident evil 9", "Place your chicken in a sealed plastic bag in case health department wants to take it to their lab.  Store the sealed chicken outside in the garbage can. Contact your local health department immediately.  If you start getting sick contact your doctor for an emergency appointment.  If the sickness gets worse call 911.  Worms dead or alive are a sign of food diseases such as salmonella, liyista or eccoli.  Food poisoning is no joke and it can get worse and deadly when you least expect it.", "Have you never seen baby feathers on a chicken? I thought this was common knowledge", "Worms? Son, those are either baby feathers, hairs, or veins.", "Today I learned feathers can get stuck in chicken.", "How could you? That chicken had a family. And now he's dead because of man's greed.", "That's \"baby\" feathers. You're good.", "EEEEWWWWWWWWWWWWW", "They're veins", "I believe these are chicken worms.", "wait you mean you te some of it", "Girl that looks like a lawsuit- where did you get this from???", "Extra protein", "That’s spunk", "Looks more like hair to me.", "\"What Worms Are These\" sounds like a satanic hymnal", "Lmfao!!!!!!", "Those aren’t worms, they are capillaries (blood vessels)", "I would recommend considering purchasing meat from local farms that specialize in providing high-quality meats, such as grass-fed and finished beef, as well as pasture-raised chickens. By shifting our buying preferences away from these specific places, we can support and contribute to the sustainability of our local agricultural community"]}
{"title": "Can my boss do this?", "selftext": "I work in fast food in Florida and my boss wants me to work with contagious pink eye or work on my day off (I work two jobs and I only get a day off every two weeks or once a week) I’m not sure what I should do.", "url": "https://i.redd.it/z2xtk2bv5u8b1.jpg", "created_utc": 1687991668.0, "score": 865, "author": "Weekly_Chemical6833", "num_comments": 309, "permalink": "/r/foodsafety/comments/14lndpy/can_my_boss_do_this/", "html_title": "", "top_comments": ["I'm assuming since you are posting here that you work with food. Conjunctivitis is not a foodborne illness, so the concern here isn't that people would get sick from eating something you prepared. \n\nThere is a definite risk to the people you work in close contact with however. Handwashing is important, but not guaranteed to prevent you from leaving a contagious little present on everything you touch.\n\nPlus, your boss is wrong. [Conjunctivitis can be spread through coughing and sneezing.](https://www.cdc.gov/conjunctivitis/about/transmission.html)", "Pink eye is extremely contagious (although not food borne to my knowledge) and I would be so upset if my coworker showed up to work with it.", "“…family member….” 🙄", "Tell them Grandma is coming and she can’t stand for more than a few minutes and someone there will have to change her diaper.", "I hate when people force sick coworkers in so that I can catch their shit.\n\nDefinitely not okay to do this.", "\"Please ask your dad to come in. If not, your sister gets out of school at 2:30. Dad and her can split the shift if need be. Let me know. Thx\"", "Where is this restaurant so I can make sure I never set foot in there, what an absolute disregard for hygiene that manager has, I can only imagine what nasty ass shit he’s probably brought through there 👀", "[removed]", "I read “I work in fast food in Florida” and stopped. \n\nI know what you’re going through, and it is so unsafe for workers and customers.\n\nI was 16 and told you can’t call out if you’re sick. In fact, it was demanded I go in *early* even when I was having diarrhea.\n\nI then got fired at 17 because I told them I tested positive for mono and my doctor was worried about my spleen and fevers; the days before, I had passed out in the drive thru area. \n\nI think about the huge hepatitis A outbreak in Hillsborough county, because people are forced to work with food while sick.\n\nI hope you find something better. You deserve better. Get well and thank you so much for being concerned about the customers for whom you prepare food.", "not trying to freak you out but one of the most recent variants of covid has pink eye as a symptom. \n\nif you tested negative for covid i still wouldn't go in with pink eye as it is pretty contagious but that's something to be aware of", "Americaaaa fuck yeah", "Not medical advice. \n\nBacterial conjunctivitis generally stops being contagious 24hrs after first dose of antibiotics is administered; however, if this is viral then it can take quite a bit longer because you wouldn't be taking antibiotics to help kill the infection. \n\nShould you still take the a few days off work? I would push for it, but I don't know your work policy.", "tell them your family has jobs", "I believe it is the employers' responsibility to fill your shift and not for you to arrange.", "A family member? Jesus Christ", "Swap with a family member lol the sheer entitlement.", "Just to add some of the new strains of covid can present with symptoms that mimic conjuncitivtus (pink eye) so for that reason alone please stay home until it's resolved. Even if it genuinely is conjunctivitis and not covid, you still don't want to risk passing it on to colleagues.", "The medical expert trumps the boss.", "Go in and then report your boss to OSHA.", "You called in. Don't even reply. They've seen it and up to them to find cover, not you.", "Report your boss to the health department!! Telling you to come in knowing that you have pink eye is a huge health and safety concern", "Nope.", "Nah Bro. Sorting out staff is your problem not my sick note issue!\n\nThat Boss is literally delegating his job to you. what a putz", "You woke up with pink eye? Wash your pillow because someone might’ve farted on it… then it also begs the question what diabolical mind would’ve conceived a notion to fart on your pillow in the first place and why?  Create a list of suspects that’s comprised of all your enemies real or imagined that would’ve had motive and opportunity to leave an air biscuit where you lay your head to rest at night.  Because if I’m right about this and I never am, then you’re dealing with an evil mastermind the likes of which… there are plenty of running around out there.  But this won’t be their first strike. I’d also replace your toothbrush.", "If u have a doctors note then you’re fine. They can’t do that.", "Biggest red flag is this asshole calling employees “family members” yikes bro, that and telling you to come in when your sick I can only imagine what a wretched little cretin this guy is. Good luck", "“Family member” 🚩🚩🚩", "Yeah, he can send you a message.", "Yea if I see a mf with pink eye making my food I'm burning the place down.  Wtf is going through your managers head lmao.", "You’re boss I assume is the manager? If so, tell them to manage.", "Ophthalmology tech here don’t work with Pink Eye. If you inadvertently touch your eye and forget to cleanse your hands everything will be contaminated ie: surfaces, products and people.  Your boss is using bullying tactics.  Once you have a doctors note you can’t return until the allocated time unless the doctor writes a different letter and more than likely they won’t.", "Text everyone you work with and tell them the boss told you can work with pinkeye and see what their responses are.  They might not want their health at risk.", "\"So, just to clarify, you are asking me to ignore medical advice and resume work?\"", "Health departments gonna have a field day with this one.", "Hell no. Report this joker to the health dpt.", "I say go to work. Make a point of telling every person you see, \"Oh, I have pinkeye but I *had* to come to work anyway.\" It will eventually be brought up to your boss. They won't have much choice but to send you home until you're better", "Short answer no he cannot. Hi Florida born here! So Florida used to be ( i think still is) a state that can fire you without reason. Save these screenshots b/c if you get fired this will provide evidence that hints at wrongful termination & retaliation. That being said lets have a mock convo on how to stand up to this guy.\n\n\"Hello Boss I have pink eye here is my sick note, I will see you on Friday\"\n\n\"Meh NO! I'm a boomer, come in to work\"\n\n\"Unfortunately I will not risk the health & safety of my coworkers or the patrons of this establishment nor my own health & safety. I have emailed you a description of my illness & my restrictions w/ a doctors note excusing my absence, I will see you on Friday. Hage an nice evening\"\n\n\"MEH FIND YOUR OWN COVERAGE\"\n\n\"Unfortunately as I am sick I am going to rest, as per my doctor's note I have emailed you while also CC'ing in your boss so there's no confusion. Finding coverage is not in my job title unless you would like to talk about potential future advancement for my work in the company, in which xase we can speak about it on Friday when I return. Have a nice night!\"\n\n*turn his messages on mute until Friday*.", "I wouldn’t want food from someone with pinkeye, just no", "cross-post to r/workreform or r/antiwrok", "Yes. Get to work or go work for someone else.", "How do you wake up with a condition and have a doctors note already?  Also calling it pinkeye seems childish and not very concerning to anyone.", "[deleted]", "I would say no, but ever since 2020 and forced jabs, seems like bodily autonomy is just nostalgia.", "Florida is a shit hole so yes, you might as well show up and contribute.", "[removed]", "Guess whose probably had more experience with this than you have?", "I think they can do this in the USA but hopefully is considered shoddy practice", "What does swap with a family member mean? Does your whole family work there or something?", "Pink eye is also painful, fuck that boss.", "\"calling our employees family members will help create a bond between our workers, we don't want them to think of us as bosses, we're.... parents. :)\"", "the fast food \"boss\" needs to stay in their lane.  they're not a doctor.  I wouldn't go to a fast food joint for medical advice any more than I'd go to a hospital to eat.  \n\nlisten to your doc.", "In Florida? Lemme know so I can not go please holy shit", "No", "Your boss can ask you to do anything, but doesn’t mean it is right or good idea. He/She would be liable for any spread of pink eye. He isn’t a medical profession and isn’t qualified to make such claims. Listen to your Dr. Asking you to switch schedule is completely fine.", "No", "So a family member will be able to replace the OP and do the job properly?", "I wouldn’t even respond.", "You’re supposed to rope your family into covering your shift? Or is boss calling the employees “family”? Is it the Mafia? Because otherwise I’m not buying into that terminology", "I feel like if a health inspector saw this they would shut the place down.", "Referring to coworkers as family members is weird. It’s the bosses job at this point to cover the vacant position. If you got ahead of it and found someone that wanted the hours, that would be cool, but I wouldn’t say your boss is being a dick based solely on this", "This prick thinking he knows better than the doctor. \n\nThe language he uses is unbelievably manipulative.\n\nOP, text back and reiterate that you won't be attending because you value the medical advice of your doctor over that of your boss, and request that he finds cover for your shift, as that is his job, not yours.\n\nOh, and look for a job with better management. \n\nHope your eye improves dude.", "A new COVID subvariant, XBB.1.16 \"Arcturus”", "Always have a note from your doctor stating that you can't work.  Also your boss isn't a doctor and isn't the person to provide professional medical advice.", "Wow that’s a lot of red flags in such a short amount of time.", "It’s the “family member “ for me 😭", "Depends on the state you live in actually.\n\nThis is the kind of shitty employer behavior that results in workers organizing into unions.", "I'd go in and rub that shit all over the boss.  Make it a habit to be next to them all day long.", "If you let them", "Test for covid too. The new strain has pink eye symptoms", "I think the only thing your boss can do is manage your time off. If there is no official time off policy in place, you're at their mercy. Making you switch shifts is in their right, but they have to realize if the other person can't cover it's not on you. \n\nPersonally, I would not work for this boss. Start looking for another job — you're better than this jerk.", "Per osha you sure as shit can’t work. They have a mandated time off that’s on the CDC’s website that they encourage and enforce. You can call osha on them. And sue if they force you to work if your job is at risk.", "Did he refer to coworkers as FAMILY MEMBERS. FUCKIN GROSS", "Family member? What kind of cult is this?", "Why is this in r/foodsaftey?", "Floriduh must have a department of health? Report this to them.", "just walk to him while scratching your eye when you get there", "Send these screenshots to the health department wtf", "*ring ring ring* “Hello OSHA? State health board? Yea I got a complaint”", "That note? \"Can't go in until Friday?\" In the US, it holds weight. Hang onto the note and don't you dare spread that crud.", "That boss should 100% not be able to do that, and he is putting others at risk against their knowledge, but unfortunately, in Florida we have something called \"at will employment\" and he can pretty much fire you or anyone else for any reason without warning. \n\nNow will they do that ? Idk, depends, but I would be aware this could possibly happen. Either way though, you are definitely in the right and they are being an asshole not understanding \n\nPink eye sucks ass too, I hope you feel better soon", "I’m sure your Labor Board or the equivalent can answer your question. Looks like it’s time for you to give them a call.", "American employment problems never cease to amaze me, here in the UK I'd tell that boss to go fuck himself I'm taking sick leave.", "Please name the restaurant so we can all skip it..", "Can you explain why the boss said \"please swap with another family member for tomorrow\" \n\nI live in Florida as well so restaurant + family + Florida = Mexican restaurant? \n\nThe boss sounds like he is trying to find a way to keep his staff numbers and help you keep your hours by offering the alternate family member to swap days.\n\nEven still you have Pink eye and should be home today regardless.", "Family member.. lmfao. Just fuckin quit.", "Are you sick? \n\nDon't go in. \n\nIf he can't live without you for 1 day while sick, then he can't afford to fire you. Also look for new jobs", "You can rub your eye all over the hamburgers and chili and as long as the customer doesn’t do the same then they’re fine.", "Love when they put it in writing.", "Give him pink eye …", "Eew!  Family member?  Actual or referring to job?  If this how the manager refers to you co-workers…just eew.", "\"pink eye is only contagious... if you contaminate others\"\nwell, duh. that's how it works.", "This why I cook at home", "Please don’t tell me it’s a sushi restaurant", "[removed]", "The weird part is the boss thinking it’s legal to just have a family member swap and come work for him", "\"Family member.\"\n\nCode for: \"We expect you to go above and beyond for no further compensation.\"", "Short staffing is a management issue, not yours. Also, there’s a reason why your boss is a fast food manager and not a doctor. Pink eye is contagious.", "What restaurant do you work at so I can not go there?", "Lmao pink eye aside. It’s your bosses job to find the replacement not yours it should never be on the lower level employees to find their own replacement. It’s his job no matter what the circumstances wether it’s pink eye, a broken leg, the sniffles, or just to hungover to come in. It’s Also their job to get rid of the employees who abuse that system so then when you are called in to fill a shift you know it’s for a good reason and not that stinky Steve had one to many beers the night before.", "The telling you to go into work was expected, but calling your co-workers' family members is insane to me unless this is a family member."]}
{"title": "why does my avocado look like this?", "selftext": "not sure if this is the right place for this but ¯\\_(ツ)_/¯", "url": "https://i.redd.it/j1q7ki2vdcbb1.jpg", "created_utc": 1689083976.0, "score": 850, "author": "Ok-Swordfish5082", "num_comments": 170, "permalink": "/r/foodsafety/comments/14ws7il/why_does_my_avocado_look_like_this/", "html_title": "", "top_comments": ["locking because of some wildly inappropriate comments", "Avocados are always picked green unless they are being sold locally.  If you pick them green they have to have at least quater inch of stem on them, or else they do not ripen properly . Often times they break off in the bins during shipping and handling and they are no good.\n\nI lived on a avocado grove and worked picking them as well. Here are some tips .. \n\n Buy your avo's with some stem on them , and if you want them to ripen faster , keep them in a dark place .  Never buy as Avocado with no stem on it, and do not put them in the fridge.  Keep them in a paper bag if you can , in a dark place . - Cheers", "Avacados are the most annoying fruit on the planet. Under ripe for a week........ Ripe for 5 seconds....... over ripe and throw away.", "It’s due to improper storage. It’s generally safe to eat, but may not taste as good.\n\nSource: https://www.eatortoss.com/brown-dots-or-streaks-in-your-avocado/", "I have the worst luck with avocados in the uk.", "Sometimes if not cleaned properly some of the shot from the hunters guns can remain in the avocado.", "This is called Vascular Browning. The inside of an avocado is a busy place, where nutrients, water and sugars are ferried around. Normally their “transport channels” are invisible to us. Unless, of course, something goes wrong. \n\nIn the case pictured above, the avocado’s internal thoroughfares (known as “vascular tissue”) may have been ravaged by too-cold storage for too long. The cells that make up that tissue weakened and started dying. The disorder typically becomes visually apparent after the fruit has ripened at room temperature for a couple days.", "Mint chocolate chip", "Unless the avocado you buy at the supermarket is already ripe, you should ripen it at room temperature. If you have an already ripe avocado, you have a choice: Cut into it and enjoy it, or pop it in the fridge to help keep it at peak ripeness for a few more days.", "Avocadont", "If you want it to ripen without doing that, remove the little stem button the day before you want to eat it. That happens when the avocado has started to grow roots. That is what the black stuff is. If they are stored close to bananas, apples, kiwis they will start to ripen very quickly and inconsistently.", "Looks like it tried turning into a kiwi fruit.", "Night of passion with a kiwi fruit", "It's been frozen during the transporting process. It gets fibers in them.", "Don't keep them in plastic bags", "Bird shot", "No!!!!!!!", "It’s cursed", "I wouldn’t eat that if I were you.", "It looks like the seed may have started rooting inside the avocado. Do you have a picture of the seed?", "Yeah I've had way more avocadonts that avacados. I've stopped buying them, who needs surly, bad tempered fruit?!", "Avacadon’t eat this", "r/plantclinic: vascular browning. Safe to eat. Some folk get freckles, some avocados get vascular browning.\nBoth are safe to eat.. uh..wrong metaphor but the bottom line is they're good to eat now.\nJust Google Lens it if you want an answer without going through Redditors being rudetors.", "Coz it’s fucked mate", "That made my skin crawl and reminded me of bugs", "Avo-kiwi", "Its parents are an avocado and a kiwi", "I’ve only just joined this subreddit but im pretty sure the answer is always botulism", "It's called avofrecals", "Ghosts in its blood", "It’s rotten, don’t eat it! There’s just no way to know what an avocado is going to be like before cutting it open - sometimes they’re all dark like this despite proper storage after purchasing.", "It has the Black Death…", "Because it identifies as a kiwi", "avocado herpes, sorry bro i couldn’t hold back last night", "Those are Peruvian Clutch Worms. Named for the way they make people clutch their abdomen from the severe stomach and bowel pain they cause. Only deadly in very rare cases or if a pre-existing condition exists.", "It’s a kiwi", "Wolverine was holding it", "Because it's rotting", "Avocado powder and you can avoid this", "It’s evil", "Pretty sure it’s just spoiled.  Everytime I’ve opened an overripe avocado it’s had black spots throughout just not to that extent", "Is no one else gonna talk about the face? Am I the only one who sees it?", "That looks really unappetizing. I would never eat that.", "Because it’s a mango, make some chutney.. let me know how it goes!", "It’s actually a kiwi it looks a bit bigger then normal ones but definitely not a avocado", "That’s a kiwi", "Eeeew", "Mold?", "It's because of that thing you did. You know.", "Sorry but who cuts an avocado like that", "Because it identifies as a Kiwi?", "Trypophobia🤢🤮", "[removed]", "Must have used a \"poop knife\" to open it", "Looks bug infested.", "It looks more like Avada Kedavra. You may wan to lose a Expecto a Patronum.", "Wasn't raping properly the spots are just over-ripe spots", "That's an avacano", " 50 cent", "I usually put them in the fridge the day the avocado gets soft", "U just leave it on the counter until it's ripe once ripe u can put in fridge make it last longer. Most important is to strip it of oxygen. Store it in hard plastic with lime juice and the pit. It can last up to a week. Typically I'll use them a lil hard for avocado. Once it's ripe/overripe it's Guacamole time. Dont buy avocados in abundance. They'll rot too fast and one avocado yields a lot for dishes.", "I buy 6 or more at a time. I use the rip one right away(if there is any) and put the others in a bucket of cold water covered completely into the fridge until I'm ready to rippen one outside of the fridge.", "Because people squeeze them in the store.", "Reincarnated melon?", "[removed]", "It is probably fine and not some crop disease?", " When I saw the thumbnail I was gonna be smart and say that's a Kiwi not an avocado, but when I saw the bigger pic, it was clearly an avocado, weird.", "Pretty sure it’s a mutation. It happened with a lot in a harvest a few years back and I remember reading about it.", "Those are naturally occurring channels in the fruit called vascular bundles. They convey water and nutrients from the tree to the fruit. Sometimes if the fruit is picked too early (I think - don’t quote me on that) they can fill with air and that causes the surrounding fruit to turn dark. It is safe to eat. Source: I eat them and am not dead.", "It's cosplaying as a kiwi"]}
{"title": "Can I eat this potato? I’m scared that it’s toxic.", "selftext": "", "url": "https://i.redd.it/4wucytyeqi2b1.jpg", "created_utc": 1685238207.0, "score": 847, "author": "moodismellow", "num_comments": 138, "permalink": "/r/foodsafety/comments/13to9eb/can_i_eat_this_potato_im_scared_that_its_toxic/", "html_title": "", "top_comments": ["This is breaking down really quickly into a few jokes that are being repeated and deleted (looking at you potato Rick). \n\nOp threw away, but in the future, here is what the science says:\n\nThe green is caused by chlorophyll, which in turn produces solanine in the potato. The green part is where this happens, so if the green had just been a patch, it can be safely cut away. For something like this, the entire thing is bad for consumption. I'll admit I even got that wrong at first and some users corrected me. I said it was peelable and eatable, but that was incorrect. \n\nSo there we have it folks! If a potato is this green, chuck it. If there are some small green spots, cut them out and cook as normal (but remove ALL the green). \n\n[Here is some more info on green potatoes](https://www.google.com/url?sa=t&source=web&rct=j&url=https://core.ac.uk/download/pdf/17213404.pdf&ved=2ahUKEwjx0s2pnJj_AhUUADQIHZnaAVEQFnoECBAQAQ&usg=AOvVaw2MwvZliSZIp3P-utG7b3Hv)", "DID MINECRAFT TEACH US NOTHING", "Thought these were pickles", "This has been answered rather throughly already but some of the information is pretty fragmented through the various posts.\n\nThe green in the potato is caused by direct exposure to light and has triggered the production of chlorophyll. This in turn is causing the production of solanine which is a toxic chemical that spreads throught the entire potato giving it an unpleasant and bitter taste.\n\nIn most cases a small amount of green found under the skin is relatively but not entirely safe. When the skin has changed to green on the exterior as well this is a good sign the potato can and likely will cause enough toxicity to induce stomach issues or worse.", "no do not eat that. that has gone bad in some way or the other. you should never eat green potatoes", "Green potato’s are highly toxic even if cooked never eat them throw away immediately", "DON'T EAT IT", "That's not a pickle???", "No, don’t eat these. The solanine level will be high and can make you sick.", "Do not eat. Too green. Green potatoes are toxic.", "Yes you can eat it, you might die though", "Don't do it. Was told by many chefs that if someone eats up to 3lbs of green potatoes they can die from poisoning. Don't ask me what kind of toxic poison but that's what I've been told.", "Do not eat these. Greening is chlorophyll but is usually accompanied by solanine production in potatoes. People have gotten sick and even died from eating potatoes with high solanine concentrations. The greening extends all the way through the potato so peeling won't do shit. It might not be full of poison, but you decide if it's worth risking your life over (and I repeat, people have died from eating potatoes with high solanine concentrations).\n\nIt's amazing to me people on reddit will say \"don't eat cookie dough because omg raw flour is so dangerous\" even though food poisoning from flour is of relatively similar prevelance as solanine poisoning from potatoes (even though everybody eats raw cookie dough and noone eats potatoes that look like this) and hasn't resulted in any known deaths as far as I am aware whereas potatoes definitely have, but I see people in the comments being like \"nah it's fine just peel it\".", "Toxic potat - do not eat", "No you shouldn’t eat that. Also, it would taste awful.", "Plant it on the ground and don't eat it", "[removed]", "No, the green always happens to me as i buy the sale bag, then half throw out because they go green, and then grow tentacles....  seriously waste of money.  Now i only buy enough loose potatoes and save money and fridge space.", "I ate some potatoes that were a little bad, bad stomach cramps. Don't do it.", "A green potato is a bad potato. \n\nEating it will cause solanine poisoning and can kill you.", "Green potatoes are not safe to eat usually.\n\nThey were exposed to sunlight which caused them to form chlorophyll which makes them unsafe.  This happens if the roots ares not deep enough.", "Potato is in the same family as mandrake and deadly nightshade.  Solanaceae family.\n\nI wouldn't.", "Green potatoes are poisoning us", "Hey so eating potatoes that are green can cause stomach pains and vomiting, we always throw the green ones away", "[removed]", "I love how no one answers his question, just tons of people trolling trying to be funny.", "No. It’s green. You don’t eat green potatoes.", "[removed]", "Yeah, no no, don’t eat that at all.  Good rule of thumb, when in doubt, throw it out.  Better safe than sorry.", "Do not eat that", "I’m worried that you were prepared to eat this. Are you okay? I mean this seriously, I’ve been in a place where it was eat the questionable food or don’t eat, so I just wanted to check in on you.", "my brother this potato has become a pear", "[removed]", "I’m sorry, I see a Goblin.", "You in danger gurl", "*for science*", "Those aren’t pickles?", "[removed]", "Potato Rick.", "Those aren't pickles?", "[removed]", "[removed]", "[removed]", "[removed]", "No green potato's are under ripe and can be toxic same with old potato's that have gone bad and sprouted Eye's", "It's green of course it's unsafe", "You chill bro", "[removed]", "[removed]", "Does anyone else see a goblin face?\n\nAlso no, don’t eat those.", "No, it will make you sick, very quickly.", "[removed]", "NOOOOOO", "Poisonous", "I thought they were pears...\n\nI wouldn't eat them", "Dont eat green food haha", "[removed]", "Under no circumstances! If you do your kidneys will shut down!", "[removed]", "……. Don’t eat it.", "I wouldn’t just incase", "You know its poisonous when it turns into a flipping cucumber", "Put in basic  terms, don't eat,", "[removed]", "[removed]", "looks more like a cucumber on steroids", "If its green then DONT EAT IT !", "[removed]", "[removed]", "[removed]", "[removed]", "[removed]", "Trust your instinct", "Surely if it looks like this just don't even bother. Like just get another Potato lol", "[removed]", "It's a potato just throw it out and buy a new one."]}
