{"title": "Finally understanding how to use my flash…", "selftext": "Shot at a dark cocktail bar in Mexico City with a Canon 5d Mark IV, 100mm macro, godox ad200, and godox ad300\n\nwww.instagram.com/andrewreiner", "url": "https://www.reddit.com/gallery/1fuojae", "created_utc": 1727896696.0, "score": 328, "author": "beardhead", "num_comments": 22, "permalink": "/r/foodphotography/comments/1fuojae/finally_understanding_how_to_use_my_flash/", "html_title": "", "top_comments": ["The first shot is sick !", "These are great. Just picked up my first flash (ad100 pro) and need to learn how to do this.\n\nGave you a follow", "Finally some good fuckin food", "Killed it!", "These are amazing. Great work", "Love the second one! The first shot shows strong and contrasting light can be, but your second shows how gentle and smooth. It also shows a good range of your knowledge.", "Loved these, and especially no. 1. How did you set up the lighting? Followed you on IG, hoping for some BTS.", "Give us some tips please", "These are INCREDIBLE!", "Shot details are required with your image posts in the title or as a top level comment. Include shutter speed, f-stop, focal length, lighting set-up, and any behind the scene shots. See Rule 1.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/foodphotography) if you have any questions or concerns.*", "The old vintage classic desi mosaic in the 3rd picture... really just bringing everything together. \n\nSooo wonderful 🌸", "Stunning!", "That last one is wild!🔥"]}
{"title": "Simple Christmas Breakfast, playing with moods, natural lighting, details in first comment", "selftext": "", "url": "https://i.redd.it/gm0t6121h38a1.jpg", "created_utc": 1671996495.0, "score": 242, "author": "eccentric_bee", "num_comments": 11, "permalink": "/r/foodphotography/comments/zv4r1o/simple_christmas_breakfast_playing_with_moods/", "html_title": "", "top_comments": ["I'm very new to food photos, just trying to get the best shots I can with what I have. Cell phone camera, natural lighting, background is a thrifted cupboard.", "Shot details are required with your image posts. \n\nIf your post is a question and not an image you must use the weekly Q&A thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/foodphotography) if you have any questions or concerns.*", "Love this", "Very nice. Clone out the drops on the table to the left side.", "eh, You were gonna starve in half an hour."]}
{"title": "Please critique my very first practice photo!", "selftext": "I recently decided to give beverage photography a try, and this is my first photo! Initially, I had an all-white background, but I didn't care for it, so the background you see is from my house. I was aiming for a tropical vibe at first, but I think I fell short. I’d love to hear your feedback, as I hope to be on the right path to improvement soon. \n\nGear: Canon EOS R6 MII\n\nRF 85mm F2\n\nSettings:\n\nSS 1/125\n\nfstop: 3.2\n\nISO 200", "url": "https://i.redd.it/xi9sawnuh2xe1.jpeg", "created_utc": 1745624683.0, "score": 240, "author": "bombastic_side_boob", "num_comments": 27, "permalink": "/r/foodphotography/comments/1k7zciz/please_critique_my_very_first_practice_photo/", "html_title": "", "top_comments": ["Shot details:\n\nGear: Canon EOS R6 MII\n\nRF 85mm F2\n\nSettings:\n\nSS 1/125\n\nfstop: 3.2\n\nISO 200", "It’s a great picture but needs a little help. Wipe the orange or use petroleum jelly to give it a lil gloss. You need to light up the bottom slightly and you can do that in PS or lighten it up with the drapes in the background or changing the table color. Finally an alka-seltzer can give you more prominent bubbles.", "oh how about ultra fine mist spray on the front side of glass? may need an additional frontal source to create an edge, maybe like rembrandt lighting style", "Since no one says it, I say it. The focus is wrong. The depth of field is not enough, you have to close the diaphragm. The lemon, apart from not looking very juicy, is out of focus.", "Lighting set up:\n1 Godox Flash Speedlite TT600 on a light stand with a Godox Reflective Umbrella softbox, at a 45 degree angle, and on opposite side, 1 white foam board as a reflector.", "Love the black and purple. Dont like the lime, looks dry , cut in half and place on the table maybe? So you have the black and the purple drink and the yellow lime next to the glass Well positioned? But I love the pic by the way!", "I just love the simplicity of it,", "can you shade the lighting off of the lemon? because the lemon is flat towards camera, and close to over exposed, it takes away from the drink to me at those exposure levels.", "Magenta :-)", "I shoot mainly drinks, and this is a great first try. Critiques: 1- I always try to have the front lip of the glass and garnish crisply in focus. If you zoom in, it looks like the bubbles in the drink are instead. I'd hit the same shot at different focal ranges from 2.8 to 8 and see which looks best. 2- I'd hit it with some more light. I always try to have a light source coming from the back left or right, as well as one coming from the camera area on the garnish. 3- the drink looks warm. It's always a struggle to shoot cold drinks with condensation, but this looks a bit lifeless. 4- the background needs something to set the stage. Move the drink around the location and shoot it near a window, with bokeh in the background...anything. Cheers!", "Shot details are required with your image posts in the title or as a top level comment. Include shutter speed, f-stop, focal length, lighting set-up, and any behind the scene shots. See Rule 1.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/foodphotography) if you have any questions or concerns.*", "looks boss. maybe superimpose another photo on top, this layer masking everything but the glass. shine or reflect light into or through the glass. In edit just slowly fade that superimposed masked layer in a hair, so the glass just has a faint more pop. Not a suggestion, just came to mind, this looks great", "Gorgeous color. Nicely done!", "Looks pretty good but imho, a highlight on the left side of the glass would've added a little flair. I would do it with a composite but I'm sure it's possible in camera.", "Just right! 😎", "It looks like it should be in a Patrick Nagel painting. I love it!", "I want drink this! Beautifully captured.", "Amazing keep going", "I'd like to know what's in the glass? Looks like a blue gin lemonade", "It looks a little off center", "This cocktail shot is absolutely stunning, the vibrant pink against the dark background creates such a captivating contrast! The lemon slice adds a fresh, tropical vibe that makes me feel like I’m on a beach somewhere. 🌴 Amazing work for your first try, can’t wait to see more! 😊"]}
{"title": "Some favourites from a recent shoot for a friend's pub", "selftext": "", "url": "https://www.reddit.com/gallery/1hg1zxy", "created_utc": 1734407351.0, "score": 226, "author": "Kittykathax", "num_comments": 28, "permalink": "/r/foodphotography/comments/1hg1zxy/some_favourites_from_a_recent_shoot_for_a_friends/", "html_title": "", "top_comments": ["[removed]", "Hey all, had a nice time shooting last week for a menu launch at my friend's pub. The place is known for its large windows and natural light, so she wanted the photos to reflect that. The day of the shoot was terribly snowy and cloudy, so luckily I had my strobe packed with me. The photos were all taken with my Fuji X-T1 and my Fujinon 60mm macro lens at roughly 1/180 and f16-f20. It's a great lens and pretty much never leaves my camera body. I also used my Neewer Vision 4 strobe at 1/1 power roughly 10 feet away from the \"set\" in order to capture those long hard shadows typically cast by the sun in this space. \n\nThanks for taking the time to look!", "Super nice, would only take down a bit those highlights 💪", "Love some of the composition with the green background!", "Good job. That kind of lighting is right on trend atm.", "That first shot is 🫶🏼", "Awesome job on these! Are you using two lights to achieve this not too far apart?", "These are SO FUN and amazing!!!!! Absolutely love them! Just keep an eye on the rice, you have a few areas that appear a tiny bit blown out. But you can restore highlights or dodge/burn those areas :)", "killer", "These are outstanding! I love the food placement on that first dish. The composition of the coffee & dessert shot is excellent. It looks like you did work on the shadows to be deeper on the green surface and lighter when on the subjects, it's subtle enough that it doesn't jump out at first glance.  Well done.", "Really nice !", "Shot details are required with your image posts in the title or as a top level comment. Include shutter speed, f-stop, focal length, lighting set-up, and any behind the scene shots. See Rule 1.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/foodphotography) if you have any questions or concerns.*"]}
{"title": "A few new pictures I took for my portfolio - I'd love some feedback", "selftext": "", "url": "https://www.reddit.com/gallery/uw2tqg", "created_utc": 1653319730.0, "score": 220, "author": "nyelzer", "num_comments": 28, "permalink": "/r/foodphotography/comments/uw2tqg/a_few_new_pictures_i_took_for_my_portfolio_id/", "html_title": "", "top_comments": ["maybe use a hand without a hangnail lol. Overall compositions are fantastic, though.", "2nd photo of the cookies is my favorite. Excellent composition and lighting. 4th, 5th and 6th would be next. I do think the first one could use a touch up on the hangnail. That’s an easy fix in Photoshop.", "Agree, use a different hand for the first shot. The cookies, salted yolks & doughnuts are my favorites.", "I shot with a Nikon D300S - 50mm f1.8. Only used natural light.", "They look great! One small thing I would say (and this might just be me) is that your frame is always a little too far right (except the one with the cookies) which puts some of the objects too close to the edge on the left. You want the image to be balanced, even with so many objects, and you want to make the edges of the frame look like they could extend forever. \n\nOther than that everything looks beautiful! (except the hangnail, but I think you've already been told about that lol).", "Good work!", "They all look pretty! Pic #5 is my favorite 🤩", "Very nice. Good job!", "All I can say is it’s making me hungry", "Add a video of you smashing the food with your fists", "They look phenomenal", "First photo despite the hangnail which can be removed, the grip is wrong - hyper flexing his thumb which looks awkward. The second obit my only concern is the reflection on the jar. Otherwise - all of the other details and photos are very well done !!", "I think they’re all great except for the first one. I’d leave that one out.", "Clean up that thumb ain’t nobody wanna see a hang nail", "I liked images 2,3 and 6. I would not share images that are not your best, it only hurts you.", "Shot details are required with your image posts. \n\nIf your post is a question and not an image you must use the weekly Q&A thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/foodphotography) if you have any questions or concerns.*", "Food looks great. Just use other hands. The blood in the first one is no bueno. Every other photograph looks good.", "You could at least photoshop the hangnail lol", "Here are my honest and rapid/quickshot reactions - only offered constructively (albeit tersely)\n\n1) need a new hand model. \n\n2) the refraction in the bigger jar really draws the eye (pointlessly) \n\n3) the bread looks really dry and unappetizing\n\n4-6) All really lovely! Well, tiny feedback on (6). Kinda odd compositionally that the center of the shot is a dark and (almost) empty void", "Looks great, some images are stronger than others but overall a great set! Donuts and cookies shots are my favs and I’d maybe drop the first shot with the hand as it doesn’t really align with the rest of the images. Lighting is nice but if I were to offer and advice would be to make work on styling and composition (not that it’s bad, it’s not too bad at all actuality) and hire a food stylist (budget or project depending).", "https://linktr.ee/sarrahhpickle Find me everywhere @sarrahhpickle 🫦💕", "They really look delicious. Consider using gloves, that will create more professional touch to your receipts. And maybe a little less contrast for editing.", "The eggs yolks in the flour looks so peaceful to me. Really well done!", "Puts my efforts to shame. Great work, well done."]}
{"title": "Backlit skillet toss", "selftext": "Was doing a restaurant shoot and asked if I could pop behind the line for a second. Spent about 1 minute setting up my light and getting behind the chef at the sautée station, but he was all over the place so I left pretty quick so as to not disturb service. I didn't think I'd walked away with anything good, but was pretty happy with these. Would love to know which of the two you think is strongest and what I could do better next time. \n\nSony A7III, Sigma 24-70mm f/2.8, 50mm, f/4, 1/160, ISO 64 (I think I accidentally moved the dial to 64, probably could've hit 200-400 for more dynamic range).\n\nGodox AD600BM w/ 16\"x48\" strip box. ", "url": "https://www.reddit.com/gallery/1jecoee", "created_utc": 1742324087.0, "score": 215, "author": "MGlassPhotography", "num_comments": 16, "permalink": "/r/foodphotography/comments/1jecoee/backlit_skillet_toss/", "html_title": "", "top_comments": ["The suspended oil and water droplets/particulate from the tossing gives it a pleasing grain IMO", "Atmosphere and good food go hand - in - hand. I like your approach to food photography. 😋 keep on the same path. Always shoot safe shots for clients, to get paid.", "Any shot that makes me hungry is a good shot. Well done!", "Very very nice!", "No feedback necessary. This is perfection. * chef's kiss *", "Literal 🔥", "That is surreal. I have seen many shots with the same vibe but this is on another level. Almost seems AI generated and I mean that as a compliment. Lovely! :)", "Shot details are required with your image posts in the title or as a top level comment. Include shutter speed, f-stop, focal length, lighting set-up, and any behind the scene shots. See Rule 1.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/foodphotography) if you have any questions or concerns.*", "For whatever reason the first image came lower res. I may have uploaded the wrong version, sorry about that!", "Did you use only one light?"]}
