{"title": "Paneer of Pettiness", "selftext": "I've gotten so many requests for this. I'm touched. :)\n\nThis is the paneer I make when I want to eat paneer tikka masala or saag paneer. If I want to make Gulab Jamun I make a different paneer.\n\n**You will need:**\n\nFull cream/Whole milk (1 gallon)\n\nLemon juice (1/2 cup)\n\nIce cubes (optional)\n\nCheesecloth\n\nColander/Strainer\n\nYou can halve the ingredients if you like.\n\n**Instructions:**\n\nBoil milk in pot with lid on. Continuously check on it to ensure that the milk does not burn. As the milk starts to boil add the lemon juice and stir. It should start curdling immediately and don’t worry if it changes colour slightly. Yellow/green discoloration is common. Keep stirring so it doesn’t stick to the pot. After it is completely curdled, turn off the heat and allow the mixture to sit and cool for 5-10 minutes. You can add ice cubes to make the cooling process faster, but it isn't necessary.\n\nWhile it cools, take cheesecloth, line the strainer with it and place it over a large bowl. Pour the mixture into the cheesecloth. The whey (liquid) should strain into the bowl. The curds should remain in the cheesecloth.\n\nGather the cheesecloth in your hands and rinse under running cold water. Then gently squeeze to get rid of liquid from the curds. Knot the cheesecloth with the curds in it at the top and hang it from your faucet to let it drain into the sink further for 20-30 minutes. Then place it on a plate, untie the knot on the cheesecloth and lay it flat over the curd. Place another plate on top of the curd. Place another heavy object on the plate. I generally stack plates on the curd and put a small sack of rice/large bottle of oil on top to weigh it down. Let it be for an hour or so. Cut it up and use immediately or put it in the fridge. I recommend putting it into the fridge immediately. It really helps to firm it up. Done!\n\nThis is probably really similar to some of the recipes already on the internet. This is my first time writing a recipe so I hope it’s clear enough! Don’t get discouraged if your first time doesn’t turn out as well as you want it to. Browse the internet to see if there are any paneer recipes you find easier to follow. Good luck!\n\nLet me know in the comments what you do differently when you make paneer. I'd like to know if there's something I can do better :)", "url": "https://www.reddit.com/r/justnorecipes/comments/ge3nkn/paneer_of_pettiness/", "created_utc": 1588704771.0, "score": 699, "author": "LegitimateSorbet7", "num_comments": 28, "permalink": "/r/justnorecipes/comments/ge3nkn/paneer_of_pettiness/", "html_title": "", "top_comments": [">Don’t get discouraged if your first time doesn’t turn out as well as you want it to.\n\nTrue facts. Made paneer the first time because my family wanted chicken masala, but my mom was visiting and is vegetarian. My cheese didn't quite set right so crumbled when I tried to cut it. Some of the ugliest food I have ever made (looked kinda like puke and scrambled eggs, tbh), but was still really damned tasty.\n\nThat is the day I discovered that hanging and waiting really is better than strain and squeeze.", "I was wondering if you use any salt on the final pressed paneer? Also...would using half-and-half or heavy cream make more resulting curds vs using whole milk?", "Thanks for the recipe! Came to add that you can use the warm whey as the water part of bread recipes, which adds flavor and protein! And the lemon juice in the whey actually makes the yeast happier 😊. Lots of people are making bread at home right now so they might be able to do both kitchen projects.", "[deleted]", "This made me so happy! Thanks for sharing. I’m totally going to start using the paneer of pettiness as a dish title. (I’m also Indian American.)", "Is full cream milk also whole milk, or do I need the one I use to make whipping cream (heavy cream?)", "May I ask a silly question?  I hear people talk about paneer all the time, but I don’t understand what it is and I am very interested in new foods.  What is it, and how is it normally eaten?", "Can you share your tikka masala recipe too?", "I’ve made paneer before but was distressed at how much whey seemed to be going to waste. Do you (or anyone else here) have a good use for the whey?", "Thanks for posting!  If you have a tofu press, it's an easy way to get more liquid out because you can keep gradually tightening it to increase the weight.  :)", "Thanks for sharing! Wow! I saw your other post and I just had to comment. Girl I feel for you. I’m South Asian as well and my hubby is South Asian but we’re second generation Americans. My MIL lives with us and she’s absolutely the most vile, toxic most petty person I’ve met ever. \n\nI always thought it’s because were Indian and I read this and I realize we’re not.\n\nI can not believe the reserve and restraint you’ve practiced. \n\nThere is something territorial with these MILs and food. The biggest fights in my house are about what I cook. The refuses to eat the brown rice I’ve cooked because it not good for her sugar levels but fills up a bowl of kichdi with primarily white rice. \n\nDamn I guess I’m not alone.", "Thanks for sharing! How much does this make?", "This is how I make ricotta but without rinsing it. This is definitely something to try. Ty", "I made a tiny batch just to see how it would turn out. It's sitting with a bunch of plates and a bag of potatoes and I want it now!! I'm saving the whey for bread I'm making tomorrow!", "This was SO good! It worked really well for my first attempt and the bread we made with the whey was so good!", "Hey off topic question. What Indian dish would you recommend I try? I've never had Indian food before, also I love spice so don't worry about that😂", "Sorry to revive this post but I just wanted to let you know your MIL is crazy stupid. I’m white, grew up in a white town, the whole Caucasian works, and Indian food is my favorite type of cuisine. It hits spots I didn’t even know I had, spots deep in my soul. It is *delicious* and my go-to comfort food. I would kill to be able to adequately cook it at home, but unfortunately I don’t have the magic (or the knowledge) so the local Indian spots receive my money quite often. \n\nYour MIL is *nuts* for passing up the chance to enjoy your cooking. I’ll be trying out your recipe, but I almost hope I fail, because if I unlock the ability to make quality paneer at home, it is OVER for any weight loss plans I have."]}
{"title": "Irish stew with soda bread good enough to make my MIL mad at me.", "selftext": "Posted about this recipe quite a bit now, after it caused in-law related drama over on JustNoMIL, which has ended with MIL being on an indefinite time out. Enough people asked me about it that I thought I'd share here. I did some thinking and the woman who gave me this recipe, my Nanny Maureen, would be alright with me sharing her recipe here, but not her secret ingredient, so here's the recipe for a nearly perfect Irish stew, as I'm afraid Nanny Maureen would come back to life and kill me for sharing the secret.\n\nDisclaimer: Measurements aren't exact but I can take some guesses, and most is according to what your taste is. Carrots are used here but aren't necessary, and can be switched out with whatever veg you want, or no veg at all. I'm told you can just buy lamb stock so feel free, but the recipe includes making your own. I highly recommend the recipe as it is, though, but that's probably because I grew up with it.\n\nIngredients:\n\n* A few lamb necks and some lamb shoulder or rump (making friends with your local butcher is not necessary, but strongly encouraged). You can just make the whole thing with neck if you want, but I prefer to get a few different cuts. It depends on how much stew you're making, but you'll want around 1 neck per litre of water.\n* Bag of potatoes (I prefer red but Nanny always used King Edward)\n* Carrots and onions (when I asked how many she always said \"you'll know\" so it's however many feels right to you on a spiritual level).\n* Pinch of thyme, a bit of celery (I never use more than half a stick but I don't like celery), a bay leaf, a few sprigs of parsley and a dash of pepper. Chives to be used at your discretion.\n* Equal amounts of wholemeal and plain flour, and 1.5x buttermilk (when nan taught me it was about 200g of each flour and 300ml of buttermilk, although she measured it with a pint glass), sprinkle of salt, pinch of bicarbonate of soda.\n\nTo make the stock- Separate the bones from the neck and chuck them in a pot of water, along with 1 sliced carrot, 1 diced onion, and herbs and let it simmer on a low-ish heat for a few hours. For best results let it sit overnight, but this isn't necessary. Sieve it and chuck out the solid bits, so you just have the liquid left, then heat it to reduce it. (I always make more than I'll need because this can be freezed for a few months and saves me making it again)\n\nFor the stew - heat the stock until it's just shy of boiling, chop up what's left of the lamb meat (neck, shoulder, rump, whatever), and seal it off in a saucepan before putting it in the stock. Reduce heat, simmer and cover for about 15 mins. Chop up remaining potatoes, carrots, and onion, then add all that plus the seasonings to the stock. Just go for it with the seasoning, add all you want, but for the love of all that is Holy, taste as you go (I've seen too many people fuck up at this stage by bunging in too much to start off with). More simmering until the lamb is cooked through. Then take it off the heat and cover, don't stir again until serving. It lasts a couple days and if you keep it in the fridge you can reheat it, but be reasonable.\n\nFor the bread - put all the dry stuff in a bowl, gradually add buttermilk, stirring as you go with a fork until it looks like bread dough. If it's too sticky add either flour, too dry add a splash of normal cow milk, but if you need more than that then use the buttermilk, it just needs to look like dough. Knead it, but only a little (really easy to overdo it but you still need to knead it a bit). Roll into a ball-shaped loaf, cut a cross on the top, bake for half an hour on about 200C/400F. There's no yeast so there's no rising time, and you can make it while the stew is simmering.\n\n&#x200B;\n\nAnd there you go. It's not particularly difficult but there's a lot of technical stuff (especially the bread) and most of the cooking time is just waiting for it to simmer.\n\nSláinte!", "url": "https://www.reddit.com/r/justnorecipes/comments/cndbw0/irish_stew_with_soda_bread_good_enough_to_make_my/", "created_utc": 1565220079.0, "score": 687, "author": "None", "num_comments": 114, "permalink": "/r/justnorecipes/comments/cndbw0/irish_stew_with_soda_bread_good_enough_to_make_my/", "html_title": "", "top_comments": ["Hope you didn't give the racist cuntbag anything.", "Thank you. My mom loves to cook and has a whole cupboard filled with cookbooks. You would be surprised how many recipes read just like the one from your Nanny. Most people back in the day weren't concerned over exact measurements and to be honest people that truly know how to cook don't need them.  I am going to save this and put it in my family cook book.", "It sounds delicious even without a secret ingredient. I wonder how long before people start guessing what it is...", "I noticed lamb neck on my butcher delivery menu last week. Im adding it specifically to make this, as your post earlier today was both really touching (about nanny) and infuriating (mil). Can’t wait to try!!!!", "I can't wait to try my hand at making it! It also tickles that deeply inner part of me that's petty that you shared the recipe with us but not that twatcycle that is your mil.", "Yay! You posted the recipe, sorta kinda. Somewhere in the ether I'm sure my great-grandmother O'Donnell is smiling her approval at the lovely lass who is willing to share the love while thumbing her nose in her MIL's general direction.\n\n(BTW, just saw your post about your wedding dress, and am hoping there's someone who can help you photoshop out the things that need 'shopping and get it posted privately to imgur. Posting it privately spares you the caustic comments. Some people just love to poop on things they don't get. I really want to see your dress. It sounds lovely!)\n\nQuick edit--Those of you who are planning on making the bread and thinking \"I'll just pop over to Aldi and pick up some Kerry Gold Irish butter,\" might not be able to find it. Aldi has been phasing out Kerry Gold and replacing it with their own brand, [Countryside Creamery Pure Irish Butter](https://www.aldireviewer.com/countryside-creamery-pure-irish-butter/).", "I have none of my family recipes anymore after going no-contact, and the fact you shared this was really touching to me. Thank you.", "This sounds wonderful! Is the secret ingredient... love?", "Yes I was secretly hoping you’d post this omg", "I know the secret ingredient!  (Waves hand).  The first line of the recipe should say,  \"First, pour two ounces of bourbon into the chef\".", "I read your post about the wedding dress and then backtracked my way here -- the stew sounds amazing, as is... and the comments about measurements crack me up.  \n\nI'm from a Southern family and we deal with measurements the same way. The best meme I ever saw online said something about \"I'm a Southern woman -- we don't measure. We sprinkle that shit on till the souls of our ancestors whisper 'Enough, child!'\"", "Did she tell you the cross on top of the bread is to let the fairies escape?  I have a soda bread recipe that gives that as the reason for the cross.", "I am mildly Irish (GG-Grandpa came over in the 1850s) but he was a man and such delightful recipes didn’t come with him. Thank you for letting me try a bit of my lost heritage ♡ \n\nAnd also hooray for not letting that bitch have the recipe!!", "Thank you! we make a similar lamb-herb-root veggies soup here in Iceland that's got a few more ingredients in it depending on region, I'm afraid to tell what they are in case I blow Nanny Maureen's secret. It's all local ingredients.", "The joke in my family is that if you really like something I made, enjoy it now because you'll never had it exactly that way again.\n\nThe way I cook, I usually just use whatever I have and often try to sneak more veggies or some other health food in\n\nLuckily, my family usually really likes my cooking. I actually usually dont.\n\nAlso, I've never had lamb but this sounds like something I could try.", "This sounds absolutely AMAZING!!!", "Thank you for this!", "definitely trying the bread!", "😯😯😯😯 I'm so excited!!!! I'm going to 100000% make this for my parents when I go see them. I'm in charge of food when I visit and since they normally eat a very healthy and low carb diet they splurge hardcore when I'm cooking.", "You are seriously an angel! I saw your original post and really wanted to try this for myself. My partner is Irish/Scottish and I think he would definitely appreciate it!", "I read your post earlier today, and while I was completely infuriated by your MIL’s actions, I really wanted to know about that recipe lol. Thank you so much for sharing with us!", "I read your story about your mil and your stew. I like how you cook. It reminds me of my family. I am mexican and we don't use measurements.  We go by what feels right and eventually you learn how to make things by heart. My mother tells me \"al tanteo and al gusto\" which kinda means \"guesswork\" and \"to your liking.", "Sharing this is so lovely of you!!!", "\\>  it's however many feels right to you on a spiritual level\n\n&#x200B;\n\nI do my stew with my daughter. I always tell her this is a special recipe because there isn't really one. Daddy does the meat until there is enough, she does the veg until there is enough. And 'enough' changes a little each time.  \n\nEdit: Asked a dumb question about salt because I missed it", "> \"you'll know\" so it's however many feels right to you on a spiritual level \n\nTBH this is just good life advice all around.", "So, I hope I'm not being offensive or stepping on toes or anything, but lamb is like... exorbitant compared to other meats and I'm broke. If I used beef instead, do you think it would be okay? I do plan to make this with lamb someday, just... when I can afford it lol.", ">it's however many feels right to you on a spiritual level).\n\ndead. love this", "Is her secret ingredient ketchup? That’s my moms 🤢", "My mother homesteads and has sheep about ready to meet the Shepard in the sky. We have Irish roots so I’m thinking this is a must make for a family dinner! Thank you!", "I agree with making friends with the butcher! There was one that was really good in my village years ago, and I remember going with my mum up the hill to get various things. They knew her by name and I think gave her little extras here and there... Good times. Thank you for this!!!", "Thank you❣️❣️❣️❣️", "So, perhaps a silly question, when you say a bag of potatoes, how big, ish, are your bags?\nOurs come in 400g, 1kg, 1.5kg, 2kg, 4kg lol.", "When I cook I usually look up some kind of recipe just to get a feel for ingredients, proper cook temp/times, and any kind of special equipment I might need. Once I’ve lined up everything I need I don’t look back at the recipe and go with my heart. Usually I saute, combine an acid or vinegar with broth(from a box, one day I’ll get to making my own) and add whatever spices feel right.\n\nI have irish in my blood but I prefer to cook greek, middle eastern, italian styles. Sometimes I go for the carbs and make a nice roux. Having a mother figure teach you how to cook is an essential part of life imo. I’ve been helping my mom in the kitchen since I was 10, and now in lieu of rent I cook dinner and clean the house.\n\nI would love to try making this recipe but I have no idea where to get lamb from. Not sure if my local (USA) grocery stores carry the good stuff. :(", "Can I substitute this with beeeeeeeeeeeeeeeeeeeeeeeeeeeeeef????????????????????\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n/s", "i cant wait to make this", "The secret ingredient was love all along", "I feel like this recipe is famous now! My grams was a first-gen American from an Irish family, and I really enjoyed cooking with her when I was little. Hoping my genes will help me get the flavors right from all my taste tests when I make this on Sunday.", "My grandmother taught me to cook. Recipes are suggestions, you measure with your heart and your eyeballs. \n\nUnless it's baking....baking is an exact science", "I do have a tray of leftover carrots, potatoes, and parsnips from a beef roast. It'll be tweaked (Sorry Nanny Maureen! Just this once to use up ingredients!) but I think I might make this tomorrow!", "Go raibh maith agat!"]}
{"title": "I feel like this definitely belongs here.", "selftext": "", "url": "https://i.redd.it/8qpp892wjdj51.png", "created_utc": 1611000869.0, "score": 452, "author": "MoGraidh", "num_comments": 2, "permalink": "/r/justnorecipes/comments/l02q90/i_feel_like_this_definitely_belongs_here/", "html_title": "", "top_comments": ["The name of the Cookbook is [The Fuck You Buffet](https://drive.google.com/file/d/1WjcDfZrPMr0Pw9f5GfEy0aTs2KEx4Pub/view) and I love that"]}
{"title": "The Shutdown Peanut Butter Cookies", "selftext": "This is the cookie recipe that shut down Manic Mollusk.  Here’s the original post:  https://www.reddit.com/r/JUSTNOMIL/comments/hkihhd/manic_mollusk_and_the_peanut_butter_cookies/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nThe cookie recipe came from my grandma, who got it out of an old church recipe book. They’re soft, chewy, and just perfect. I usually halve the recipe. We are in the states, so temps are in Fahrenheit.  Enjoy!\n\n1 cup peanut butter\n1 cup packed brown sugar\n1 cup sugar\n1 cup butter\n2 eggs\n1 tsp baking powder\n1tsp baking soda\n2 tsp vanilla\n2 1/2 cup flour \n\nCream together the peanut butter, butter, brown sugar, and sugar. \nMix in eggs one at a time. \nAdd the baking powder, baking soda, and your vanilla. \nCombine flour in slowly. \n\nBall dough and dip into sugar.\nFlatten each ball with a fork. \nBake @ 350 for 6-8 min.", "url": "https://www.reddit.com/r/justnorecipes/comments/hkjjn6/the_shutdown_peanut_butter_cookies/", "created_utc": 1593784843.0, "score": 438, "author": "unapetunia", "num_comments": 63, "permalink": "/r/justnorecipes/comments/hkjjn6/the_shutdown_peanut_butter_cookies/", "html_title": "", "top_comments": ["[removed]", "Just saved this recipe; going to be awesome by just looking at the ingredients!\n\nI am very curious...care to post MM's recipe for shits and giggles?", "Who says being up at 1am scrolling through Reddit aimlessly is pointless. I AM MAKING THESE TOMORROW!  \nI mean, TODAY!  \nI mean, AFTER I GET SOME SLEEP!   \n(Thank yoooou!)", "OH. OH.\nI'm actually crying with joy. \nMy last attempt at peanut butter cookies ended with horrible dry dough that I didn't have the heart to bake. Dried coconut was a mistake. \n\nI'm making these when my eyes stop leaking.", "I am craving PB cookies sooooo hard right now and I was looking up recipes yesterday.  May I humbly submit The Milk Bar's PB cookies: \n\n  \n\nPeanut Butter Cookies\n\nFrom [*The Milk Bar Cookbook* ](http://www.amazon.com/Momofuku-Milk-Bar-Christina-Tosi/dp/0307720497)by Christina Tosi\n\n*This is a 2-part recipe, involving crunchy peanut brittle and chewy peanut butter cookies!*\n\n**Peanut Brittle**\n\nIngredients:\n\n· 1 cup sugar\n\n· 1/2 cup peanuts\n\n*Makes 2 batches of PB cookies per brittle batch*\n\nLine a quarter sheet pan with a Silpat (parchment will NOT work – Silpat works wonders!)\n\nMake a dry caramel: heat the sugar in a small heavy-bottomed saucepan over medium-high heat. As soon as the sugar starts to melt, use a heat-proof spatula to move it constantly around the pan — you want it all to melt and caramelize easily. Cook until a deep amber, 3-5 minutes. Once the caramel is all melted, remove from heat and stir in the nuts. Immediately pour onto sheet pan and spread as thin as possible. Work quickly, as it will begin to set in less than a minute.  \n Let cool completely.\n\nBreak the brittle in a zip top plastic bag with a rolling pin or meat grinder or break into pieces and pulse in a food processor until the size of short-grain rice. Store in an air-tight container, and use remaining brittle from this recipe within a month.\n\n**Peanut Butter Cookies**\n\nIngredients:\n\n· 12 Tbsp (1.5 sticks) unsalted butter, at room temperature\n\n· 1 1/2 cups sugar\n\n· 1/4 cup glucose1 syrup (use 2 Tbsp corn syrup in a pinch, *but the consistency will be compromised*)\n\n· 1 cup creamy peanut butter\n\n· 2 eggs\n\n· 1/8 tsp vanilla extract\n\n· 1 1/3 cup or 225g **bread** flour \n\n· 1/2 tsp baking powder\n\n· 1/8 tsp baking soda\n\n· 2 1/4 tsp kosher salt\n\n· 1/2 recipe peanut brittle\n\n1. Cream together: \n\n· butter \n\n· sugar \n\n· glucose \n\nin the bowl of a stand mixer fitted with the paddle attachment and cream together on medium-high for 2 to 3 minutes. Scrape down the sides of the bowl. \n\n2. Fold in:\n\n· peanut butter\n\n· eggs\n\n· vanilla \n\nand beat for 30 seconds on medium-high speed. Scrape down the sides of the bowl and then paddle on medium-high speed for 3 minutes. During this time, the sugar granules will dissolve, and the creamed mixture will double in size.\n\n3. Separately, mix all dry ingredients:\n\n· flour \n\n· baking powder \n\n· baking soda\n\n· salt \n\nSlowly add the dry mix to the creamed mixture just until the dough comes together, and the dry ingredients have just combined into the wet; no longer than 1 minute. Scrape down the sides of the bowl.\n\n4. Fold in the peanut brittle until incorporated, no more than 30 seconds.\n\n5. Using a 1.5 oz ice cream scoop, portion out the dough onto a parchment-lined sheet pan. Pat the tops of the cookie domes flat. Wrap the sheet pan tightly in plastic wrap and refrigerate for at least 1 hour or up to 1 week. As with any butter-based cookie, do *not* bake your cookies from room temperature – they will not hold shape faster than they bake.\n\n6. Heat the oven to 375°. Arrange the chilled dough at least 4 inches apart on parchment or Silpat lined sheets. Bake for 18 minutes. The cookies will puff, crackle and spread. Bake until tan with auburn specks throughout. Cool completely on sheet pans before transferring to a plate or an airtight container for storage. At room temperature, cookies will keep fresh for 5 days, or 1 month if frozen.\n\n*Footnote:*\n\n*1* Glucose: Never used glucose before? You’ve surely eaten it. It’s in most commercially produced sweets as it’s more shelf-stable and cheaper than most sweetening agents. ‘Glucose’ is typically pointing at glucose syrup from grapes, not corn syrup, so read the container before purchasing. This will typically be found in specialty baking supplies.", "I have almost this exact recipe for my family's peanut butter cookie recipe! Only difference is a little bit more baking soda and some salt", "Those old church cookbooks sometimes have the best recipes in them.", "Can I have european sizes for the ingredients? I really want to make these Cookies, but us Germans measure in Gramm and Liter, not Cups.", "Yup. This is the recipe I have. I have no clue where it came from. Sometimes I do 1/2 cup creamy peanut butter and 1/2 cup crunchy to add texture to the ones by stepson enjoys. \n\nEither way they are very good cookies", "I've just made these and they're AMAZING! I'm in the UK so had to do a little jiggling about with the quantities, used crunchy peanut butter as it's all I had, and OMG!\n\nI would next time halve the recipe though as I do now have more cookies than I know what to do with!", "Just finished making a full batch (no way I could halve it!) and the whole family loves them! Thanks for posting!", "Thank you thank you! Literally just made them and they are gorgeous! Had to try it still warm as I couldn't wait! Iv been struggling to find a recipe that reminds me of the ones I had as a kid from a much loved person but never found it til now. They are divine thank you and thank you granny x", "I just made these tonight and they were a huge hit! I took some over to my future in-law’s house; peanut butter is my BF’s dad’s favorite and he loved them. Even his Grandpa, who hates peanut butter, thought the cookies were amazing. I’m so glad I stumbled across this recipe!", "These are the first peanut butter cookies that I’ve ever really, really enjoyed! I’m copying this into the recipe book along with the other favorites. Made the dough on Saturday and I’m baking a few more up now!", "Screenshot complete 😊", "First of all, I love your username as my children have made me watch each Luna episode a thousand times. \n\nSecondly these are going in the oven TODAY and I shall update if they make me cry or not (probably will, lets be honest here, I'm a cryer). \n\nThank youuuu", "For British people following along, note our cups are a little bigger. An American cup is 4/5ths of a British one, although who knows what you'll get in measuring cups after everything over here went to weighed.", "Thank u.", "Here from JNMIL. Thank you!!!!!", "This is the same recipe I use! It is freaking delicious. Especially if you use extra crunchy peanut butter.", "You're the bee's knees, unapetunia! My dad is going to be over the moon when I make these for him! Thank you!!!", "Made these today, they really are so soft and chewy, absolutely gorgeous! Tell your grandma that her cookies are bomb for me, wow!", "These are so yummy! I made some a couple days ago and the family has devoured them all. They turn out exactly how I like peanut butter cookies. Thanks so much for sharing the recipe!", "Thank you for posting this. My DD loves PB cookies and we will make these today.", "I'm saving this too and will make today or tomorrow. I love soft pb cookies.", "Thank you for posting the recipe, I am looking forward to trying them.", "I LOVE PB cookies! I look forward to making your grandmother's cookies!", "Oh I am going to make these tonight :D Yummy :D Thanks for the recipe ❤", "Thanks doll.", "Can't wait to try them out,  thank you and your grandma xxx", "This is my grandmas recipe too lol I get gold stars when I make them, and I am always asked to bring them to get togethers. \n\nSo yes, they are good and they do stay soft!!", "I have a very similar recipe! Adding butter *and* peanut butter makes all the difference!\nI won't go back to crumbly cookies after discovering this secret a few years ago!", "Commenting to save, thank you!", "Jeesus, no wonder they aren't dry, it's 2/3 sugar and Fat 😂\n\nLooks amazing.", "Oh making these asap", "May I ask, what is the difference between the two recipes?", "*Ball dough and dip into sugar*\n\nWhat does this mean?  Do we reserve some white sugar for rolling?", "I have all the ingredients, I am so going to make this!", "My mother used to make some like these from a cookbook series Calling All Cooks BellSouth put out an installment of each year from their customers favorite recipes if I remember correctly. I was so excited when I found the yellow one at a yard sale one time because it was what I learned to cook from when Mother was at work. I'm going to send this to my son & daughter so they can have it to pass on too!", "I have had this saved foreeever, forgot about it because I rarely cook or bake, and just found it again. I'm debating making them this weekend for my father's birthday, but I don't know how many cookies they make and I'm nowhere near experienced enough to tell by ingredient amount. If you're still around.. how many cookies does this make?"]}
