{"title": "FROM A PROFESSIONAL CHEF TO YOU: The tricks that anyone should know when they buy food.", "selftext": "I wager everyone here knows some of these things, but I’m gonna list everything I can think of in regards to eating healthy and well. I’m gonna make this a list with sections, so hopefully it’s easy enough to parse.\n\n—————-LEGUMES———————\n\n-Buy these dried as often as possible. Keep a stock of beans, lentils, and dried chickpeas around if you can. They’re cheap, almost always available, and virtually imperishable. As such, assuming you don’t throw them out and keep them properly stored, buying these is a 100% return on your investment. \n\n-Legumes are one of the most versatile options in your kitchen. As long as you soak them and put them in the fridge before you go to bed they’ll be available the next day to cook quickly. These are the best thing to have if you’re looking to stretch a meal because of their nutrient density and the fact that they’re just damn delicious on their own. \n\n-Look into middle-eastern and African cuisine for creative ways to use these ingredients. Some really common examples are lentil curry, hummus, falafels, and putting chickpeas in a shakshuka. This isn’t a recipe post, so look up how to make them yourself - some grandma has a better (and probably even cheaper) recipe than I do.\n\n————-GRAINS AND CEREALS ————\n\n-Like legumes, these are very versatile. However, I find most people know very little about them outside of wheat and maybe oats. I highly recommend learning what the most commonly eaten grans and cereals in your locality are, and then finding the affordable ones. There will be at least one. I guarantee it. \n\n-FLOUR is an essential staple, unless you’re celiac or gluten free - a topic on which I won’t speak because I’m confident anyone who has to deal with those issues knows more than I do. I recommend grabbing all-purpose flour due to its gluten content being a middle ground between low-gluten pastry flour and high-gluten bread flour. You can still use it to make bread, and it has a myriad other uses as a binder or thickener for sauces. \n\n-RICE is amazing, as most know already, but seriously - it’s one of the most important crops in the world. It’s kept civilizations alive on its back for all of recorded history, and it’ll keep you alive, too. There is no better “fill me up” food I can think of.  Wait for those huge sacks of rice to go on sale (it happens pretty frequently), then buy 2. They last forever. Ideally grab long-grain rice if you’re just looking for a side-dish or fried rice base, but in a pinch short grain’ll do; it’s just less forgiving and the starches don’t retrograde as fully so when you cool it it doesn’t keep as nicely. \n\n-KEEP IN MIND that rice is pure carbs. It’s a good base, but you need other stuff to go with it or else you’ll be deficient in nutrients and feel awful all the time. Trust me from experience - college me went through a raw-egg-on-rice phase, and it wasn’t pretty. \n\n-BARLEY, also, is amazing, but for other reasons. It’s high in protein and iron, and can help dramatically improve your nutrient intake for very little cost. In soups, roasted in tea (thanks Korea), and used in tandem with rice, it can go a very, very long way in making your diet a more sustainable one in times of austerity and plenty, alike.\n\n-AVOID “SUPERFOODS”. Not because they’re bad for you - just because of their jacked prices. Not to mention oftentimes the industries surrounding them are ethical nightmares. Don’t get me started on avocado cartels and the impact of quinoa farming on low-income South American communities. In reality, most grains and cereals have a lot of nutrients and minerals, and they’re often overlooked. Learn the nutrition facts, and make decisions accordingly. Google and online databases are your friends, here. \n\n———FRUITS AND VEGETABLES———\n\n-ONIONS: buy them fresh and store them in dry, enclosed spaces, and buy tomatoes canned and without salt added. Use onions in almost everything, they’re delicious, cheap, and nutritious. \n\n-TOMATOES: Good fresh and better canned. Use fresh tomatoes raw for whatever you want and use canned tomatoes for sauces. Buy canned tomatoes with as little added salt and sugar as possible. \n\n- POTATOES: Treat these as a starch option similar to grains or cereals. Buy them unprocessed, in a sack.  Store them in dry, enclosed spaces. \n\n-BASICALLY EVERY FRUIT: go for it, these things are nutrient bombs and they’re delicious. Buy them seasonally for the best value and if you have a day to do so, preserve them if you ever see a huge sale. I’m still enjoying lacto-fermented blueberries from last year’s insane blueberry harvest where I could buy a pint for a dollar.\n\n-FOR SHOPPING: Generally when you buy produce you should go, in order, to the discount rack, then the sales, and then everything else. Someone out there has a recipe for literally everything, and some of them are even good. A pepper with a blemish or tiny spot of mold is still fine, assuming you cut away the blemish or tiny spot of mold. \n\n-I CANNOT STRESS THIS ENOUGH; FIND THE UNDER-APPRECIATED AND OVER-SUPPLIED PRODUCE. There’s always a bin of some forgotten veggie no-one eats for some reason. In the west, at least, it seems to often be rutabagas/turnips. I’ve also seen apples in the fall, corn, and cabbages fall into this category. This is because of a good harvest, or because of a lack of consumer interest - any time this happens, capitalize on it. Everything is delicious if you cook it properly. Buy seasonally, and learn how to use the things you buy. You’ll eat like a king and pay like a pauper.\n\n-CANNED STUFF - I generally have a personal aversion to all canned veggies and fruits except tomatoes, but that’s just my privilege speaking. If you want to buy them or if fresh produce is hard to come by, avoid getting anything with added salt or sugar. Cross-reference the nutrient info on the can with info from a fresh counterpart to avoid buying filler garbage, and try to find somewhere to live with better food accessibility. Alternatively, save up and make a killing by opening a fruit and vegetable market to remove the need to read this very ling post any further. (This is a joke and I recognize the struggle of those in impoverished communities with awful food accessibility.)\n\n-FROZEN STUFF - frozen fruit and veg is great,\nmostly. Maybe dodge the chopped carrots and corn a lot of us ate growing up or find in bad takeout Chinese food, but hey - grab that bag of frozen berries or peas and throw ‘em in anything that warrants it. Technology for frozen produce has improved dramatically in the last few decades, and we should capitalize on that.\n\n\n——-PROTEINS——-\n\n-IF YOU EAT MEAT, buy the least processed cuts you can. Whole chickens, meat on the bone, and ground meats are your best friends. Go to butcher shops, if you can. Freezing meat is fine, but try to avoid buying pre-made frozen protein options. Get raw product and do the work yourself to save a LOT of cash and get better food out of it.\n\n-MEAT IS A LUXURY, NOT AN ESSENTIAL. I say this because in modern western culture eating meat everyday is seen as normal. This is an oddity when we examine all of human history, and this notion should be abandoned if we’re trying to live more affordably. Meat is grossly overrepresented in most diets, and you should always ask if you could cut your portion of meat down in exchange for more vegetables and grains.\n\n-LEARN HOW TO BREAK DOWN YOUR PROTEINS. A chicken isn’t just 8 portions of meat - it’s also bones and carcass for a stock or soup, fat to be rendered out and used as a cooking oil (thanks, jewish folks!), and skin to be cooked down into delicious little chips. This same list can be used for\npork, beef, and any other mammal you eat. \n\n-FISH IS IFFY. Like, as an industry. Not many people know their fish, and fish processing companies know that and capitalize on it. I always tell people who like fish to buy fresh and whole, and to learn how to pick good fish. Buying cheap processed fish products is akin to asking to be ripped off, to harm the environment, and to accumulate toxins in your body, all at the same time. To not get completely F-ed over by what is maybe the worst food industry in the world you need to know your fish, know the company you’re buying from, and know who’s doing the fishing. Good luck, and please try not to contribute to the death of our water ecosystems. (A good trick is that if you can afford fish when you’re poor and you don’t live beside a large body of water, you almost certainly DON’T WANT IT.)\n\n-IF YOU DO BUY FISH OR SEAFOOD, all the rules for proteins apply. Fish bones and crustacean shells for stock, fat deposits on the occasional salmonid for whatever you want, and fish skin, if it’s your cup of tea, for a lovely snack. Hell, fish organs and salt make up the base for a fermented fish sauce, if you really want to go the extra mile. Rome survived off of fish sauce and bread for longer than our society has been around. The one big difference between fish and meat is that frozen fish tends to suck relative to fresh in a much bigger way - both in terms of quality and retained nutrients. Put frozen fish in soups or curries, to avoid nutrient drain from the water that inevitably will leak out of your fish.\n\nFOR VEGETARIANS AND VEGANS: You know more about your protein options than I do, and honestly they would require a lot of research I haven’t done to fully discuss. Clearly I have more to learn on the subject, and intend to do so. I only encourage you all to do the same ✌️\n\n——-EVERYTHING ELSE——-\n\n-STAY AWAY FROM THE INSTANT RAMEN. I know it’s cheap. I KNOW you like how easy it is. I don’t give one flying fuck. It’s awful for you, it isn’t cheaper than a bowl of rice with soy sauce, a fried egg, and some frozen peas, and it’ll kill you slowly. Just don’t, and ignore anyone’s advice about how it got them through college. Hell, if anyone’s advice involves doing what they did in college, take it with a grain of salt. There’s good advice sometimes, and a LOT of bad.\n\n-AVOID THE JUNK FOOD AISLES. Chips, sugar cereals, premade salad dressings, sweet juice/pop, and processed foods like KD or tv dinners are not the way to go if you’re looking to get the most out of your dollar at the grocery store. They’re bad for you, they’re expensive relative to the cost of production, and they put a burden on your body that you’ll pay for down the line. Exceptions to this are staple sauces like a good soy sauce and fish sauce, grains and legumes, and canned veggies. \n\n-CHEESE IS A LUXURY, SO TREAT IT LIKE ONE. If you’re gonna buy it I recommend buying less of it less often, and buying the good stuff when you do. Kraft block cheese only costs as little as it does because it’s the by-product of the real money-maker: whey protein production. If you’re gonna buy cheese, please support a real cheesemaker. The cheese lover in you will be happier for it. \n\n-ALCOHOL IS ALSO A LUXURY. If you want a drink, I recommend doing it less often and drinking the good stuff. If you like the cheap stuff that’s fine, “good stuff” is all relative anyway. Just drink less and focus on quality over quantity, whatever your preferences are. \n\n-MAKE YOUR OWN COFFEE, AND BUY A THERMOS. I know Starbucks is delicious. Guess what? You can find a recipe for every drink they make online, and then make it better. Some restaurants literally survive because they can sell coffee at a nearly 2000% markup. Truck stop diners and high-end coffee shops do this. I recommend making cold brew the night before, since you literally just have to strain it in the morning rather than brewing a pot.\n\n-FINALLY, LEARN TO COOK. All of this information is fundamentally more useful if you know how to cook. Not knowing how to cook is a luxury afforded to those with the means to afford living in ignorance of this most basic human skill. You are living outside your means if you live in a well-off country, don’t make a least $60k a year, and can’t cook. \n\n\nBest of luck to you all. Stay safe out there.\n\nEDIT: A number of folks pointed out lots of things to me which I wasn’t aware of in regard to beekeeping, so I cut that section out as it was misrepresentative of the industry and failed to highlight key problems in it. Others felt I was being mean to vegans and vegetarians and regardless as to my intentions, I can see evidence that that whole section detracts from this list as a whole and isn’t informative enough to keep. I’ve removed it accordingly. Thanks for the feedback, positive or negative - keep doing good work ✌️\n\nEDIT: Someone made a good point that grocery stores are all laid out different, and not everyone knows the “centre aisles” mantra. So I changed it to “Junk food aisles” for clarity.\n\nEDIT: I somehow mistakenly said South African communities were effected by Quinoa production when in fact it’s primarily South American. Sorry ‘bout that.", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/jwjn2p/from_a_professional_chef_to_you_the_tricks_that/", "created_utc": 1605719239.0, "score": 71785, "author": "aichliss", "num_comments": 3016, "permalink": "/r/EatCheapAndHealthy/comments/jwjn2p/from_a_professional_chef_to_you_the_tricks_that/", "html_title": "Reddit - The heart of the internet"}
{"title": "My 11yo niece wants to learn to cook so we made these together: Vietnamese Summer Rolls with Peanut Dipping Sauce", "selftext": "", "url": "https://i.redd.it/dzxmlw8n4yv61.jpg", "created_utc": 1619629724.0, "score": 20949, "author": "NerdsWithKnives", "num_comments": 437, "permalink": "/r/EatCheapAndHealthy/comments/n0jmo6/my_11yo_niece_wants_to_learn_to_cook_so_we_made/", "html_title": ""}
{"title": "LPT: When you pick up your children from school, bring some healthy food with you like carrots or cucumber. The kids are usually starved and will eat anything.", "selftext": "This works with my kids, they are happy that I bring something they can eat in the car and don’t feel the need to rush for cookies/candy when they arrive at home but can hold themselves until dinner.\n\nEdit: Never thought this would blew up. Thx for the positivity!", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/jh811j/lpt_when_you_pick_up_your_children_from_school/", "created_utc": 1603542201.0, "score": 18187, "author": "None", "num_comments": 477, "permalink": "/r/EatCheapAndHealthy/comments/jh811j/lpt_when_you_pick_up_your_children_from_school/", "html_title": "Reddit - The heart of the internet"}
{"title": "I think my roommate is starving, what can I \"accidently\" make in bulk?", "selftext": "My roommate recently lost their job, and I've noticed that there's nothing food-wise in the fridge. I also noticed my most of my peanut butter was gone. I'm pretty sure since she doesn't really cook, she's just living off of PB&Js.\n\n&#x200B;\n\nI was wondering what I could do besides just making a giant pot of beans and rice. Something like a meal prep/ ramen that can be eaten as needed without being too obvious.\n\n&#x200B;\n\nEdit: Thanks guys for all the amazing suggestions! I'll try out a few recipes this week! ", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/zwjoj3/i_think_my_roommate_is_starving_what_can_i/", "created_utc": 1672158880.0, "score": 16388, "author": "McCrotch", "num_comments": 1764, "permalink": "/r/EatCheapAndHealthy/comments/zwjoj3/i_think_my_roommate_is_starving_what_can_i/", "html_title": "Reddit - The heart of the internet"}
{"title": "Watermelon and Whole Fruit Popsicle", "selftext": "", "url": "https://i.imgur.com/McK3uuM.jpg", "created_utc": 1563544169.0, "score": 15736, "author": "PabstyLoudmouth", "num_comments": 222, "permalink": "/r/EatCheapAndHealthy/comments/cf7sa9/watermelon_and_whole_fruit_popsicle/", "html_title": ""}
{"title": "Personal milestone: I ate a whole package of mixed greens before it went bad.", "selftext": "Been working on eating more veggies and reducing food waste, this was a great first step :)", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/hoz1pr/personal_milestone_i_ate_a_whole_package_of_mixed/", "created_utc": 1594421546.0, "score": 14207, "author": "Dukedyduke", "num_comments": 258, "permalink": "/r/EatCheapAndHealthy/comments/hoz1pr/personal_milestone_i_ate_a_whole_package_of_mixed/", "html_title": "Reddit - The heart of the internet"}
{"title": "Crispy Chickpeas! My favorite study snack and a great, healthy substitute for chips if you're looking for a little crunch", "selftext": "", "url": "https://www.reddit.com/gallery/j6s7yk", "created_utc": 1602082218.0, "score": 13274, "author": "shelbyp817", "num_comments": 404, "permalink": "/r/EatCheapAndHealthy/comments/j6s7yk/crispy_chickpeas_my_favorite_study_snack_and_a/", "html_title": "Reddit - The heart of the internet"}
{"title": "I grew up poor now I am comfortably middle class but still love some struggle meals. What were some of your favorites?", "selftext": "I grew up poor. Very poor. So poor that a week of my current salary is the average monthly salary for a family in my home town poor. But everyone was poor so it didn’t matter.  I find that now even though I can afford nicer groceries I still want to eat a lot of my childhood struggle meals. My favorite is my granny’s white beans and cornbread. \n\nWith talks of an economic collapse another recession and the tornado that hit my area (Nashville) early Tuesday morning I’m trying to save as much cash as I can and go back to struggle meals to cut my grocery bill. I’ve got a very well stocked kitchen/pantry with just about everything you can imagine, a full fridge, a full deep freezer with meat and frozen vegetables and fruit, a full pantry with just about every non perishable you can imagine.  I have a full kitchen cabinet just for my spices alone. So when I say I have a mini grocery store I’m not joking. I also need to use all of this before it expires. \n\nWhat are some of your favorite struggle meals to help me use up some of my stock pile?", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/ffeewa/i_grew_up_poor_now_i_am_comfortably_middle_class/", "created_utc": 1583682978.0, "score": 13064, "author": "builtbybama_rolltide", "num_comments": 4245, "permalink": "/r/EatCheapAndHealthy/comments/ffeewa/i_grew_up_poor_now_i_am_comfortably_middle_class/", "html_title": "Reddit - The heart of the internet"}
{"title": "First time making Turkey Pot Pie from scratch. Made with homemade stock from turkey bones and veggie scraps and homemade pie crust. It was damn delicious. I am proud of myself today.", "selftext": "", "url": "https://www.reddit.com/gallery/k9wbx4", "created_utc": 1607535228.0, "score": 13008, "author": "PoppyNicole", "num_comments": 246, "permalink": "/r/EatCheapAndHealthy/comments/k9wbx4/first_time_making_turkey_pot_pie_from_scratch/", "html_title": "Reddit - The heart of the internet"}
{"title": "Scallion Hua Juan! They're Chinese steamed flower buns - quite soft but still have a slight bite, savoury and flavoured with chopped scallions", "selftext": "", "url": "https://www.reddit.com/gallery/lzzzw0", "created_utc": 1615152065.0, "score": 12461, "author": "Cherryday11", "num_comments": 119, "permalink": "/r/EatCheapAndHealthy/comments/lzzzw0/scallion_hua_juan_theyre_chinese_steamed_flower/", "html_title": "Reddit - The heart of the internet"}
{"title": "Making your own salad dressing is usually cheaper and healthier than the bottled versions, so I put together a helpful how-to so people can learn the basics of making your own dressings. All 13 base recipes are in the comments!", "selftext": "", "url": "https://i.imgur.com/jhaPdCR.jpg", "created_utc": 1532906436.0, "score": 11702, "author": "BushyEyes", "num_comments": 219, "permalink": "/r/EatCheapAndHealthy/comments/92z091/making_your_own_salad_dressing_is_usually_cheaper/", "html_title": ""}
{"title": "I haven't done the math, but eating at a quality restaurant seems like a better deal than fast food lately.", "selftext": "We'll order out once or twice a week and it's usually fast food. Lately with the price increases and popularity of drive thrus from pandemic it seems to be a fools errand. \n\nWe went to Taco Bell the other day and my jaw was literally dropped from the price. The food was sub par and we waited in the drive thru for 20-30 minutes despite ordering ahead on the app.\n\nIf you feel like ordering out I suggest your local Mexican restaurant. Last time we went it was the same price as taco Bell, after tip, for significantly better food and atmosphere. We dinned in but the few times we did carry out it was an in and out operation, no waiting.\n\nWe found a high quality restaurant who's prices are reasonable for date nights. Yes it is more expensive than fast food, but not by much. Food was leagues ahead in quality, little to no waiting, and actual service.\n\nTLDR: Fast food is a scam! It's no longer cheap and quick. Support local business instead.\n\nEdit: pretty cool this is getting traction. Seriously tell everyone you know to just stop going to fast food. They are evil corporations! My local restaurants are my neighbors and they are feeding me better food!\n\nEdit2: Eating in will always be the cheaper/healthy choice. I'm trying to compare eating out options. Y'all have helped me reduce my take out budget A LOT and many thanks: PO-TA-TOES, rice and beans! Now we eat out less but choose higher quality as a treat (not-really, but thats the goal!). Good luck out there, its pretty rough.", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/ttwivn/i_havent_done_the_math_but_eating_at_a_quality/", "created_utc": 1648834421.0, "score": 11483, "author": "None", "num_comments": 937, "permalink": "/r/EatCheapAndHealthy/comments/ttwivn/i_havent_done_the_math_but_eating_at_a_quality/", "html_title": "Reddit - The heart of the internet"}
{"title": "Roast broccoli, cauliflower, and butternut squash with spicy BBQ chicken: lunches around $2.50 each", "selftext": "", "url": "https://imgur.com/Py3mljv.jpg", "created_utc": 1548075978.0, "score": 11440, "author": "chairfairy", "num_comments": 200, "permalink": "/r/EatCheapAndHealthy/comments/ai9x4x/roast_broccoli_cauliflower_and_butternut_squash/", "html_title": ""}
{"title": "Discussion: Time is expensive and it should be a factor in your cheap/healthy food decisions.", "selftext": "There are many people on this sub who are looking to eat cheap but are also \"time poor\". Time poor people may have long commutes, kids, work multiple jobs, go to school and work, take care of elderly family members, or are just exhausted at the end of the day. They only have limited time to shop and cook, or they would rather spend their time doing other things instead of in the kitchen.\n\nIf you are taking your time in consideration, you may find that a more expensive, more convenient option is a better option for you. Everyone will have different opinions on this based on their own circumstances.\n\nI do see lots of comments on this sub about making things yourself because that would be cheaper than buying it at the store. While well meaning, that advice can't be followed because many people don't have time to bake their own bread, cut their own fries, or churn their own butter.", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/l8arh9/discussion_time_is_expensive_and_it_should_be_a/", "created_utc": 1611971364.0, "score": 10773, "author": "n_o_t_d_o_g", "num_comments": 618, "permalink": "/r/EatCheapAndHealthy/comments/l8arh9/discussion_time_is_expensive_and_it_should_be_a/", "html_title": "Reddit - The heart of the internet"}
{"title": "It’s okay if you’re journey evolves!I started with smoothie bags and melted peanut butter on chicken but I kept the same goals. Breakfast, lunch and snacks, all week, twenty dollars or less.", "selftext": "", "url": "https://www.reddit.com/gallery/k1rovv", "created_utc": 1606440337.0, "score": 10676, "author": "HatchetJake", "num_comments": 297, "permalink": "/r/EatCheapAndHealthy/comments/k1rovv/its_okay_if_youre_journey_evolvesi_started_with/", "html_title": "Reddit - The heart of the internet"}
{"title": "My boyfriend used to drink juice, then I introduced him to fruity herbal iced tea! ($0.75-1.00 depending on brand and sale for 2L of tea)", "selftext": "", "url": "https://imgur.com/nqLBoA4", "created_utc": 1591635184.0, "score": 10612, "author": "waldeinsamskeit", "num_comments": 365, "permalink": "/r/EatCheapAndHealthy/comments/gz30pv/my_boyfriend_used_to_drink_juice_then_i/", "html_title": ""}
{"title": "Keep all your vegetable scraps in the freezer and turn them into delicious veggie broth! It costs next to nothing and can be used in so many soups and dishes.", "selftext": "mysterious fuzzy exultant tease sand ossified continue political rhythm recognise", "url": "https://www.reddit.com/gallery/k6xe3w", "created_utc": 1607128504.0, "score": 10236, "author": "None", "num_comments": 384, "permalink": "/r/EatCheapAndHealthy/comments/k6xe3w/keep_all_your_vegetable_scraps_in_the_freezer_and/", "html_title": "Reddit - The heart of the internet"}
{"title": "Please, please dig through the back of your fridge and cupboards before opening any of your newly purchased self-stable food.", "selftext": "You may be letting things you already have spoil and be wasted because of unnecessarily early preoccupation with survivalist recipes. \n\nSo check on the end of that loaf of bread, those open jars, the fresh vegetables about to go off, etc, and include them in the first menus you plan.\n\nFor example, today I made a nice warm lunch for myself out of some slightly freezer burned frozen lobster ravioli, the good parts of wilted scallions, and frozen corn. I am hoping to avoid opening any of the beans, canned soups, etc that I have recently purchased, for at least a week. \n\nAmericans waste 40% of the food produced in this country. Be more mindful and plan around what you have, and you might have 40% more days of food in your home.", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/flesjt/please_please_dig_through_the_back_of_your_fridge/", "created_utc": 1584641841.0, "score": 9999, "author": "ladykatey", "num_comments": 338, "permalink": "/r/EatCheapAndHealthy/comments/flesjt/please_please_dig_through_the_back_of_your_fridge/", "html_title": "Reddit - The heart of the internet"}
{"title": "I wrote a small cook book for easy, delicious, cost-conscious recipes for the quarantine! Recipes range from super simple to somewhat fancy.", "selftext": "Hi!\n\n[Free PDF for download here.](https://drive.google.com/file/d/1E56bZZyWkivCEZZA2Xb7kO-p71e6u_0w/view?usp=sharing)\n\nI hope this can help someone. I've spent about three weeks compiling and editing this. Lots of basic staples and full on meals in here.\n\nWould love any feedback, worked really hard on this and hoping it benefits someone!\n\nEDIT: Updated the PDF to fix a few typos and add some info!\n\nEDIT EDIT: If you make a recipe from this book, please feel free to send me a picture! I'd love to add pictures of all the recipes but that will take a lot of time. This would help me out if you let me use your shots!", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/fy0yxd/i_wrote_a_small_cook_book_for_easy_delicious/", "created_utc": 1586467357.0, "score": 9813, "author": "Tanners_Table", "num_comments": 442, "permalink": "/r/EatCheapAndHealthy/comments/fy0yxd/i_wrote_a_small_cook_book_for_easy_delicious/", "html_title": "Reddit - The heart of the internet"}
{"title": "Homemade pasta", "selftext": "", "url": "https://www.reddit.com/gallery/lxxefp", "created_utc": 1614897494.0, "score": 9803, "author": "Itchpuleeze", "num_comments": 316, "permalink": "/r/EatCheapAndHealthy/comments/lxxefp/homemade_pasta/", "html_title": "Reddit - The heart of the internet"}
{"title": "My guide to feeding yourself when your mental health is garbage", "selftext": "Hi, I’m no expert at all but I do have mental illness and I go through flares where my mental health blows. I’m also responsible for feeding a family and I have a tight budget for that so I’ve learned some things. Hopefully my trial and error can help another human. \n\n-convenience fruits and veggies are totally worth it. Things like grapes, berries, pears, apples, oranges, mini cucumbers, mini peppers, baby carrots, etc. Things that require almost no prep, you can wash them all at once when you bring them home and then just eat them. I wouldn’t go for pre-cut because it’s a waste of money but I find that having a banana or pear ready to go is really helpful. \n\n-keeping things like hummus, string cheese, peanuts, nuts, and seeds in the house is also convenient for healthy and easy snacking. If you have appetite issues or food aversions with your lows, definitely keeping nuts and peanut butter around are good because they’re nutritious *and* high calorie to help keep you fueled. I find nuts like almonds and walnuts to be cheaper in the baking aisle too fyi. \n\n-canned beans. Nuff said. \n\n-on a good day, cook a whole bag of rice or quinoa (or both). I also prep entire bags of dried beans at once. Freeze in portions (1/2 cup is a serving). On really hard days, you can simply zap it with frozen veggies. \n-which brings me to my next, stock up on frozen veggies. I buy the big bags of steamable ones at sams and keep frozen cauliflower rice/frozen peppers in my house at all times. \n\n-a handful of prepared spice combinations (I like garlic/salt/rosemary, BBQ rub, and good ol’ fashioned seasoned salt) in the cupboard to sprinkle on food is good. Don’t always gotta bust out all the stops, sometimes microwaved beans and rice with BBQ rub on top is more than enough. \n\n-be okay with changing your standards. You’re doing what you can. Sometimes cheese and crackers with baby carrots is a complete meal, that’s fine. You’re never too old for a peanut butter sandwich. \n\nIf you have anything to add, please feel free to do so. Good luck!\n\nEdit: words and formatting\n\nEdit 2: I promise I will respond to everyone when I get the chance but HONESTLY THANK YOU ALL. I didn’t expect this response at all! Thank you all for sharing your tips as well as your struggles, I’m so blown away by the amazing hive mind going on here. Keep taking care of yourselves and doing that hard work to get through the rough times. Truly I’m so amazed by how awesome every contribution here is. 🥰", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/cmawh3/my_guide_to_feeding_yourself_when_your_mental/", "created_utc": 1565011277.0, "score": 9605, "author": "None", "num_comments": 447, "permalink": "/r/EatCheapAndHealthy/comments/cmawh3/my_guide_to_feeding_yourself_when_your_mental/", "html_title": "Reddit - The heart of the internet"}
{"title": "If you're bored of eating Western style eggs, try cooking it Thai style instead!", "selftext": "As a Thai person, I'm always eager to share the different ways I work with one cheap, universally common staple: eggs! \n\nNow these aren’t really recipes, they’re more like methods that you can try if you like eggs but want some variety without spending extra money. \n\n**Thai omelettes (ไข่เจียว)**\n\nUnlike French omelettes (which are delicately yellow and cooked in butter), Thai style omelettes range from golden yellow to brown in color (not burnt) and is fried in \\*HOT\\* oil like sunflower oil. This gives the omelette a really nice smoky amora, almost like popcorn? You can even pour the beaten egg mixture through a sieve into a pan/wok of hot oil, and it'll be super crispy/wispy like [this](https://www.clipmass.com/upload/news/49/48368_full.jpg). I love it with sriracha (probably one of the only instances where we actually use this ingredient, surprisingly) with a plate of rice. \n\n**Thai steamed eggs (ไข่ตุ๋น)**\n\nThis is similar to the Japanese chawanmushi, where an egg mixture (which is super customisable btw - but just adding green onions/scallions is common) is beaten, seasoned with soy sauce, a paste of cilantro root* garlic and black peppercorns (you can blend the 3 or use a mortar and pestle), and finally, pork/chicken stock. Then you steam it in a bowl for 20-30 mins. The result is like a savoury pudding/custard that should be eaten with rice - a very kid-friendly meal and is commonly eaten with you're feeling sick and want something hot and easy to digest. \n\n**Fried eggs (ไข่ดาว)**\n\nLike the omelette, Thai people like fried eggs to be *really* fried in hot frying oil (so olive oil wouldn't work for this). The edges of the whites are crispy (a bit of browning adds a lot of flavor). The yolk isn't  exactly sunny side up, because a key technique is to 'baste' the yolk in the oil until it turns slightly white while maintaining its overall runniness. Fantastic with rice and fish sauce (plus chopped garlic and chilies if you want).\n\n**Grilled eggs (ไข่ปิ้ง)**\n\nThis is probably the least well-known egg cooking method/recipe for both Thais and non-Thais as it's a street food item that you don't really see that much anymore. I recommend this for special occasions as its quite labor intensive. Basically... the contents of the eggs are taken out through a small hole (you can use a pin), thoroughly strained, seasoned with pepper and soy sauce, beaten, poured back into the eggs, steamed, put on skewers and then grilled/toasted. The toast adds a really nice smokiness that makes its way into the egg mixture. The result should be like boiled eggs but with flavour. Side note: I’m not sure how hygienic the eggs are in your country so check food regulations before trying this recipe as every country is different!\n\nEdit: clarity\n\n*cilantro stems work in a pinch \n\nEdit 2: Wow this blew up! This sub’s been super helpful to me so I’m glad to share with this you :)", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/laicj0/if_youre_bored_of_eating_western_style_eggs_try/", "created_utc": 1612224438.0, "score": 9474, "author": "shelleyclear", "num_comments": 257, "permalink": "/r/EatCheapAndHealthy/comments/laicj0/if_youre_bored_of_eating_western_style_eggs_try/", "html_title": "Reddit - The heart of the internet"}
{"title": "Gingery Chicken and Rice Noodle Soup with Crispy Garlic", "selftext": "", "url": "https://i.redd.it/xzsspumgtpc61.jpg", "created_utc": 1611248138.0, "score": 9384, "author": "NerdsWithKnives", "num_comments": 194, "permalink": "/r/EatCheapAndHealthy/comments/l22e18/gingery_chicken_and_rice_noodle_soup_with_crispy/", "html_title": ""}
{"title": "I bought a box of 60 eggs because I thought it was really cheap at $5--Didnt do the math and realized it's not that much of a bargain. Single Guy in an Apartment. What else can I make other than scrambled eggs and omelettes?", "selftext": "", "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/t2xq0a/i_bought_a_box_of_60_eggs_because_i_thought_it/", "created_utc": 1645995636.0, "score": 9227, "author": "pretentious-redditor", "num_comments": 2894, "permalink": "/r/EatCheapAndHealthy/comments/t2xq0a/i_bought_a_box_of_60_eggs_because_i_thought_it/", "html_title": "Reddit - The heart of the internet"}
