{"title": "The Pioneer Woman's take on freezer cooking- lots of great ideas!", "selftext": "", "url": "http://thepioneerwoman.com/cooking/2013/07/freezer-cooking/", "created_utc": 1406385748.0, "score": 7, "author": "Shastaw2006", "num_comments": 0, "permalink": "/r/FreezerCooking/comments/2bs4zq/the_pioneer_womans_take_on_freezer_cooking_lots/", "html_title": "Easy Freezer Meals - Best Way to Freeze Meat"}
{"title": "Hamburger Plan - 35 lbs", "selftext": "Years ago I belonged to a yahoo group for once a month cooking.  There were several plans broken out by meal and protein.  Here's the one for the hamburger.  I'll create a new post for each plan I find (give me a couple days).  \n\n  \nPLEASE put your recipes that would go well in this thread as well!\n\n**Robbyn's Hamburger Plan – 35 pounds**\n\n**Recipes!**\n\n  \nRecipes with raw meat\n\n* [Robbyn's Meatloaf](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#meatloaf) \\- 6 lb.\n* [Robbyn's Basic Meatballs](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#meatball) \\- 5 lb.\n\nRecipes with cooked ground beef:\n\nFirst make: [Pre-Cooked Basic Ground Beef](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#groundbeef)  \nPackage 5 pounds as described [below](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#groundbeef)\n\nUse the rest in:\n\n* [Noodle Stroganoff](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#noodlestroganoff) \\- 4 lb.\n* [Shepherds Pie](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#shepherdspie) \\- 4 lb.\n* [Beef and Potato Burritos](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#beefandpotatoburrito) \\- 2 lb.\n* [Taco Meat](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#tacoseasoning) \\- 5 lb.\n* [Sloppy Joe's](https://web.archive.org/web/20080608205618/http:/snider.mardox.com/hamburger2.htm#sloppyjoe) \\- 4 lb.\n\n  \nFirst I make the things that call for raw meat.. the meat loaf and meatballs.\n\n**Robbyn's Meatloaf**\n\nI used 6 lb. of ground beef and packaged it in 3 - 2 lb loafs\n\n2 lb gr. beef  \n1 c. oats  \n1 egg  \n1 envelope onion or beefy onion soup mix  \n1/2 c milk  \n1 med. size carrot\n\nBlend carrot and milk to pulp.  Mix together with all ingredients.\n\n**To Freeze..** package in family size portions in zip bags. Label and freeze.\n\n**To Serve..** bake 350 \\* for and hour or till cooked through.\n\n \n\n**Robbyn's Basic Meatballs**\n\nI have used this recipe for YEARS...\n\n1 lb. ground beef  \n1/4 cup fine, dry bread or cracker crumbs  \n1/2 teaspoon salt  \n1/8 teaspoon pepper  \n1 small onion, chopped  \n1 egg  \n1 tablespoon oil\n\nIn medium bowl, combine all ingredients except oil; mix well. Shape into 1 1/2 to 2 inch balls. In large skillet, brown meatballs in hot oil; drain. Add desired sauce to meatballs, cook as directed in recipe.\n\nTip:  To brown in oven, arrange in un-greased shallow baking pan; bake at 400 degrees F for 15 minutes or until browned.\n\nCocktail Meatballs:  Shape into 1 inch balls; continue as directed above. Makes 24 meatballs.\n\n**To Freeze..** Flash Freeze and bag together.  \n**To Serve..** Just add to any sauce or recipe as needed\n\nnotes...  \nif you use crackers you don't need to use salt..  \n1 sleeve of saltines is one cup of crumbs..  \na tablespoon measure slightly heaped makes a nice size meatball..  \nI bake @ 400 for 20 min.  \nI use dried onions and they work great.\n\n \n\n**Pre-Cooked Basic Ground Beef**\n\nNext I make the recipes that call for cooked ground beef.  I cook my ground beef with garlic and onions.  I am a convenience freak, I use the dehydrated onions that I buy  in bulk and I use the crushed garlic from a huge jar that I buy at Costco.\n\nWhen my panful of ground beef is cooked (about 5 lb. at a time) I start making the packages that call for cooked ground beef.  First I rinse the fat off in a big colander, then using a Tupperware Quick Shake container, I bag my meat 2 cups at a time. The quick Shake container works great because it  is 2 cups and has no handle, so it fits great slipping into a quart size ziploc container.  Slip, flip, shake, zip..... very fast and easy.\n\n**Ideas to use the Pre-Cooked Basic Ground beef..**.  We use this on pizza for pizza night, in our spaghetti sauce which I can without meat in the summertime, or for hamburger gravy and more.  Very versatile to have in the freezer.\n\n \n\n**Noodle stroganoff**\n\n\\*\\* Super easy OAMC instructions...  \nthis is how i do it for OAMC..  \nuse a gallon freezer bag and put it in a large measuring cup to support it..\n\n1 lb (I use 2c.) cooked ground beef seasoned with onion and garlic  \n1 large can (8 oz) canned mushrooms (if you use fresh sauté them some)  \n1 can beef broth  \n3 Tblsp Lemon Juice  \n3 Tblsp red wine\n\n**To Freeze..** bag together, label, date and freeze..\n\n**To Serve..** defrost.. add 3 cups noodles ( I add the whole bag but need to add a little liquid) cook till noodles are tender then stir in 1c. sour cream (or more if you have added extra noodles)  warm slightly and serve...\n\nMy family eats this like madmen!! I have had to continually stretch this with more mushrooms and noodles to get enough for my family.. You can of course lighten this any way you like or use beef soup\n\n \n\n**Shepherds Pie**\n\n2 c ground beef (cooked with onions and garlic)  \n1 can tomato soup  \n1 can green beans or corn\n\n**To Freeze..** Put in gallon freezer bag and squish together. Label and freeze.\n\n**To Serve:** Defrost, put in 1.5 - 2 quart casserole dish,  top with 6 servings of mashed potatoes and top with a generous amount of grated cheddar (apx. 3/4 c?) Bake at 350 \\* 30-40 minutes or till hot and bubbly and the cheese is melted.\n\n**Optional:** In disposable 1.5 quart foil pan, prepare completely to the cheese and freeze. Defrost and bake as above.\n\n  \n \n\n**Beef and Potato Burritos**\n\nAfter browning ground beef with onions and garlic, measure out 4 cups (apx.. 2 lb).  Put in fry pan with about 6-8 med. diced potatoes (I chop small in my food processor). Cook until potatoes are done. I don't like to add oil, so if it starts to stick I add water.  Add salt, pepper and lots more garlic.  When potatoes are tender, spoon into tortillas and roll.  Flash freeze, wrap in plastic and put in a big zip bag.  To heat wrap in a paper towel and microwave...\n\n \n\n**Taco Meat Seasoning Packets**\n\nMakes enough mix for one pound of ground meat\n\n   2 t  Instant Minced Onion  \n   1  t  Salt  \n   1  t  Chili Powder  \n1/2 t  Cornstarch  \n1/2 t  Crushed Dried Red Pepper   (optional) - way to hot for my family  \n1/2 t  Instant Minced Garlic  \n1/4 t  Dried Oregano  \n1/2 t  Ground Cumin\n\nCombine all ingredients in a small bowl and blend well.  \n   \nMakes 1 package (about 2 T) of mix.  Using the above recipe as a guide you can increase the amounts to make any number of packages.  \n    \nTaco Filling:  Brown 1 lb lean ground beef or turkey in a medium skillet over medium high heat; drain the excess grease.  Add 1/2 cup water and the seasoning mix.  Reduce heat and simmer 10 minutes, stirring occasionally.  \n**To Freeze..** bag, label, date and freeze..  \nMakes filling for 8 to 10 tacos.  \n   \nFor a larger quantity - Rip squares of foil for the number you want to make and just portion out the spices on the foil pieces.  Fold the spices inside the foil packets and store in cupboard in a container.  I use a recycled peanut butter jar.   I do make my seasoning packets in quantities larger than 1 lb packets.  I usually cook 5 lb. meat at a time and use seasoning for 3 lb. But that is how WE like it.\n\n  \n \n\n**Sloppy Joe's**\n\nI used to make this from scratch.. then I made it once from a can... Jim said\" Wow Hon, this is the best you have ever made!!\"  Gee guess what I do now???  I have collected a few recipes that I might give a try soon though.. Look for a recipe here soon.\n\n ", "url": "https://www.reddit.com/r/FreezerCooking/comments/1gaoww5/hamburger_plan_35_lbs/", "created_utc": 1729726987.0, "score": 5, "author": "Traditional_Will2679", "num_comments": 6, "permalink": "/r/FreezerCooking/comments/1gaoww5/hamburger_plan_35_lbs/", "html_title": ""}
