{"title": "Breakfast Burritos for my freezer stash", "selftext": "Goals for 2025 is to build a freezer stash (in case my job situation changes thus I have some food to feed my family)\n\nMade 25 breakfast burritos with food that was on sale \n1 bag of frozen diced potatoes and peppers $1.99\n2 pkgs of ground turkey $5.49 each\n2-3 cups of shredded cheese\n12-16 eggs $4.99 (on sale with coupon or it would of been $6.49)\nTortillas wraps \n\nLooking for more family friendly freezer meals, doesn’t have to be crock pot meals", "url": "https://i.redd.it/d4tz4s743vee1.jpeg", "created_utc": 1737689525.0, "score": 12, "author": "Due-Acanthocephala-1", "num_comments": 8, "permalink": "/r/freezermeals/comments/1i8mad0/breakfast_burritos_for_my_freezer_stash/", "html_title": ""}
{"title": "Ultimate freezer meal post", "selftext": "", "url": "/r/EatCheapAndHealthy/comments/s3wrsw/ultimate_freezer_meal_post/", "created_utc": 1644179978.0, "score": 13, "author": "malt_soda-", "num_comments": 0, "permalink": "/r/freezermeals/comments/sm6wfo/ultimate_freezer_meal_post/", "html_title": ""}
{"title": "Roast Chicken freezer meal $2.62 per meal.", "selftext": "", "url": "https://i.redd.it/34jtu6hcfzda1.jpg", "created_utc": 1674544098.0, "score": 12, "author": "Life-Pound-8788", "num_comments": 2, "permalink": "/r/freezermeals/comments/10jzqze/roast_chicken_freezer_meal_262_per_meal/", "html_title": ""}
{"title": "Souper cubes worth it?", "selftext": "First is this subreddit still active? There no recent postings? \n\nAnyone who’s been using souper cubes find them worth it? I’ve been freezing leftovers in ziplocks and broth in jars both which takes up a good bit of space and a pain to defrost. We have a family of 5 so sometimes it’s a lot of freezeable left overs or very little. Should I start with the 2 cup size or go ahead and invest in all the sizes? Which ones do yall use the most? ", "url": "https://www.reddit.com/r/freezermeals/comments/1js3we7/souper_cubes_worth_it/", "created_utc": 1743861039.0, "score": 12, "author": "Covista2", "num_comments": 7, "permalink": "/r/freezermeals/comments/1js3we7/souper_cubes_worth_it/", "html_title": ""}
{"title": "Heart friendly freezer meals", "selftext": "I’m looking for freezer meal ideas to make for my parents. My stepdad has heart issues and recently had a stroke and my mom has a lot of health issues including pre-diabetes and high cholesterol. \n\nI was wanting to make them freezer meals for Christmas but I know if they don’t also taste well they will probably go to waste… so does anyone have any recipes they could recommend?! I will be forever grateful! ", "url": "https://www.reddit.com/r/freezermeals/comments/1hfr5ti/heart_friendly_freezer_meals/", "created_utc": 1734377087.0, "score": 10, "author": "kittenmittens8D", "num_comments": 1, "permalink": "/r/freezermeals/comments/1hfr5ti/heart_friendly_freezer_meals/", "html_title": ""}
{"title": "15 freezer meals in under an hour Easy cook from scratch Meal Prep #fre...", "selftext": "", "url": "https://youtube.com/watch?v=JyGNtVUxFlI&feature=share", "created_utc": 1664324207.0, "score": 7, "author": "trink323", "num_comments": 0, "permalink": "/r/freezermeals/comments/xpx9tx/15_freezer_meals_in_under_an_hour_easy_cook_from/", "html_title": "Under an Hour 15 #freezermeals  Easy cook from scratch  #easymealprep #makeaheadmeals - YouTube"}
{"title": "Meal Prepping", "selftext": "Okay.. What’s the scoop. Can anything be frozen to be preserved for later? Like can I just make box mix pancakes and freeze them for a few months and microwave them as needed? Or like mac and cheese? (or literally any food) \nIs there a science to it? And is it possible to bring things back to life with only a microwave or an oven?", "url": "https://www.reddit.com/r/freezermeals/comments/1frnp74/meal_prepping/", "created_utc": 1727556186.0, "score": 7, "author": "nyliean", "num_comments": 4, "permalink": "/r/freezermeals/comments/1frnp74/meal_prepping/", "html_title": ""}
{"title": "Welcome to freezer meals! The place to post recipes for what's cooking that will immediately be frozen.", "selftext": "", "url": "https://www.reddit.com/r/freezermeals/comments/p0nf4e/welcome_to_freezer_meals_the_place_to_post/", "created_utc": 1628458177.0, "score": 5, "author": "drunkenknitter", "num_comments": 0, "permalink": "/r/freezermeals/comments/p0nf4e/welcome_to_freezer_meals_the_place_to_post/", "html_title": ""}
{"title": "Frozen pizzas", "selftext": "I'm obsessed with my freezer. Last night I finally made homemade frozen pizzas, using a homemade sourdough parbaked crust, and various toppings, many of which also came from my freezer. I flash frozen them so the cheese wouldn't stick to the clingfilm, then wrapped them and put them all in a large freezer bag. \n\nI'm allergic to tomatoes and don't eat ultra processed foods, so I rarely have pizza due to the time it takes me to make it the fact that the toppings take time too, so this is a real treat.\n\nTop to bottom:\n- Basil pesto, garlic and zucchini\n- Confit garlic, roasted red pepper strips, black garlic salami\n- Basil pesto, Italian sausage and broccoli", "url": "https://www.reddit.com/gallery/1k0ff2l", "created_utc": 1744792057.0, "score": 5, "author": "GlitterEcho", "num_comments": 0, "permalink": "/r/freezermeals/comments/1k0ff2l/frozen_pizzas/", "html_title": ""}
{"title": "Meal Prep Crockpot Meals", "selftext": "Hi all! \n\nA few months ago I used a recipe guide that had 17 crockpot freezer meals all prepped in one day (7 different recipes). The ingredients from the different recipes had lots of crossover. It took about 4 hours (not including the shopping) and so much chopping but I had 17 dinners when I was done. The idea was great and it has saved me so much time and stress on those busy weeknights when I'm running kids to one activity or the other. But I'm down to my last few meals from that meal-prep session. \n\nHere's my problem - the meals were fine, but were very bland and lacked much flavor. Leftovers often get tossed because they weren't that good to begin with. \n\nDoes anyone have a similar freezer meal prep plan with.... \n\n* Prep 1 day to make 10+ different meals (repeats of a few recipes is fine) \n* Decent flavor! \n* Crock pot cooking (or cooks from frozen in under 1 hour) - I need to throw it in the crockpot at 7 am, before I leave for work, and have it be ready to eat when we get home.  \n\nI have googled to try to find similar guides without much luck. I searched this subreddit but also didn't find what I'm looking for. \n\nHelp this busy mom avoid takeout or canned soup every week! ", "url": "https://www.reddit.com/r/freezermeals/comments/1jsx6w9/meal_prep_crockpot_meals/", "created_utc": 1743954603.0, "score": 5, "author": "AdFearless5061", "num_comments": 4, "permalink": "/r/freezermeals/comments/1jsx6w9/meal_prep_crockpot_meals/", "html_title": ""}
{"title": "Freezing Onions", "selftext": "Hi, i've just been given a sack of onions that, as hard as I try, I am not going to be able to get through them all quick enough. Can I just dice the remaining onions and freeze them or do I need to do anything else?", "url": "https://www.reddit.com/r/freezermeals/comments/1hrz1bt/freezing_onions/", "created_utc": 1735838770.0, "score": 5, "author": "Mark_W1410", "num_comments": 5, "permalink": "/r/freezermeals/comments/1hrz1bt/freezing_onions/", "html_title": ""}
{"title": "Joshua Weissman - Easy and Healthy Meals That Last The WHOLE Month", "selftext": "", "url": "https://www.youtube.com/watch?v=97apbyvwbvY", "created_utc": 1725420069.0, "score": 6, "author": "atomicpenguin12", "num_comments": 0, "permalink": "/r/freezermeals/comments/1f8jcac/joshua_weissman_easy_and_healthy_meals_that_last/", "html_title": "Easy and Healthy Meals That Last The WHOLE Month - YouTube"}
{"title": "Looking for bloggers or recipes for freezer meals ", "selftext": "That I can dump in my Dutch oven. Not a fan of a slow cooker. I work from home so the Dutch oven works for me.  It's been so busy with school and work I have barely time to cook but want to be prepared and keep eating somewhat healthy. ", "url": "https://www.reddit.com/r/freezermeals/comments/1faep3t/looking_for_bloggers_or_recipes_for_freezer_meals/", "created_utc": 1725627921.0, "score": 5, "author": "Imaginary-Rabbit5179", "num_comments": 5, "permalink": "/r/freezermeals/comments/1faep3t/looking_for_bloggers_or_recipes_for_freezer_meals/", "html_title": ""}
{"title": "Freezer meal ideas", "selftext": "I am going away for a month and need some ideas for food to prep for my house while I’m away. \nYes I am aware of weaponised incompetence, but my dad has never had to live without my mum, and I’m taking her away with me, so he’s being left on his own for the first time in over 30 years and I’d rather he didn’t live on takeout or dry toast.\n\nSo far, I’m thinking - chilli, lasagne, shepherds/cottage pie, maybe a soup?\nBut any ideas would be welcome because a month is a long while and I don’t want him to get bored.\n\nFor what it’s worth - spending time in the kitchen is my love language so I am really excited for prepping a whole months worth of food, I would not be doing this if I didn’t want to! ", "url": "https://www.reddit.com/r/freezermeals/comments/1cdyqc3/freezer_meal_ideas/", "created_utc": 1714170933.0, "score": 4, "author": "Sure-Teacher5920", "num_comments": 3, "permalink": "/r/freezermeals/comments/1cdyqc3/freezer_meal_ideas/", "html_title": ""}
{"title": "First time making meals", "selftext": "Hi all I just got a deep freezer two days ago I have been reading the post about what is good to make for freezer meals and what’s not. So a couple of questions. \n\nAfter I put the meals in containers do I need to let them cook before putting them in the freezer? \n\nCan I freeze rice after it is cooked or will it turn to mush? \n\nSo far today I have made chili, lasagna and 5 cheese tortellini. I have the stuff to make meatloaf and fajitas also will the last two freeze well?", "url": "https://www.reddit.com/r/freezermeals/comments/wq1iub/first_time_making_meals/", "created_utc": 1660674020.0, "score": 4, "author": "celticgrl77", "num_comments": 3, "permalink": "/r/freezermeals/comments/wq1iub/first_time_making_meals/", "html_title": ""}
{"title": "r/freezermeals Lounge", "selftext": "A place for members of r/freezermeals to chat with each other", "url": "https://www.reddit.com/r/freezermeals/comments/p0ne86/rfreezermeals_lounge/", "created_utc": 1628458089.0, "score": 5, "author": "drunkenknitter", "num_comments": 0, "permalink": "/r/freezermeals/comments/p0ne86/rfreezermeals_lounge/", "html_title": ""}
{"title": "Probably a dumb question", "selftext": "Im going to have back surgery next month so I'm gathering recipes to prep and freeze. What I'm wondering is some don't mention anything about thawing... Can my husband pull from freezer and cook in slow cooker for hours or does everything have to thaw first? I know, probably a dumb question ", "url": "https://www.reddit.com/r/freezermeals/comments/1jc7mvg/probably_a_dumb_question/", "created_utc": 1742079951.0, "score": 3, "author": "Ban4na_Shark", "num_comments": 8, "permalink": "/r/freezermeals/comments/1jc7mvg/probably_a_dumb_question/", "html_title": ""}
{"title": "Need Help!", "selftext": "I just made a potentially expensive mistake.  I’ve been ordering Hungryroot and have to complete my cart by each Thursday.  I normally go through the meals and select what I looks good and then I’ll go back to the cart and select  the top items only.  Long story short, I’ve had a lot going on and forgot to go through the cart so I’m getting enough food to feed a family of 10 for at least a month.  It’s just my husband and I.  \n\nI love cooking and enjoy the prep so thankfully this is not my problem.  Should I freeze raw / uncooked items individually?  Make full meals and freeze those individually?  Prepare  proteins / veggies individually?  What works best for you. \n\nAny recommendations on what basic containers I can quickly stock up on as I don’t have much currently. \n\nPlease give me your tips and tricks! ", "url": "https://www.reddit.com/r/freezermeals/comments/1jb12e3/need_help/", "created_utc": 1741949381.0, "score": 2, "author": "CleverUserName2016", "num_comments": 1, "permalink": "/r/freezermeals/comments/1jb12e3/need_help/", "html_title": ""}
{"title": "What am I doing wrong.", "selftext": "I tried prepping some freezer meals a few weeks ago. All chicken meals frozen in a marinade. \n1 week ago I took out a meal and put it into the fridge to defrost. I put it in the evening before so probably was in the fridge for about 12 hours. In the morning it was still frozen. I ended up defrosting via a water bath. Chicken tasted good. Was still a little frozen when I put in the crock pot so a little tough but would definitely make again. \nFriday morning I put the next meal in the fridge for dinner on Saturday which would give about 24 hours in the fridge before it would go in the crockpot. Saturday ends up being hectic and I forget to put it in the crockpot in time so I decide I'll just do it tomorrow. \nSo Sunday comes, today. I go to get the chicken out and it's still partially frozen. At this point It's had 48 hours to defrost in the fridge. \nWhat am I doing wrong?\n", "url": "https://www.reddit.com/r/freezermeals/comments/1iwf433/what_am_i_doing_wrong/", "created_utc": 1740331028.0, "score": 2, "author": "Sewing-123", "num_comments": 2, "permalink": "/r/freezermeals/comments/1iwf433/what_am_i_doing_wrong/", "html_title": ""}
{"title": "Help!", "selftext": "I made a big batch of soup yesterday. I’m a teacher, and they called me off for today and tomorrow due to the cold and wind chill. \n\nLong story short. I let soup cool off the heat for almost two hours with the intent to freeze it. I wanted to store it in my freezer flat. So I put the soup into freezer bags and put them on a sheet pan. \n\nSince it was so cold - I figured it would freeze solid outside in my garage. When I checked them this morning, they weren’t frozen. But it was super chilly in the garage. \n\nDo we think they’re safe? ", "url": "https://www.reddit.com/r/freezermeals/comments/1i6xt9p/help/", "created_utc": 1737505195.0, "score": 2, "author": "Kindly-Pollution-239", "num_comments": 1, "permalink": "/r/freezermeals/comments/1i6xt9p/help/", "html_title": ""}
{"title": "Lidding film for freezer meals at home?", "selftext": "I want to purchase some compostable paper trays and make up 30-50 freezer meals at a time for taking meals to work.\n\nI’m concerned about leaking, especially for my husband who commutes by train everyday.\n\nI was excited to try to get compostable “Lidding Film” for the meals — but am having a hard time finding any solution that’s not super commercial. \n\nHas anyone tried this? I’m willing to invest a little money in a materials to make this a really effective solution!\n", "url": "https://www.reddit.com/r/freezermeals/comments/1hozt8w/lidding_film_for_freezer_meals_at_home/", "created_utc": 1735490476.0, "score": 2, "author": "phumphie", "num_comments": 0, "permalink": "/r/freezermeals/comments/1hozt8w/lidding_film_for_freezer_meals_at_home/", "html_title": ""}
{"title": "How to store frozen cubes?", "selftext": "So this is my first time freezer meal-prepping! (Woo!!)\n\nI’m using souper cubes to freeze my soup, but the soup I have is more than what would fit in the containers. After the 1st round froze, I was going to store them and move on to the next, but I’m not entirely sure how to do that.\n\nShould I saran wrap the frozen blocks and store them in a ziploc bag? Since the blocks are frozen can I just put them in a ziploc bag without having to wrap them?\n\nIf there are any environmentally friendly options then I’m all ears!\n\nThanks for the thoughts/advice ahead of time!! ", "url": "https://www.reddit.com/r/freezermeals/comments/1iv68ay/how_to_store_frozen_cubes/", "created_utc": 1740183899.0, "score": 1, "author": "Glum-Angle3644", "num_comments": 23, "permalink": "/r/freezermeals/comments/1iv68ay/how_to_store_frozen_cubes/", "html_title": ""}
{"title": "Freezer meals to give during hard times?", "selftext": "", "url": "/r/mealprep/comments/1gkzfwx/freezer_meals_to_give_during_hard_times/", "created_utc": 1730906689.0, "score": 1, "author": "Majestic_Car", "num_comments": 0, "permalink": "/r/freezermeals/comments/1gl10j3/freezer_meals_to_give_during_hard_times/", "html_title": ""}
{"title": "Freezing food expanding", "selftext": "Hi, just wondering can my friend freeze her  leftover curry in a plastic box but it is filled right to the brim. We know it will expand, but will it burst and explode the box?", "url": "https://www.reddit.com/r/freezermeals/comments/1af09ci/freezing_food_expanding/", "created_utc": 1706650950.0, "score": 1, "author": "Specific-Profile-775", "num_comments": 0, "permalink": "/r/freezermeals/comments/1af09ci/freezing_food_expanding/", "html_title": ""}
{"title": "The Power and Precision of Good Freeze Dryers", "selftext": "Superior Preservation Precision: Freeze dryers meticulously preserve substances by removing moisture, retaining original structure, taste, and nutritional value.\n\nVersatile Applications Across Industries: Widely employed in the food industry for preserving fruits, vegetables, and complete meals. Vital in pharmaceuticals for preserving medications and in laboratories for biological samples.\n\nSublimation Process Explained: Involves freeze-dryer the material and subjecting it to a vacuum. Sublimation occurs, transforming frozen water directly from solid to gas, leaving the substance dehydrated.\n\n&#x200B;", "url": "https://www.reddit.com/r/freezermeals/comments/17s1m06/the_power_and_precision_of_good_freeze_dryers/", "created_utc": 1699614060.0, "score": 1, "author": "Equal_Bread270", "num_comments": 0, "permalink": "/r/freezermeals/comments/17s1m06/the_power_and_precision_of_good_freeze_dryers/", "html_title": ""}
